{
  "Alexandria": {
    "Maktabat al-Baladiyya": {
      "4765DFalak": "<p dir=\"auto\">Risāla 1.3. (astronomy) from <span class=\"italics\">Rasāʾil ikhwān al-Ṣafāʾ</span>. Copied in 911/1505-6.</p><p dir=\"auto\">11 folios, 24 lines per page, 20,5x13cm.</p><p dir=\"auto\">This copy seems to be fairly variant from the published edition based on first and last lines reproduced in the catalogue.</p>"
    }
  },
  "Algiers": {
    "Bibliothèque nationale d'Algérie": {
      "AlgiersMuseum1452": "<p dir=\"auto\">A copy of <span class=\"italics\">Risālah fī al-hayʾah</span>. Misattributed to Ibn Sīnā. Needs further research.</p>"
    }
  },
  "Ankara": {
    "Adnan Ötüken İl Halk Kütüphanesi": {
      "06Hk1454": "<p dir=\"auto\"><span class=\"italics\">M</span><span class=\"italics\">ukhtaṣar</span> of the <span class=\"italics\">Rasāʾil</span>, dated to 1133/1720.</p><p dir=\"auto\">0b: list of rasāʾil nos. 43-53 (one folio at least missing)</p><p dir=\"auto\">1a: “Mukhtaṣar Rasāʾil ikhwān al-ṣafāʾ ʿalā al-tamām waʾl-kamāl waʾl-ḥamdu liʾl-Lāh ʿalā kull ḥāl”, no authorship noted</p><p dir=\"auto\">1b: “al-awwal min risālat al-akhlāq wa-tahdhīb al-nafs”</p><p dir=\"auto\">54a: colophon: 14 Shawwāl 1133.</p><p dir=\"auto\">In a manuscript of what appears to be the same text held in Riyadh, al-Jāmiʿa al-imām Muḥammad b. Saʿūd al-islāmiyya, potentially MS 6671 (?), the authorship of this text is attributed to Dāwūd b. ʿUmar al-Anṭākī (d. 1008/1559), a famous physician and scholar of the 16th century.</p>",
      "06Hk266": "<p dir=\"auto\">Persian translation (not identified as <span class=\"italics\">Mujmal al-ḥikma</span>). Nastaʿlīq script. 150 folios. Flyleaf with quite a lot of writing, including a bit in secret script. Title only given in Arabic “Rasāʾil Ikhwān al-Ṣafāʾ” on 1b.</p><p dir=\"auto\">Colophon dated to 869/1464-5:</p><p dir=\"auto\">تمام شد كتاب منطق الهيئة</p><p dir=\"auto\">زر روز يك ... بيست شستم ماه …</p><p dir=\"auto\">ختم يا ابخير وظفر در تاريخ</p><p dir=\"auto\">سنه تسع وستين وثمانمايه</p>"
    }
  },
  "Arak": {
    "K. Ibrahim Dehgān": {
      "106": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>, copied 19 Dhū al-Qaʿda 1370 / 22 August 1951 by Muḥammad Bāqir. 203 folios, 20 lines per page.</p><p dir=\"auto\">This manuscript contains a long note after the fifth treatise, attributing authorship to imam Aḥmad whose genealogy is given + authorship of RJ and RJJ attributed to him as well. Copied from Fehrestegan:</p><p dir=\"auto\">»در كتاب اخوان الصفا و خلان الوفا تأليف علامه فهامه شريف سيد احمد ابن عبداالله ابن محمد مكتوم ابن اسماعيل ابن الامام المغارب و المشارق حضرت جعفر صادق عليه السلام و حال اين سيد اجل از رياض الجنان تأليف ملا اشرف ابن عبدالولي اسماعيلي چنان بهوضوح انجاميده كه هرگاه امام زاده اسماعيل روبروي والد ماجد خود رحلت كرد، پسرش محمد مكتوم در ظل رأفت جد خود پرورش يافته در مدينه منوره مستتر الحال ميزيست، ... سيد احمد حاصل اين ۵۱ رساله در يك رساله نوشته، نامش »جامعه« گذاشته و رساله ديگر موسوم به »جامعه الجامعه« نوشته و اين هر دو رساله عزيز الوجودند، ... در عهد امير تيمور رسايل اخوان الصفا به فارسي ترجمه گرديد و متفرق بود، تا اين كه نسخه عليقه از كتب خانه سردفتر مورخان ابوالفضل مولانا محمد عباس ... معروف بشهاب اليميني الشيرواني ابن حاج ميرزا محمد تقي خان همداني ابن اشرف الوزرا، الشهيد السعيد مستوفي الممالك دولت نادر ميرزا محمد علي ابن عمدة الوزراء ميرزا ابراهيم خان ابن الزكي الجواد يوسف الانصاري الخزرجي السليمي المدني بدست خاكسار ميرزا محمد ملك الكتاب افتاد در سنة ۱۳۰۱ ... بهر حال محمد باقر ابن ملا سلطانعلي گواري نسخه مغلوطي بدست آورد از عهد امير تيمور، با وجود اغلاط فاحشه، اكثر مطالب، او را از ارتباط انداخته ... اگر اين نسخه در بمبئي به چاپ نرسيده بود، نظيري از نسخههاي او بدست نميآمد، كه اين نسخه را با او مقابله نمايد ...، چنانكه اين كتاب از كتب مرحوم شيخ ابراهيم بروجردي بوده و بعد از آن بدست مرحوم آخوند ملا محمد تقي گلپايگاني ساكن دار السرور افتاده ... اكنون به واسطه اندك چيزي بدست حقير افتاده است، سنة ۱۳۰۲ ذي قعده مطابق بارس ئيل تركي«</p><p dir=\"auto\">Fehrestegan notes that the translation of this text is said to have happened during Amir Timur’s reign.</p>"
    }
  },
  "Baghdad": {
    "Baghdadli Wahbi": {
      "Sh2023": "<p dir=\"auto\">Extract in majmūʿa. Potentially identical to manuscript from Dār al-Kutub wa-l-wathāʾiq al-waṭaniyya, although, if so, unclear where this call number would originate.</p>"
    },
    "Dār al-Kutub wa-l-wathāʾiq al-waṭaniyya": {
      "128710462?": "<p dir=\"auto\">Extract in <span class=\"italics\">majmūʿa</span>, pages 43-115 (manuscript is paginated, not foliated). Written in a nastaliq hand, red rubrication and overlining. Appears to be a compilation of texts of magical and alchemical focus, produced in late 13th/19th century.</p><p dir=\"auto\">pp. 2-42: <span class=\"italics\">Bughyat al-khabīr fī qānūn al-iksīr</span>, one of the works of Aydamur ʿAlī [al-Jildakī, d. 743/1342]: relatively many marginal notes</p><p dir=\"auto\">pp. 43-115: <span class=\"italics\">Risāla min jumlat rasāʾil ikhwān al-ṣafāʾ li-l-fāḍil al-ʿālim al-baḥr al-kāmil al-Majrīṭī</span> = starts with Epistle on Magic, long recension, starting in section (٦٣) فصل في أن كل علم صدر وكل فعل ظهر at</p><p dir=\"auto\">واعلم يا أخي أن حقيقة هذا الاسم هي الخاصة الموجودة في المستحقين له بالحقيقة لأعلى طريق المجاز.</p><p dir=\"auto\">واعلم يا أخي، أيدك الله تعالى، أنه لا سبيل إلى صفاء النفس إلا بعد بلوغها إلى حد الطمأنينة في الدين والدنيا جميعا</p><p dir=\"auto\">Colophon at p. 115: 7 Ṣafar 1289/16 April 1872.</p><p dir=\"auto\">pp. 116-19: blank pages</p><p dir=\"auto\">pp. 120-..: “kitāb-i qamar – baʿaḍ az kitāb ghāyith al-marād - Shaykh Tatarī (?)</p><p dir=\"auto\">pp. 145-79: different script, heavily vocalized, several section of what appear to be Qur’anic invocations, preceded by Persian designations (of what they can be used for?) – needs further study</p><p dir=\"auto\">pp. 180-195: tables</p><p dir=\"auto\">Rest of the volume needs further study, Persian proficiency required.</p><p dir=\"auto\">Scan kindly provided by the staff of the Imam Husain shrine in Kerbala.</p>"
    },
    "Kāẓimiyya Maktabāt al-Jawādīn al-ʿĀmma": {
      "5": "<p dir=\"auto\">23 folios. Dhū l-Ḥijja 1237/1822, seems to be a sort of commentary or essay about Ikhwan by Kāẓim b. Qāsim al-Rashtī (d. 1843) entitled “Rasāʾil fī ikhwān al-ṣafā”. May thus be an unrelated text that simply used the phrase “Ikhwān al-ṣafāʾ.”</p>"
    }
  },
  "Baku": {
    "Academy of Sciences Azerbaijān": {
      "6086B25605": "<p dir=\"auto\">“al-maqālā al-ʿāshira min rasāʾil ikhwān al-ṣafāʾ” (5 folios?). Dated 1304/1886-7.</p>"
    }
  },
  "Beirut": {
    "American University of Beirut Library": {
      "140455": "<p dir=\"auto\"><strong>E</strong><strong>arlier call number: 1125 [MS189.3: I26bA]</strong></p><p dir=\"auto\"><strong>“</strong>Some rasāʾil”.</p>"
    },
    "Université St. Joseph": {
      "381": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ.</span> 17th C (?) Purchased by Louis Cheikho in Aleppo in 1887 CE; ownership seal, page 5. 45 epistles. Defective at start. Not a very nicely produced manuscript (?). Binding appears to have some random notes, in Ottoman Turkish, referring not to text but prices in qurush?</p>",
      "382": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ.</span> 1808 CE (dated in Christian Era). Purchased by Louis Cheikho in Beirut. Preceded by a few folios of another text making reference to “falāsifa”. Title page: “hādhihi rasāʾil ikhwān al-ṣafāʾ ʿalā al-tamām waʾl-kamāl”. All the instances of “iʿlam ayyuhā l-akh” are rubricated in red. Colophon states it was copied by monks in the village of Miʿilya (in Northern Galilee) (+ …, unclear to me)</p>",
      "383": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ.</span> 17th C, very incomplete MS, only 58 folios. Starts at 2.5. Titles given in both French and Arabic. “Purchased by Louis Cheikho in Aleppo in 1887 CE; it was part of the Library of the Jesuits in Aleppo prior to its closure in the 18th century, see note in Latin, page 1”</p>"
    }
  },
  "Berlin": {
    "Staatsbibliothek zu Berlin": {
      "DiezAoct132": "<p dir=\"auto\">Very early copy of <span class=\"italics\">Mujmal al-ḥikma</span> (denoted as such in the colophon - title page bears crossed out title “Tarjamat Mujmal al-ḥikma bi-l-Fārsiyya” and below that “Jāmiʿ funūn al-ḥikma”).</p><p dir=\"auto\">Dated likely to 8 Ṣafar 608/22. Juli 1211, copied in Siwas by Ḥusayn b. Muḥammad b. Yaʿqūb al-Turkumān. Clean copy, red rubrication.</p><p dir=\"auto\">204 folios, size <strong>16,5 x 12 cm.</strong></p>",
      "Glaser7": "<p dir=\"auto\">Partial copy:<strong> </strong>“rasāʾil 3 and 4 from the rasāʾil al-jismāniyya” (one title near the end aligns with part of the first risāla in jismāniyyāt and ṭabīʿiyyāt). Has quite a lot of notes on title page, but very damaged and difficult to read.</p><p dir=\"auto\">10 folios, 21 lines per page (19x11cm), size 23x15,5cm. Yemeni script according to Ahlwardt, around 800/1400.</p><p dir=\"auto\">Title page:</p><p dir=\"auto\">الجزء الثالث من رسائل اخوان الصفا وخلان الوفا</p><p dir=\"auto\">من رسائل الجسمانية</p><p dir=\"auto\">فيه رسالة في الهيولى والصورة وما فيها والزمان</p><p dir=\"auto\">والمكان ورسالة في السماء والعالم الخ</p>",
      "PetermannII361": "<p dir=\"auto\">Epistle 2.8 - Rabīʿ II 1227/04.-05.1812, copied in Calcutta.</p>",
      "Sprenger1141": "<p dir=\"auto\">Brief extract in majmūʿa (folios 37b-38b, little piece from risāla 1.3 about how the science of the stars consists of three things). Other contents of the majmūʿa described in Ahlwardt, vol. 7:8089. It otherwise mostly consists of poetry. First poem (folios 1-21) dated to Jum II 906/1500, but a later section (folios 35-37) is from around 1200/1785</p>",
      "Sprenger1946": "<p dir=\"auto\">Three epistles from Qism 2.</p><p dir=\"auto\">Folios 1b-144 = risāla 2.8 (animals)</p><p dir=\"auto\">Folios 145a-168b = 2.16 (only indicated at the end)</p><p dir=\"auto\">Folios 169a-256a = 2.17.</p><p dir=\"auto\">Title page (+ ending of epistles transcribed by Ahlwardt as well):</p><p dir=\"auto\">هذه مجلد من كتاب اخوان الصفا وخلان الوفا</p><p dir=\"auto\">الرسالة ٨ في تكوين الحيوان</p><p dir=\"auto\">الرسالة الثامنة من الطبيعيات في اصناف الحيوانات</p><p dir=\"auto\">256 folios, 15 lines per page (13x7,5cm), size 21x14,3cm. “Persian” handwriting, red rubrication.</p>",
      "Sprenger19481": "<p dir=\"auto\">(Pertsch, Persisch 91)</p><p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span> in majmūʿa (folios 1-121 of 172, rest is “Persian poems as well as extract from Anwār-i Suhailī]”).</p><p dir=\"auto\">Copied by Qāsim b. Ḥasan Kīlānī dated to 20 Jum I 1050 / 7 September 1640. Apparently inaccessible at the library.</p>",
      "WetzsteinII11532": "<p dir=\"auto\">Risāla 1.3 in majmūʿa on science of the stars, folios 34a-84. Rather extensive description by Ahlwardt + edition of several fragments.</p><p dir=\"auto\">12th/18th C.</p><p dir=\"auto\">First part of the majmūʿa discussed in Band 5, p. 296, nr. 5896, total amount of folios is 84. First work is an unidentified astrological work, section titles given by Ahlwardt.</p>",
      "WetzsteinII1889": "<p dir=\"auto\">Partial (3.1-3.10 & 4.1), Dhū al-ḥijja 717/1318, copied by Abū al-Ẓaffa[r?] Muḥammad b. al-Ashraf b. Muḥammad al-Ḥusaynī al-Nassāba, notes that he copied it from a faulty and unvocalised MS. Order of the copy is somewhat messed up according to Ahlwardt.</p><p dir=\"auto\">This copyist is a known literary scholar, born in 677, was in Tabriz in 707 => Ibn al-Fuwaṭī, <span class=\"italics\">Majmaʿ,</span> 3:156-157</p><p dir=\"auto\">فخر الدين أبو الظفر محمد بن علي الأشرف.</p><p dir=\"auto\">ابن محمد بن جعفر بن أبي القاسم هبة الله بن علي بن الحسن بن أبي القاسم بن محمد بن علي بن محمد بن عبد الله بن الحسن الأفطس بن علي بن الحسين بن علي بن أبي طالب.</p><p dir=\"auto\">من أفاضل السادة العلويين له كلام فصيح وخط ملي وود صحيح وأدب وافرا اجتمعت بخدمته بتبريز وأقام في عمارة المخدوم رشيد.</p><p dir=\"auto\">وكتب لي كراسة من شعره بخطه وسألته عن مولده فذكر أنه ولد ببغداد سنة 677 وأنشدني لنفسه سنة 707 وكتب النسب وقرأه على النقيب وله ديوان كأنه بستن ينيف على عشر مجلدات ومن شعره:</p><p dir=\"auto\">حل بتبريز شادن سلب الروح والبدن * سكن مذ عرفته في صميم الحشا سكن وبساجي لحاظه صد عن مقلتي الوسن * انا من فرط حبه ذو غرام وذو شجن عجمي ان قلت من همت فيه يقل من * وإذا لام عذلي لاح في وجهه الحسن</p>",
      "WetzsteinII673": "<p dir=\"auto\">Risāla 2.8 (animals), ca. 900/1404</p><p dir=\"auto\">f. 1a\nكتاب كليلة ودمنه وما شاكلهما وفى بيان بدء الخلق وتوالد بنى آدم</p>",
      "WetzsteinII1176": "<p dir=\"auto\">Partial (2.5 - 2.9), no title. 149 folios, 15 lines per page (16,5x11,5cm) size 22,5x16,5cm. Folio 149b contains a love poem.</p><p dir=\"auto\">Ahlwardt situates the manuscript ca. 600/1203, which would make it one of the oldest known copies.</p>",
      "WetzsteinII1219": "<p dir=\"auto\">Risāla 51 on magic (appears to be the long recension) in <span class=\"italics\">majmūʿa</span>, folio 31b-103a.</p><p dir=\"auto\">Catalogue provides title, start, ending and titles of <span class=\"italics\">fuṣūl</span>.</p><p dir=\"auto\">Title and start:</p><p dir=\"auto\">الرسالة الحادية والخمسون الموسومة بالسحر والعزايم من القسم الرابع الناموس الالهي من جملة رسايل اخوان الصفا وخلان الوفا تهذيبا للنفس واخله الاخلاق […]</p><p dir=\"auto\">اعلم ان السحر ينصرف على معاني كثيرة في اللفظ العربي … ونريد ان نذكر ما يليق بكتابنا هذا ليكون دليلا على ليكون دليلا على ما نورده من القول في هذا الفن الخ</p><p dir=\"auto\">[…]</p>",
      "WetzsteinII1834": "<p dir=\"auto\">Extract in majmūʿa, folios 18a-25. Piece on the phases of the moon. Clearly titled section, red rubrication. 25b: dated to Jum I 1200 (1786). First risāla has association of climate zones to planets, this first risala also dated to Jum I 1200, scribe is Muḥammad b. al-ḥājj Ḥasan al-Qabristānī.</p>"
    }
  },
  "Birmingham": {
    "Cadbury Research Library": {
      "Mingana821180BF": "<p dir=\"auto\">Five short extracts of astrological content (20 folios)</p>",
      "Mingana822711": "<p dir=\"auto\">19th C (?), extracts (115 folios)</p>"
    }
  },
  "Bonn": {
    "Universitäts- und Landesbibliothek": {
      "So15": "<p dir=\"auto\">752 pages, 26x17 cm, 9 lines per page. Arabic with Persian glosses. Apparently only epistle on animals, but very large book if so.</p><p dir=\"auto\">Colophon largely in Persian: copyist Sayyid Shāh ʿAbd al-ʿAzīz Qalandar Bukhārī in the year 2 Jumādā II 1225/5 July 1810 (both AH and CE year given) = likely in Calcutta given English note on title page</p><p dir=\"auto\">Note on title page: A. Lockett. 7. Aug. 1810. College of Fort William (Calcutta).</p><p dir=\"auto\">Later owned by Benedict La Roche (1802-76), who bought it for 40 sicca rupees on 9 February 1821 in Calcutta.</p><p dir=\"auto\">Catalogue description in Gildemeister (nr. 15) is in Latin—needs closer study.</p>"
    }
  },
  "Bursa": {
    "Inebey Kütüphanesi": {
      "Haracci916": "<p dir=\"auto\">No title page. Starts with fihrist followed by first and second qism up to Risāla on animals. 162 folios. Naskh, red rubrication.</p><p dir=\"auto\">Final two folios are unrelated material on companions of the Prophet. Contains scientific diagrams in the first rasāʾil.</p>",
      "Haracci917": "<p dir=\"auto\"><span class=\"italics\">al-Risāla al-Jāmiʿa</span>, but only 142 folios. Dated to Thursday 12 Ṣafar 737/28 September 1336 (Friday according to conversion). Flyleaf identifies the text as a part of <span class=\"italics\">Ikhwan al-Safa</span>, but the second flyleaf gives an alternate title: <span class=\"italics\">Kitāb Muntaḥar al-shaqāʾiq al-ṣafāʾ li-arbāb al-wafāʾ waʾl-rafāʾ</span>.</p><p dir=\"auto\">Starts 1b with basmala then something wiped out in red followed by:</p><p dir=\"auto\">فاتحة الكلام</p><p dir=\"auto\">في معرفة ما به الفوز في النشاه الانسانيه مم المرام</p><p dir=\"auto\">والنجاة مما يستوحب الخريطة</p><p dir=\"auto\">والملام</p><p dir=\"auto\">فنقول وبالله العون والعصمة والتوفيق</p><p dir=\"auto\">والحول والقوة</p><p dir=\"auto\">الغرض المطلوب من هذا الكتاب هو البيان عن كيفيه بلوغ الانسان</p><p dir=\"auto\">بدوام انتقاله وتغير احواله الى حد كما له واخر معاده وماله</p><p dir=\"auto\">وكيف نتصل برتبه الملايكه الاخيار ويصل الى دار القرار ومحل</p><p dir=\"auto\">Folio 2a roughly matches Saliba edition 1:671, so this is likely only the second volume of a two-volume set.</p><p dir=\"auto\">Colophon 142a-142b:</p><p dir=\"auto\">نجزت الرسالة الجامعة ذات الفوايد النافعه ||</p><p dir=\"auto\">والانوار الساطعة والبراهين اللامعة وحجج</p><p dir=\"auto\">القاطعه تاج رسايل اخوان الصفا وخلان</p><p dir=\"auto\">الوفا فى تهدى النفس واصلاح الاخلاق</p><p dir=\"auto\">وذلك في يوم الخميس الثانى عشر من</p><p dir=\"auto\">صفر ختم بالخير من سنه سبع</p><p dir=\"auto\">وثلثين وسبعمايه هجريه والحمد لله</p><p dir=\"auto\">وحده وصلواته على ساير المرسلىن</p><p dir=\"auto\">خصوصًا على سيدنا محمد واله</p><p dir=\"auto\">الطيبين الطاهرين</p><p dir=\"auto\">وسلامه رب وقف واعن</p><p dir=\"auto\">برحمتك يا ارحم</p><p dir=\"auto\">الراحمين</p><p dir=\"auto\">Notes:</p><p dir=\"auto\">Flyleaf has acquisition note from 993 (1585) by Ṣājāl (?) Amīr Efendi.</p><p dir=\"auto\">143b consultation note: Jalāl al-Dīn b. Al-shaykh ʿAbd al-Qādir al-Kīlānī Rabīʿ II 1007 (November 1598).</p>",
      "Haracci1200": "<p dir=\"auto\">A copy of <span class=\"italics\">Mujmal al-ḥikma</span>, which appears to be complete. The title page mentions the <span class=\"italics\">Mujmal</span> title and attributes the compilation to a Khurasanian man and implies that after its translation into Persian it was also translated into Rūmī. Some of this information is also given in near identical phrasing by Ḥajjī Khalīfa in <span class=\"italics\">Kashf al-ẓunūn</span>, although he states instead that it was translated into Darī (I am grateful to Laura Tribuzio for notifying me of this).</p><p dir=\"auto\">The title page also contains some notes in what appears to be Ottoman Turkish, but these are not dated.</p><p dir=\"auto\">Folios 1b-3a are empty, perhaps left open to add a table of contents attested in multiple older copies. It is also possible that the title page was actually added later than the body text, but the handwriting does appear to be the same as that of the body text.</p><p dir=\"auto\">Waqf seal on 3b dated to 1163/1749-50 (repeated on 164b, but faded). Quite a few marginal notes, mostly content indicators (<span class=\"italics\">maṭlab</span>).</p><p dir=\"auto\">164 folios., 15 lines per page.</p><p dir=\"auto\">Size: 174x122. Text surface: 123x70 mm.</p>",
      "Hseyinelebi419": "<p dir=\"auto\">This is a very interesting copy that would be worthwhile for closer study.</p><p dir=\"auto\">Manuscript compiling different handwritings (for some reason difficulty loading this MS from server, proper study was not doable). Perhaps a copy that was repaired by adding folios to the MS.</p><p dir=\"auto\">Title page (2a) explicitly attributes text to al-Majrīṭī in the same hand as the main text. 1b contains a tarjama of al-Majrīṭī (with attribution to <span class=\"italics\">Ijābat al-Ḥakīm wa-aḥaqq al-shaykhayn fi-l-taqdīm</span>. Introduction notes that one should start with Isagoge (10th risāla) according to the logicians plus some discussion about authorship.</p><p dir=\"auto\">Later half of MS is in different handwriting, would appear to be quite old</p>"
    }
  },
  "Cairo": {
    "Al-Azhar Library": {
      "7246Aba437": "<p dir=\"auto\">“Full copy in four volumes” 1283 AH (1866-7) by a certain Jalā (?) al-Sharqāwī.</p><p dir=\"auto\">All other copies noted in the catalogue are print copies.</p><p dir=\"auto\">(from Fahāris vol. 3 - Falsafa)</p>"
    },
    "Dār al-kutub wa-l-wathāʾiq al-qawmiyya": {
      "143?": "<p dir=\"auto\"><span class=\"italics\">al-Risāla al-Jāmiʿa</span>. Full copy? Mentioned by Murad Kacimi.</p>",
      "Riya301": "<p dir=\"auto\">Extracts in <span class=\"italics\">majmūʿa</span>:1 (fols. 1v-4v):<strong> </strong>ca. 700AH + 2 (fols. 5r-8v), respectively arithmetic (1.1.) and geography (1.4).</p>",
      "Haya10": "<p dir=\"auto\">Extract in <span class=\"italics\">majmūʿa</span> as second text (25a-40a), alongside another text on <span class=\"italics\">hayʾa</span>. Dated to 1163/1749, copied in Maghrebi hand.</p>",
      "Haya43": "<p dir=\"auto\">38 folios. Dated to 1237/1821.</p>",
      "Haya49": "<p dir=\"auto\">Not an MS, but potentially bound and filed in general collection. A photocopy of London, British Library Add. 9599/27.</p>",
      "ikmatTaymr143": "<p dir=\"auto\">Rasāʾil ikhwān al-ṣafāʾ, 477 pages, 17 lines per page.</p><p dir=\"auto\">Data source: copy in Arabic Manuscripts Institute al-falsafa waʾl-manṭiq 431.</p>",
      "Khidiwiyya9875": "<p dir=\"auto\">27 rasāʾil with “waqfat al-kitāb”, attributed to al-Majrīṭī (?)</p>",
      "Khidiwiyya9509": "<p dir=\"auto\">18<strong> </strong>Rabīʿ I 1279/1862, attributed to Abī Sulayman e.a. (i.e. the group of scholars noted by al-Tawḥīdī)</p>",
      "Khidiwiyya9510": "<p dir=\"auto\">Fragment of risāla 14.</p>",
      "MajmTaymr142": "<p dir=\"auto\">Epistle on music in a <span class=\"italics\">majmūʿa</span>, pages 29-97 (no further info)</p>",
      "MajmTaymr331": "<p dir=\"auto\">Unclear if actually related to the tradition: a text entitled <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ wa-hidāyā akhdān al-wafāʾ</span> by Egyptian qadi and scholar Shihāb al-Dīn al-Khafājī (d. 1069/1659). Needs further study to establish link to the tradition.</p>",
      "Mqt122": "<p dir=\"auto\">Extract in <span class=\"italics\">majmūʿa</span> (3rd text: fols. 23r-29v): ca 1150AH, on arithmetic (1.1.).<strong> </strong></p>",
      "MusafFilmqt166": "<p dir=\"auto\">Extract in <span class=\"italics\">majmūʿa</span> (1st text, starts fol. 1v):<strong> </strong>ca. 1100H, on astronomy (1.3).<strong> </strong></p>",
      "alatikma383": "<p dir=\"auto\">Unclear whether this is a complete copy. It seems unlikely as it is listed as having only 224 fols. Dated ca. 600 AH. Contains passage on lunar crescent visibility that is not in published text.</p><p dir=\"auto\">Data source: King, <span class=\"italics\">A survey of Scientific manuscripts</span></p>"
    }
  },
  "Calcutta": {
    "Asiatic Society": {
      "O2": "<p dir=\"auto\">Old number 104. Partial copy (from eleventh risala?). Attributed to a certain shaykh ʿalāma Ibn J-ldī?</p>",
      "Ob12": "<p dir=\"auto\">(Ivanov 1364) <span class=\"italics\">Mujmal al-ḥikma,</span> 12th/18th C copy of first qism only.</p>",
      "Q48": "<p dir=\"auto\">(old number 747)</p><p dir=\"auto\">Extract in majmūʿa, containing otherwise several philosophical treatises by Aristotle, Plato, al-Fārābī and devotional treatises. Again attributed to Shaykh Ibn J-ldī.</p>"
    },
    "Buhar Library": {
      "337": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ,</span> catalogue notes some variation (esp. in titles) with published versions (up to the point of the catalogue’s compilation); this copy numbers the <span class=\"italics\">rasāʾil</span> from 1 to 52; ca. 15th C; luxurious copy, gold-ruled margins throughout, decorated title pages.</p>",
      "PersianMSSNo207": "<p dir=\"auto\"><span class=\"italics\">Tarjuma-yi Mujmal al-ḥikma.</span> Likely 15th century. No Timur dedication. Note on first folio attributes original <span class=\"italics\">Rasaʾil</span> to al-Majrīṭī al-Maghribī. Extensive discussion and table of contents in catalogue pp. 156-62.<strong> </strong></p>"
    }
  },
  "Cambridge": {
    "Cambridge University Library": {
      "EGBrowne1": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma.</span> Undated but before 1302/1885, only contains 39 epistles.</p><p dir=\"auto\">Princely circulation in India, belonged to Prince Farhād Mirzā who donated it to “Iḥtishām al-mulk” (= his son) in Jaʿfarabad 1302/1885 [see also MS Najaf Library of Ayatollah Jaʿfar Baḥr al-ʿUlūm 41!]</p>",
      "TSAr4098": "<p dir=\"auto\">Single folio of epistle 13.</p>",
      "TSAr4123": "<p dir=\"auto\">Single folio from 1. 5 , epistle on music (matches ms0119 of OpenITI Rasail).</p><p dir=\"auto\">Colour reproduction in Rustow, <span class=\"italics\">The Lost Archive</span>, pp. 194–5.</p>",
      "TSAr43276": "<p dir=\"auto\">Single folio of epistle 35 in Judeo-Arabic</p>",
      "TSAr43279": "<p dir=\"auto\">Single folio of epistle 19 and 21 in Judeo-Arabic</p>"
    },
    "King's College Library": {
      "Pote2": "<p dir=\"auto\">Partial copy of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span>. The manuscript is incomplete at the end where a note in English (in the hand of Henry Bradshaw?) indicates 167, 168 are wanting. Another note indicates R9 R10 wanting. Pote collection came from India. One note dated to 1118AH</p><p dir=\"auto\">Starts with treatise on alchemy.</p>"
    }
  },
  "Copenhagen": {
    "Royal Danish Library": {
      "CodArabAC20": "<p dir=\"auto\">partial copy, from 2.15 onwards (but with some inconsistencies, see description by Perho in catalogue). Dated 1191/1777-8; 339 folios; scribe: Muḥammad Maḥmūd Muḥammad Urdī ; colophon “min kalām khulaṣā (?) al-ṣūfiyya”; reproduction of first and last pages in catalogue ; couple of 19th century ownership/consultation notes</p>"
    }
  },
  "Damascus": {
    "Maktabat al-Asadiyya al-Waṭaniyya": {
      "1477": "<p dir=\"auto\"><span class=\"italics\">al-Risāla al-Jāmiʿa</span>:<strong> </strong>attributed to al-Majrīṭī. Copy made in Tripoli for Ḥusayn Bāshā Baklarbakī by a certain ʿAbd al-Razzāq al-Kūkājī al-Ḥamawī (date illegible apparently?). This MS formed the basis for the edition of the text by Ṣalībā.</p><p dir=\"auto\">Ḥusayn Bāshā Baklarbakī could be Ḥusayn Bāshā b. Yūsuf (d. 1026 AH), a son of the famous beylerbeyi Yūsuf Bāshā. Cfr. K.S. Salibi, “The Sayfās and the eyalet of Tripoli 1579-1640”, <span class=\"italics\">Arabica</span> 20/1 (1973), pp. 25-52, at 40-2 some info about various actions he undertook. Or it could be Jalālī Ḥusayn Bāshā, who is named in same article as succeeding the Sayfā domination of the eyalet. p. 42. By 1618 the latter is replaced again by someone else, ibid. p. 44. More info should be available in the contemporary source Khālidī (secretary of Fakhr al-Dīn Maʿn) edited in <span class=\"italics\">Lubnān wa’l-dawla al-ʿUthmāniyya fī ʿahd Fakhr al-Dīn al-Maʿnī al-thānī.</span> The article by Salibi basically paraphrases Yusuf Basha’s faltering career and his many altercations with Fakhr al-Dīn b. Maʿn.</p>",
      "5637": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-Ṣafāʾ</span>, partial copy (start at epistle on man as microcosmos). Copied by Ḥusayn al-Ḥusaynī, dated 1x41. 204 folios, 21 lines, 29cm × 17.5cm.</p>",
      "7374": "<p dir=\"auto\"><span class=\"italics\">al-Risāla al-Jāmiʿa</span><span class=\"italics\">:</span> no date or copyist named.</p>",
      "9323": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-Ṣafāʾ</span>, partial copy, seems to be from Fihrist up to 3.10. Announces 52 epistles. 354 folios, between 22 and 27 lines per page. 28x21cm.</p><p dir=\"auto\">Copied on 1 Rabīʿ II 1199 / 11 February 1785.</p><p dir=\"auto\">Copyist Aṣlān b. Mīr Ismāʿīl Zughbī, “min umarāʾ al-Qadmūs”</p><p dir=\"auto\">See also: <a href=\"https://khizana.bibliotheca-arabica.de/#id:DLvN4gESGLDbjrFyAYZc\" target=\"_blank\">https://khizana.bibliotheca-arabica.de/#id:DLvN4gESGLDbjrFyAYZc</a></p>",
      "9900": "<p dir=\"auto\"><span class=\"italics\">al-Risāla al-Jāmiʿa</span>: containing historical tidbits about Maṣyāf. Dated to 1280, copyists ʿAbd Allāh Ḥamdūsh and Maḥmūd ʿAlī Sulaymān. The former of these is also attested as copyist of London IIS 1000.</p>"
    }
  },
  "Djerba": {
    "Barounia": {
      "452256": "<p dir=\"auto\">91 pages, easterى handwriting</p><p dir=\"auto\"><strong>452</strong><strong> </strong><strong>ـ</strong><strong>256 * رسائل</strong><strong> </strong><strong>إخوان</strong><strong> </strong><strong>الصفا</strong><strong> </strong><strong>وخلان</strong><strong> </strong><strong>الوفاء (51 رسالة</strong>)</p><p dir=\"auto\"><strong>أوله</strong>: الحمد للّه وسلام على عباده الذين اصطفى اللّه خيرا ما يشركون · كتبنا رسائل إخوان الصفا وخلان الوفاء في تهذيب النفس وصلاح الأخلاق والأصدقاء الكرام وماهية أعراضهم وهي أحدى وخمسون رسالة في فنون العلوم والحكم وطرائف الآداب وهي مقسومة أربعة أقسام فمنها فلسفية ومنها جسمانية طبيعية ومنها نفسانية عقلية ومنها ناموسية الاهية</p><p dir=\"auto\"><strong>آخره</strong>: بلغك اللّه منازل الأخيار ورقاك إلى منازل الملائكة المقربين وإيانا وجميع إخواننا من المؤمنين برحمتك يا ارحم الراحمين ولا حول ولا قوة إلا باللّه العلي العظيم</p><p dir=\"auto\">تم هذا الكتاب بحمد اللّه وعونه وحسن توفيقه والحمد لله</p><p dir=\"auto\"><strong>خ</strong><strong>:</strong>شرقي</p><p dir=\"auto\">م : 31 / 22</p><p dir=\"auto\">ق: 91 صفحة</p><p dir=\"auto\">س : 31</p>"
    }
  },
  "Dublin": {
    "Chester Beatty Library": {
      "5425": "<p dir=\"auto\">7th/13th century (?), partial copy</p>"
    }
  },
  "Dushanbe": {
    "Library of the Academy of Sciences of Rep. of Tajikistan": {
      "361": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>, 12th C (AH), 168 folios; two names mentioned (= copyists? Owners?)</p>"
    }
  },
  "Edirne": {
    "Selimiye Yazma Eser Kütüphanesi": {
      "388": "<p dir=\"auto\">A very early partial copy of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span>, dated to beginning of Rabīʿ I 602 / October 1205. Copied by ʿUmar b. al-Ḥasan al-Tiflīsī<span class=\"italics\">.</span> This would appear to be a scholar’s copy, no decorations or consistent layout.<span class=\"italics\"> </span></p><p dir=\"auto\">247 folios.</p><p dir=\"auto\">Starts in medias res in Risala 8 and then covers much of the rest of the qism 1 and 2 but following a somewhat idiosyncratic order and with variant numbering compared to printed edition:</p><p dir=\"auto\">1r: middle of the Risala on practical arts (= 1.8)</p><p dir=\"auto\">8v: incipit risala 7 theoretical arts (=1:7)</p><p dir=\"auto\">22v: incipit Risala 8 Akhlaq (= 1:9)</p><p dir=\"auto\">78v: risala 8 Isaghughi (=1:10)</p><p dir=\"auto\">102v: risala 6 of qism 2 “fī mahiyyat al-ṭabīʿiyya wa-kayfiyyat ṣanāʾiʿ-hā”</p><p dir=\"auto\">106r: risala 7 of qism 2 “fi ajnās al-nabāt”</p><p dir=\"auto\">119r: start qism 2, risala 1 “fī al-hayūlī”</p><p dir=\"auto\">130v: start risala 2 of qism 2</p><p dir=\"auto\">143v: start risala 3 of qism 2</p><p dir=\"auto\">148v: start risala 4 [of qism 2]</p><p dir=\"auto\">162r: risala 5 of qism 2 with very elaborate title</p><p dir=\"auto\">167r: risala 9 (=1:11)</p><p dir=\"auto\">172r: risala 10 (= 1:12)</p><p dir=\"auto\">175a: Risala 11 (= 1:13)</p><p dir=\"auto\">193a: Risala 8 of qism 2, Animals</p><p dir=\"auto\">Contributions by Omar Ali-de-Unzaga:</p><p dir=\"auto\">The sequence of the Epistle on Ethics in the MS is: 22v-39v/ <strong>44r-47v/40r-43v</strong>/48-78v</p><p dir=\"auto\">So two groups of 4 pages were missplaced. Otherwise the Epistle is complete.</p><p dir=\"auto\">The last epistle in this MS, the Epistle on Animals, only has about half of it (upto Goodman’s ed. p.156= tr 218 (ch 20), at the end of the speech of the Greek spokesman).</p><p dir=\"auto\">The scribe adds: <span class=\"italics\">hadhā ākhir mā wajadnā</span> [corrected to: <span class=\"italics\">wujida] min Risālat al-Ḥayawān min Rasāʾil Ikhwān al-Ṣafāʾ wa Khullān al-Wafāʾ wāḥidatan baʿda wāḥida</span>.</p>"
    }
  },
  "Eton": {
    "Eton College Library": {
      "Pote400": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma.</span> Copied Sunday 14 Dhū-l-Qaʿdah 1085 (year 18, Aurangzeb) / 9 Feb 1675 Scribe: Muḥammad Ābid.</p><p dir=\"auto\">Seals: seal (follower of Pādshāh ʿĀlamgīr Muḥammad Ghāzī, Niẓām al-dīn Mūsāvī, year 49, i.e. 1118-19). F.1r: 3 erased seals (one: Muḥammad follower of Shāh ʿAzam, i.e. Aurangzeb, 1095).</p><p dir=\"auto\">Margoliouth catalogue no. 84.</p>"
    }
  },
  "Gorno-Badakhshan": {
    "Unknown family library": {
      "19597": "<p dir=\"auto\">A <span class=\"italics\">majmūʿa</span> containing extracts of epistles two (“on the creation of the world”, folios 66b-68b), three (“on birth and decomposition” + contains discussion of man as “alam-i hayvan-i buzurg” – folios 61b-64b) and eleven (on embryology, incl. discussion of the influence of the planets on the formation of the embryo – folios 49b-58) in Persian translation, likely from <span class=\"italics\">Mujmal al-ḥikma</span>. In the catalogue these are all discussed as separate <span class=\"italics\">rasāʾil</span> but they are in the same hand: nrs 122, 123 and 126.</p><p dir=\"auto\">The bulk of the MS is taken up by Naṣafī’s <span class=\"italics\">Zubdat al-ḥaqāʾiq</span> (folios 1a-49a). General info about MS is given in the entry for that text (= no. 132 in catalogue).</p><p dir=\"auto\">MS copied in 1368/1948-9 by Shāhfitūr Muhabbatshahzada (Шах Фитур Мухаббатшахзада) (1869-1959), a prominent scholarly figure in the region.</p><p dir=\"auto\">The manuscript was likely part of a family library, but no particulars are given. The cataloguers note that photostats of all the MSS they catalogued were deposited in the Department of Oriental Studies in Dushanbe (now Markazi Merosi Khatti).</p><p dir=\"auto\">Russian catalogue by A. Berthels & M. Baqoev (with English summary) has been translated into Persian.</p>"
    }
  },
  "Gotha": {
    "Forschungsbibliothek": {
      "MsorientA157": "<p dir=\"auto\">Epistles 1-13 (but with variation, it seems, catloguer Pertsch compared to materials available to him)</p>"
    }
  },
  "Hamadan": {
    "Madrasa-yi Gharb": {
      "402": "<p dir=\"auto\"><span class=\"italics\">Mukhta</span><span class=\"italics\">ṣ</span><span class=\"italics\">ar</span> of the <span class=\"italics\">Rasāʾil</span> (no further info).</p>"
    },
    "Majmūʿe Ḥājī Ezadī": {
      "13": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span> (Persian) in <span class=\"italics\">majmūʿa</span>. Dhū l-Ḥijja 1079/ May 1669.</p>"
    }
  },
  "Hyderabad": {
    "Oriental Manuscripts Library and Research Center (OMLRI)": {
      "1966": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-ṣāfāʾ,</span> no further data.</p>",
      "2252": "<p dir=\"auto\"><span class=\"italics\">Ikhwān al-ṣāfāʾ,</span> Urdu translation (by داكرام على قرجم م ? = Maulvi Ikraam ʿAlī), no further data. Likely a lithograph.</p>",
      "2297522978": "<p dir=\"auto\">al-Risāla al-Jāmiʿa first and second vol.</p>",
      "5864": "<p dir=\"auto\"><span class=\"italics\">Ikhwān al-ṣāfāʾ,</span> Urdu translation (by داكرام على قرجم م ? = Maulvi Ikraam ʿAlī), no further data. Likely a lithograph.</p>"
    },
    "Salar Jung Museum": {
      "41": "<p dir=\"auto\">Full copy of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span> dated to 667/1268, although the cataloguer believes this to be copied from a “prototype” (Ali-de-Unzaga accepts the date). A neatly produced copy with a gilded frontispiece. 492 folios.</p><p dir=\"auto\">Discussed in Omar Ali-de-Unzaga, “The Missing Link”</p>",
      "42": "<p dir=\"auto\">Partial copy of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span> dated to 1190/1776. 21 treatises, 1.17, 2.1-10, 4.1-10.</p><p dir=\"auto\">Folios 1-223 (of 247 in total), followed by Ibn Ṭufayl’s <span class=\"italics\">Ḥayy b. Yaqẓān</span> and extracts from Ibn Sīnā’s <span class=\"italics\">al-Ishāra wa-l-tanbīh</span> (first <span class=\"italics\">namat</span> on physics) and <span class=\"italics\">al-Risāla fī dhikr asbāb al-raʿd wa-l-barq</span>.</p>"
    },
    "State Central Library (Asafia)": {
      "8falsafa": "<p dir=\"auto\">Full copy of the <span class=\"italics\">Rasāʾil</span>, dated to 1055/1645. Mentioned by Ali-De-Unzaga</p>",
      "347": "<p dir=\"auto\">Persian translation, potentially <span class=\"italics\">Mujmal al-Ḥikma</span>. 11th/17th C.</p><p dir=\"auto\">Mentioned in Danishpazhuh <span class=\"italics\">Mujmal al-ḥikma</span> edition.</p>"
    }
  },
  "India?": {
    "Dīwān-i Hind (?)": {
      "2225": "<p dir=\"auto\">Copy of <span class=\"italics\">Mujmal al-ḥikma</span> mentioned in the Danishpazhuh edition of that text (p. 347), dated to 1036/1626-7.</p>"
    }
  },
  "Isfahan": {
    "K. Alfat-i Iṣfahānī": {
      "45": "<p dir=\"auto\">11th C (AH). From beginning of the text up to 14th epistle.</p><p dir=\"auto\">177 folios; isfahani paper, nasta’liq.</p>"
    },
    "K. Markazī Dānishgāh-i Iṣfahān": {
      "127": "<p dir=\"auto\"><strong>(= Adabiyyāt 11) -</strong> Partial, starts at epistle 14. 11th/17th C. Nasta’liq. Identical to Alfat-i Iṣfahānī 45?</p>",
      "156": "<p dir=\"auto\"><strong>(= Isfahan K. Markazī Dānishgāh-i Iṣfahān 398) -</strong> Single epistle on “the nature of things”. Copied 3 Jum I 1288/21 July 1871. 25 folios, 15 lines per page, 21,5x14cm. Material cited as first and last lines cannot be traced to OpenITI copy, but the language does feel Ikhwanian. Potentially identical to 398 listed below given same year?</p><p dir=\"auto\">آغاز: و اعلم يا اخي ان حقيقة هذا الاسم هو الخاصية الموجودة في نفوس المستحقين له بالحقيقة لا علي طريق المجاز؛</p><p dir=\"auto\">انجام: يحصل لك بذلك النفع العاجل و الثواب الآجل في الدنيا و الدين و بلغك االله منازل الخيار المصطفين الابرار.</p>",
      "6623": "<p dir=\"auto\">Mujmal al-ḥikma, 13th/19th C.</p>"
    }
  },
  "Istanbul": {
    "Süleymaniye": {
      "AmcazadeHseyinPaa452": "<p dir=\"auto\">Partial copy, no fihrist, starts with 1.1.</p><p dir=\"auto\">185 folios, 27 lines per page. Red rubrication, red title page for risala 1.2., red ending notes/colophons for all rasa’il. No colophon. Attributed to Majriti on flyleaf in nasta’liq script.</p><p dir=\"auto\">1b: risala 1.1., no title but large script “iʿlam ayyuhā al-akh al-bārr”</p><p dir=\"auto\">11a: title page risala 1.2. handasa</p><p dir=\"auto\">20b: risala on astronomy</p><p dir=\"auto\">36a: risala 1.4 on music</p><p dir=\"auto\">53a: title of risala 1.5 geography</p><p dir=\"auto\">78b (? 78 on PDF): no title page but new risala on “al-ṣanāʾiʿ al-ʿilmiyya”</p><p dir=\"auto\">83a: title of risala on ethics (no number) = perhaps short version?</p><p dir=\"auto\">114 (? PDF number): title of Isagoge 1</p><p dir=\"auto\">132a: Categorias</p><p dir=\"auto\">138 (PDF number): 1.12 Barirminas</p><p dir=\"auto\">140a: 1.13 Analytica I</p><p dir=\"auto\">179b: distinctively different title of risala 10 (? TBD)</p>",
      "AtifEfendi1681": "<p dir=\"auto\">This is the earliest known (full) copy of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span>.</p><p dir=\"auto\">Colophon 578a: copied by Mawdūd b. ʿUthmān b. ʿUmar al-ṭabīb al-Shirwānī on Thursday 13 Ṣafar 578 in the city of Shammākhiyya [= Shemākha, in Azerbaijan, capital of Shirwān]</p><p dir=\"auto\">The same person is attested as the copyist of an astronomical work preserved in Berlin StaBi MS Landberg 33. The cataloguer Ahlwardt situates the production of this manuscript around 650, but the manuscript is not actually dated. The handwriting indeed look similar to Atf Efendi 1681.</p><p dir=\"auto\"><a href=\"http://resolver.staatsbibliothek-berlin.de/SBB0000D50100000000\" target=\"_blank\">http://resolver.staatsbibliothek-berlin.de/SBB0000D50100000000</a></p><p dir=\"auto\">Title page:</p><p dir=\"auto\">ownership note date to 984 by Aḥmad b. Muḥammad al-Rājī</p><p dir=\"auto\">consultation note (+ evaluation of the work) by Rajab b. Ḥasan—on this evaluation, see Van Den Bossche, “A Classic in the Making” (forthcoming)</p><p dir=\"auto\">Waqf notes ʿĀṭif Efendi, 1154</p><p dir=\"auto\">Each risāla is given its own folio with epistle title.</p><p dir=\"auto\">There are a fair amount of marginal notes throughout, including several by Rajab b. Ḥasan (discussed in Van Den Bossche, “A Classic in the Making”)</p><p dir=\"auto\">The colophon is followed by 4,5 folios of variant materials from “some copies”</p><p dir=\"auto\">Published in facsimile by Sezgin.</p>",
      "Ayasofya2449": "<p dir=\"auto\">An apparently complete copy of <span class=\"italics\">Mujmal al-ḥikma</span> which is however not given that name at any place in the text. Undated, but appears as rather old. The cataloguers of Süleymaniye surmise it to date from ca. 700/1300, which may very well be correct.</p><p dir=\"auto\">Note on flyleaf (1a) states that this is vol. 1 of “tarjamat Kitāb Ikhwān al-Ṣafāʾ bi-l-Fārsiyya fī al-riyāḍiyāt wa-ghayru-hā”. Flyleaf contains various lines of poetry, including two attributed to al-Mutanabbī. It also contains two stamps, one of which might be that of Bayezid II (a translation of the <span class=\"italics\">Rasāʾil Ikhwān al-Ṣafāʾ</span> is mentioned in his library catalogue, see Necipoğlu, <span class=\"italics\">Treasures of Knowledge</span>, p. 212). The other seal appears to be linked to an accompanying <span class=\"italics\">waqf</span> note.</p><p dir=\"auto\">Folio 1b starts with a table of contents in red and black (until 2a) topped by a title in gold letters: <span class=\"italics\">Kitāb Ikhwān al-Ṣafāʾ</span> and below that “in four parts” (<span class=\"italics\">ʿalā arbaʿa aqsām</span>). The text itself starts at 2b and matches with other manuscripts at the start and end.</p><p dir=\"auto\">170 folios, 15 lines per page.</p><p dir=\"auto\">Colophon on folio 169b, copyist named as Yāghī b. Yūsuf al-..ṣr.wī. It is followed by a devotional poem (<span class=\"italics\">dūʿāʾ manẓūm</span>) in Arabic attributed to ʿAlī b. Abī Ṭālib up to 170a.</p><p dir=\"auto\">170b contains magical squares (<span class=\"italics\">awfāq</span>) and 171b an astrological calendar preceded by explanation how to use it in Persian.</p>",
      "Ayasofya2461": "<p dir=\"auto\">A full copy of <span class=\"italics\">Mujmal al-ḥikma</span>, cleanly produced, consistent text frame, with a gold, blue and red medallion on the title page (though the “title” (“Manṭiq wa-ḥikma”) was clearly added later). Stylised basmalla with illumination on folio 1b. 1a contains also a later title at the top of the page: “Tarjamat Kitāb Mujmal al-Ḥikma bi-l-Fārsiyya bi-l-ḥikmiyāt wa-l-falsafīya”. It also contains two stamps and the waqf note typically found in Ayasofya manuscripts.</p><p dir=\"auto\">Colophon at folio 165b (164b in crossed out foliation), dated to the first day of Rabīʿ II 883 (11 July 1478).</p><p dir=\"auto\">165 folios, 15 lines per page.</p><p dir=\"auto\">Size: 233x153. Text block: 165x80 mm.</p>",
      "Ayasofya3768": "<p dir=\"auto\">Third volume of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span>, entailing third and fourth qism as noted on title page. That page also contains the sultanic waqf note for the Ayasofya collection as well as the seal of Bayezid II.</p><p dir=\"auto\">Safina shaped book. 363 folios. Preceded by a table of contents. Contains colophon but no date.</p><p dir=\"auto\">5b: diagram of the heavenly spheres/<span class=\"italics\">aflāk</span>.</p><p dir=\"auto\">No marginalia.</p><p dir=\"auto\">Given the presence of Bayezid II’s seal, this manuscript is highly likely to be one of the multiple copies identified of the <span class=\"italics\">Rasāʾil ikhwān al-Ṣāfāʾ</span> in his library catalogue by his librarian Aṭūfī.</p>",
      "Carullah982": "<p dir=\"auto\">Partial copy of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span>.</p><p dir=\"auto\">This is a fairly messy MS, likely repaired at some point, with a later owner adding in folios in different handwriting to compensate for lost pages and to have a more complete version of the text. Folios 1-86 are largely in the same hand and cover the <span class=\"italics\">fihrist</span> and various epistles from the first <span class=\"italics\">qism</span> (1.1, 1.7-1-12). Folios 52-55 appear to be a later repair by the same hand responsible for the remaining folios in the MS which cover epistles 2.6-2.7, 2.11-2.13, 2.15-2.16, 3.1-3.6, 3.8-3.10.</p><p dir=\"auto\">MS is Quite heavily annotated throughout with content markers (e.g. 270v = “maṭlab al-Fārābī”)</p><p dir=\"auto\">Title page:</p><p dir=\"auto\">Authorship of the text explicitly attributed to al-Majrīṭī al-Qurṭubī</p><p dir=\"auto\">Note at the bottom in same handwriting:</p><p dir=\"auto\">واما من انكر عليه ممن اعجم ... من حاله</p><p dir=\"auto\">ما التبس عليه من مقا.. من التفقهه</p><p dir=\"auto\">الذين لا يكادون يفقهون قولا اوليك</p><p dir=\"auto\">كالانعام بل هم امل سبيلا فكما قيل</p><p dir=\"auto\">قد تنكر العين ضوء الشمس من رمد</p><p dir=\"auto\">وينكر الغم طعم المآء من مقم</p><p dir=\"auto\">وكقيل أيضا وكم من عايب قولا صحيحا * وآفته من ... بالسقيم</p><p dir=\"auto\">Waqf stamp on title page and final page</p>",
      "Carullah1638": "<p dir=\"auto\">First folio note: “vol. 2 of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span> from the beginning of epistle eleven until the end of the book which ends on the 51st epistle […] Abū ʿAbd Allāh Walī al-Dīn […] was asked to write (<span class=\"italics\">istaktaba</span>) it in full, from the first volume of the beginning of the book up to this volume in the year 1139 [= 1726-7].”</p><p dir=\"auto\">Very little marginal annotation.</p>",
      "Carullah2107": "<p dir=\"auto\">Note on flyleaf provides some guidance to what is found inside, same note attributes the text to Maslama al-Qurṭubī. The second flyleaf continues this with some biographical info on the author. This appears to be the first part of a two-volume set.</p><p dir=\"auto\">fihrist</p><p dir=\"auto\">end of fihrist: ownership note + reading note in rhyming prose by Aḥmad b. Ibrāhīm al-Khālidī (?) + note by Sharaf al-Dīn al-Ḥarīrī al-Baṭmā (?) 20 … in Jumādā II 880 (?)</p><p dir=\"auto\">starts at 1.1., then 1.2.,… ends in 2.10 (ḥāss wa’l-maḥsūs). Quite neatly written</p><p dir=\"auto\">bound with a one-page khuṭba from Quss b. Sāʿida al-Iyādī (EI2: ‘“the sage, the arbiter (<span class=\"italics\">ḥakam</span>) of the Arabs”. His eloquence is proverbial’), from skim-reading it appears to be about cosmology?</p>",
      "EsadEfendi1191": "<p dir=\"auto\"><span class=\"italics\">al-Risāla al-ʿayniyya fī al-Ḥikma al-ḥaqīqiyya</span> by al-Bihishtī (d. 749?)</p><p dir=\"auto\">Dated to 741.</p><p dir=\"auto\">37 folios, contents clearly either taken from or inspired by Ikhwān al-Ṣafāʾ who are mentioned by name on 1b. Needs closer study.</p>",
      "EsadEfendi3620": "<p dir=\"auto\">Partial copy of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span>, several epistles from <span class=\"italics\">qism</span> 2 but in scrambled order. Not dated but comes across as early, and in any case from before 971/1563-4. Gowaart’s guess would be that this is a 13th century copy, potentially even earlier.</p><p dir=\"auto\">Flyleaf: “a section from <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span> beginning with <span class=\"italics\">Risālat al-āthār al-ʿalawiyya</span>” + “8 rasāʾil<span class=\"italics\"> </span>min <span class=\"italics\">Ikhwān al-ṣafāʾ</span> li-l-Majrīṭī raḥima-hu Allāh taʿālā”</p><p dir=\"auto\">Ownership notes:</p><p dir=\"auto\">dated to 971 ʿAlī b. ʿUmar ..</p><p dir=\"auto\">dated to 113[.] Maʿtūq b. ʿAlī</p><p dir=\"auto\">“khādim al-fuqarāʾ al-Naqshbandī al-shaykh al-sayyid Sulaymān b. Sāmān al-Uskudārī”</p><p dir=\"auto\">No rubrication but somewhat bolder handwriting for <span class=\"italics\">fuṣūl</span>. Prominent title pages for individual epistles but the titles appear to be rendered in a later, messier script:</p><p dir=\"auto\">1a: 2.4 (<span class=\"italics\">al-āthār al-ʿalawiyya</span> = noted twice) + list of other epistles included (needs to be checked against actual</p><p dir=\"auto\">24a: 2.9</p><p dir=\"auto\">43a: 2.10 (<span class=\"italics\">a</span><span class=\"italics\">l-ḥās wa-l-maḥsūs</span>)</p><p dir=\"auto\">61b: announcement of following epistle being 2.11, but in fact followed by 2.8</p><p dir=\"auto\">62a: 2.8 (animals)</p><p dir=\"auto\">84a: 2.15 (<span class=\"italics\">fī māhiyyat al-mawt wa-l-ḥayāt</span>) = some marginal annotation in folios of this epistle</p><p dir=\"auto\">99a: 2.5 (minerals and gemstones) = title page has note in difficult handwriting</p><p dir=\"auto\">135a: 2.6 (<span class=\"italics\">fī māhiyyat al-ṭabīʿa wa-kayfiyya afʿāl-hā</span>)</p><p dir=\"auto\">151a: 2.7 (<span class=\"italics\">fī ajnās al-nabāt wa-anwāʿ-hā</span>)</p>",
      "EsadEfendi3636": "<p dir=\"auto\">Majmūʿa with an extract from a risala on Bayan waqf al-nuqud on folios 193-217. This attribution needs closer study.</p>",
      "EsadEfendi3637": "<p dir=\"auto\">Full copy of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span><span class=\"italics\">.</span></p><p dir=\"auto\">Nader el-Bizri situates this manuscript in the 7th/13th century but I am not convinced by this.</p><p dir=\"auto\">Its terminus ante quem is 11th/17th century because of the waqf note on the flyleaf. This waqf note is only partly readable but mentions Ẓahīr al-Dīn Mīrzā Muḥammad Ibrāhīm, “the Safavid governor of Azerbaijan from 1077 H/1666 CE until 1095 H/1683 CE and ‘minister of ﬁnance’ under Shāh Sulaymān (r. 1077–1105 H/1666–1694 CE) thereafter.” (Sonja Brentjes (ed.), <span class=\"italics\">A Multiple-text Collection by Zahīr al-Dīn Mīrzā Muhammad Ibrāhīm</span>, p. 3 <a href=\"https://fiona.uni-hamburg.de/21507602/mc22web.pdf\" target=\"_blank\">https://fiona.uni-hamburg.de/21507602/mc22web.pdf</a> ). Ẓahīr al-Dīn Mīrzā’s avid reading and reworking of materials from the <span class=\"italics\">RIS</span> is known and discussed in several contributions to the above-noted volume edited by Brentjes (pp. 7, 9, 130, 148, 162).</p><p dir=\"auto\">Flyleaf contains the authorship attribution to the group from Basra, from Abū Ḥayyān al-Tawḥīdī’s <span class=\"italics\">al-Imtāʿ wa-l-muʾānasa</span> (which is explicitly credited).</p><p dir=\"auto\">The start of the text is preceded by a table of contents (0b-1a).</p><p dir=\"auto\">The actual start is on folio 1b.</p><p dir=\"auto\">Long marginal note on folio 2a. Rather many correction notes and commentary in the margins throughout - most of these appear to be in the same hand as the copyist’s.</p><p dir=\"auto\">Text is rubricated. 567 folios. 31 lines per page. Start of epistles sometimes with distinctive layout.</p>",
      "EsadEfendi3638": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span> . Full copy. Shawwāl 686 Baghdād, copied by Buzurgmihr b. Muḥammad al-Ṭūsī.</p><p dir=\"auto\">Famous copy with double illuminated frontispiece.</p><p dir=\"auto\">Extensive codicological description in M. Ritter, “The Frontispiece as Patron’s Statement: Re-examining and Contextualizing the 686/1287 <span class=\"italics\">Rasāʾil Ikhwān al-Ṣafāʾ</span> from Early Ilkhanid Baghdad (MS Istanbul, Süleymaniye, Esad Efendi 3638)” <span class=\"italics\">Journal of Islamic Manuscripts</span> 15/1 (2023), pp. 21–53 <a href=\"https://doi.org/10.1163/1878464X-01501009\" target=\"_blank\">https://doi.org/10.1163/1878464X-01501009</a> ; see also Ben Azzouna, <span class=\"italics\">Aux origines du classicisme. Calligraphes et bibliophiles au temps des dynasties mongoles (Les Ilkhanides et les Djalayirides 656-814/1258-1411)</span> (Leiden, Brill: 2018)</p><p dir=\"auto\">On the copyist, who is attested on one other MS and a contemporary capsule biography of whom is known, see: Qurboniev & Van Den Bossche, “’A Scholarly Copyist’”, <a href=\"https://doi.org/10.31826/9781463244019-020\" target=\"_blank\">https://doi.org/10.31826/9781463244019-020</a></p>",
      "Fatih3177": "<p dir=\"auto\">An apparently full copy of <span class=\"italics\">Mujmal al-Ḥikma</span> in 116 folios.</p><p dir=\"auto\">No table of contents.</p><p dir=\"auto\">Text is rubricated but otherwise fairly plainly executed. Diagrams also make use of red ink.</p><p dir=\"auto\">Colophon on 116a: Completed on Thursday 18 Muḥarram 671/22 August 1272. Copyist’s name was effaced but has been overwritten as ʿAlī b. Muḥammad b. Ḥ.. b. Ḥusayn.</p><p dir=\"auto\">The flyleaf appears to have been pasted over a prior title page, which can still be seen partly on the scan.</p><p dir=\"auto\">This copy bears Bayezid II’s seal on its flyleaf (1a) and next to the colophon (116a), both on the bottom left of the page. It was thus likely one of the copies of the Persian translation of the text attested in Bayezid II’s library catalogue.</p><p dir=\"auto\">The flyleaf also contains a title “tarjamat kitāb Mujmal al-Ḥikma [bi-l-]F[ārsiyya]”, which is the exact phrasing used by the cataloguer ʿAtūfī for the copies of the text + waqf seal and note of Fatih endowment. On the top also “kitāb Mujmal al-Ḥikma” followed by further notes that were partly effaced.</p><p dir=\"auto\">Page size: 258x180mm</p><p dir=\"auto\">Writing surface: 184x123 mm.</p>",
      "Fatih3178": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span> (Persian), produced in Shaʿbān 645/1247, likely for royal <span class=\"italics\">khizāna</span>. Copyist Abū ʿAbdallāh Muḥammad b. Muḥammad b. ʿAlī al-kātib Ibn al-Khafāf taʿrīfan al-Nakhjuwānī. Body text explicitly notes Rasāʾil ikhwān al-ṣafāʾ. Colophon folios 132b-133a, followed by fihrist and a content note?</p><p dir=\"auto\">Title page:</p><p dir=\"auto\">لخزانة كتب الصلى الصاحب العالم الكامل</p><p dir=\"auto\">العادل النحرير السميدع همام الدولة والدين</p><p dir=\"auto\">عماد الاسلام والمسلمين ملك الصدور في العالمين</p><p dir=\"auto\">نظام الممالك قوام السلطنة فخر الملك مجد الكفاة</p><p dir=\"auto\">محتار الملوك والسلاطين ..همايون صاحب ديوان النظر</p><p dir=\"auto\">ابي الفضايل شادير بن عبد الغفر</p><p dir=\"auto\"><strong>\t</strong></p><p dir=\"auto\">Red note in margin right:</p><p dir=\"auto\">صاحب هذه … خسرو بن كيقباد شرواني خداش</p><p dir=\"auto\">This “…khusrū b. Kayqubād Shirwānī” could be a Shirvanshah ruler, but this moment falls at the moment of transition of Khwarawnshah to Ilkhanid overrule for which historical evidence is very spotty. The note could of course also have been added later, in the mid-14th century under Kayqubad I (d. 1348)</p><p dir=\"auto\">The title page and colophon page (134b) contain Bayezid II’s seal. It was thus likely one of the copies of the Persian translation of the text attested in Bayezid II’s library catalogue. On top of the title page there is also the note “Tarjamat Kitāb Mujmal al-Ḥikma bi-l-Fārsiyya”, which is the exact phrasing used by the cataloguer ʿAtūfī for the copies of the text.</p><p dir=\"auto\">Page size: 312x236mm.</p><p dir=\"auto\">Writing surface: 224x170 mm.</p>",
      "HaletEfendi724?": "<p dir=\"auto\">Copyist ʿAbdallāh Fityānī, 14 Rajab 1141 / 13 February 1729. Note ascribing authorship to Muḥammad Bāqir? => this reference given in Fehrestegan is incorrect, doesn’t match any of the manuscripts. To be confirmed.</p>",
      "Hamidiye1440": "<p dir=\"auto\">Personal “majmūʿat rasā’il” (multiple text manuscript) owned by Ibrāhīm Kūrūr (Kūrūs?), some ownership + waqf notes and seals on first page. Contains Ikhwan related material according to ISMI.</p>",
      "Hamidiye1444": "<p dir=\"auto\">416 folios. Ottoman era copy in mistara, floral margins on 1b-2a. Some marginal notes in pencil to highlight sections.</p><p dir=\"auto\">Colophon 416b. Notes copyist: ʿAbdallāh al-Faytānī imam in al-Ṣakhra al-Mashriqa (is in Dome of the Rock Jerusalem), in the masjid. 15 Rajab 1161 / 3 July 1748</p><p dir=\"auto\">Followed by note on authorship, which is said to be mentioned in the 28th (part?) of the book, his name is Muḥammad Bāqir, “the fifth imam of Banū al-ʿAbbās”.</p>",
      "HazretiNasuhiDergah189": "<p dir=\"auto\">28 folios. Large volume (300x200mm). Rather cursive and sloppy handwriting, perhaps a “scholarly copy.” Rasa’il noted in margins in red. Seems to be a selection of materials from the Rasa’il or potentially one of its sister-texts, with personal introduction and framing. Epistle starting on folio 38r is announced as epistle 11, but the title given corresponds to epistle 4.4. Needs closer study.</p><p dir=\"auto\">Ownership notes: two effaced, one identified as Darwīsh Faḍl al-ʿArīf known as Naṣūḥī. No date.</p>",
      "HsrevPaa251": "<p dir=\"auto\">Extract in scientific composite MS, largely Maghrebi, misidentified as a text by Ibn Sīnā</p><p dir=\"auto\"><a href=\"https://ismi.mpiwg-berlin.mpg.de/witness/466870\" target=\"_blank\">https://ismi.mpiwg-berlin.mpg.de/witness/466870</a></p>",
      "Laleli3639": "<p dir=\"auto\"><span class=\"italics\">Mukhtaṣar Rasāʾil Ikhwān al-Ṣafāʾ</span> by shaykh Dāwud al-ṭabīb (raḥima-hu Allāh). 98 folios only. Seems to starts with epistle on Ethics. Very short renderings of rasa’il, 53 epistles.</p><p dir=\"auto\">Colophon 97b-98a: sulkh Ṣafar 1109 (? = August 1697). Copied “li-nafsihi” Muḥammad b. ʿAbdallāh b. Muḥammad b. Jumʿāʾ al-Hindī.</p><p dir=\"auto\">1a ownership notes: went from Muḥammad b. ʿAbdallāh al-Hindī (the copyist) to … 1113, maybe in al-Aswan? => then 1133 to ḥāfiẓ Aḥmad b. ʿAbd al-Raḥmān al-Kurdī qāḍī in vilayet Asyūṭ. Also two seals, but not really readable. I think one is Laleli seal (repeated below colophon, sultan seal: ghāzī, khān, sulṭān)</p><p dir=\"auto\">=> so southern Egyptian circulation.</p>",
      "ehidAliPaa2785": "<p dir=\"auto\">173 folios. Starts with <span class=\"italics\">Risala fī al-Ṣanāʾiʿ al-ṭabīʿiyya</span>, contains eight <span class=\"italics\">rasāʾil</span> according to Süleymaniye database. Acephalous copy but looks pretty early.</p>",
      "YazmaBalar2546": "<p dir=\"auto\">An apparently partial copy of <span class=\"italics\">Mujmal al-ḥikma</span> in a <span class=\"italics\">majmūʿa</span> (multiple text manuscript, largely executed in the same <span class=\"italics\">nastaʿlīq</span> handwriting) alongside two other texts. Cataloguers at Süleymaniye note the copy of <span class=\"italics\">Mujmal</span> included here only contains 40 epistles.</p><p dir=\"auto\">Flyleaf contains a note dated to 1124/1712-13.</p><p dir=\"auto\">105 folios, 19 lines per page. Rubricated and containing multiple tables and diagrams executed in red and black ink.</p><p dir=\"auto\">The two following texts are: <span class=\"italics\">Muhtasar-ı Sî Fasl der Ma‘rifet-i Takvîm</span> (folios 105-127) and <span class=\"italics\">Manzûme-i Eflâk</span> (folios 127-188).</p>",
      "YeniCami1199": "<p dir=\"auto\">Attributed to Maslama al-Majrīṭī “al-faylusūf al-kāmil”, dated to Dhū l-Qaʿda 887 in Mecca (?)</p><p dir=\"auto\">title page</p><p dir=\"auto\">top note crossed out, but maybe decipherable still</p><p dir=\"auto\">bottom left: top crossed out, but below full name (named as khādim al-sharīqa (=sharīʿa?))</p><p dir=\"auto\">ابن المجد عبد العلى بن محمد بن جلال الدين محمود بن محمد الناصحي الكرباني</p><p dir=\"auto\">bottom: Ibrāhīm al-ḥakīm b. ʿAlī …</p><p dir=\"auto\">seal: ʿAbd al-Ṣamad shaykh Muḥammad</p><p dir=\"auto\">preceding actual text: table of contents (summarised fihrist)</p><p dir=\"auto\">some collation notes, diagrams largely missing</p><p dir=\"auto\">final page: scribbled note</p><p dir=\"auto\">Regularly concludes epistles on the note that it is “min kalām al-ṣūfiyya”</p>"
    },
    "Ragıp Paşa": {
      "839": "<p dir=\"auto\">602 folios. Starts with fihrist. Written in red mistara. Full copy, perhaps copied from Atif Efendi 1681 = has four folios of additions (ff. 598v-602r). Heavy marginal annotation near the end of the final epistle (590b-597a) but also elsewhere in the MS.</p><p dir=\"auto\">Title page attributes text to al-Majrīṭī, but this is a later addition.</p>",
      "840": "<p dir=\"auto\">Ottoman copy, full MS? (ends with 4.11, so quite likely to be) very neat copy, some gold decoration (18th century?)</p>"
    },
    "Köprülü": {
      "FazlAhmedPaa870": "<p dir=\"auto\">Full copy 15th C (not sure about this at all, comes across as more recent to me??). Beautifully executed copy in Ottoman style, written in golden mistara, extensive use of colours for figures. More luxurious than Kayseri MS (= Mehmet II). Decorated risala headers, rubricated in different colours. 31 lines per page. Contains fihrist.</p>",
      "FazlAhmedPaa871": "<p dir=\"auto\">Full copy 22 Jumada I 820/1417. Many risalas have their own dedicated title pages, though not all — i.e. 296b + following examples, it seems this practice was abandonded as the copying went on. 326a: end of second quarter (<span class=\"italics\">rubʿ</span>), followed by material that follows different phrasings (maqala instead of risala) => perhaps copied from two different MSS? However, later on resumes practice of using risala + even gives dedicated title pages (for example 387a), 438a following is different paper, different copyist, possibly a reparation all the way up to colophon on 531a.</p><p dir=\"auto\">Given the presence of Bayezid II’s seal on the manuscript’s title page, this manuscript is highly likely to be one of the multiple copies identified of the <span class=\"italics\">Rasāʾil ikhwān al-Ṣāfāʾ</span> in his library catalogue by his librarian Aṭūfī.</p><p dir=\"auto\"><a href=\"https://ismi.mpiwg-berlin.mpg.de/witness/376490\" target=\"_blank\">https://ismi.mpiwg-berlin.mpg.de/witness/376490</a></p>",
      "FazlAhmedPaa981": "<p dir=\"auto\">78a-98b = epistle on music, bound with a risala on medicine, <span class=\"italics\">Miftāḥ al-ṭibb</span> by Ibn Hindū (d. 423/1032). Copyist Muḥammad b. ʿAlī al-Ḥarrām b. Ibrāhīm al-Fīrūzabādī al-Banjālī (?), afternoon of Thursday (correct!) 17 Dhū al-Qaʿda 893/1 November 1488.</p>",
      "MehmedAsmBey709": "<p dir=\"auto\">Extract of one risala (on <span class=\"italics\">hay’a</span>) in a majmūʿa, folios 108-121. Majmūʿa has a table of contents at start, next risala is on <span class=\"italics\">ʿarūḍ</span>, one of the last ones is on poetic meters by al-Khazrajī</p><p dir=\"auto\"><a href=\"http://www.yazmalar.gov.tr/eser/risaletu-fi-fennil-heye-min-resaili-ihvanis-safa/174960\" target=\"_blank\">http://www.yazmalar.gov.tr/eser/risaletu-fi-fennil-heye-min-resaili-ihvanis-safa/174960</a></p>"
    },
    "Nuruosmaniye": {
      "2951": "<p dir=\"auto\">18th century <span class=\"italics\">majmūʿa</span>. Produced in Karbalā and moved to Istanbul when Nuruosmaniye was founded. Manuscripts containing many different texts, including “extracts from Ikhwān al-Ṣafāʾ, <span class=\"italics\">al-Aḥkām al-nujūmiyya</span> (179r-192v)”.</p><p dir=\"auto\">An extensive codicological and content description of the manuscript by Emanuele Rovati is given as part of the Ptolemaeus Arabus et Latinus project at: <a href=\"https://ptolemaeus.badw.de/ms/954\" target=\"_blank\">https://ptolemaeus.badw.de/ms/954</a></p><p dir=\"auto\">The contents of the majmūʿa are given by Rovati and copied here (Gowaart introduced the numbering - unlike in Nuruosmaniye’s count, here the Ikhwanian materials are the 13th unit in the manuscript):</p><p dir=\"auto\">Muḥammad b. Abī Bakr al-Fārisī, <span class=\"italics\">Maʿārīj al-fikr al-wahīj fī ḥall mushkilāt al-Zīj</span> (1v–32v);</p><p dir=\"auto\">an Arabic commentary on Naṣīr al-Dīn al-Ṭūsī’s <span class=\"italics\">Risāla-yi Sī faṣl</span> (33r–62r)</p><p dir=\"auto\">Aḥmad b. Muḥammad al-Mahdī l-Iṣfahānī, <span class=\"italics\">Taʾlīf laṭīf fī maʿrifat al-taqwīm wa-rumūzi-hi wa-shayʾ min al-ikhtiyārāt</span> (62v–74r, autograph)</p><p dir=\"auto\">Muḥammad Sibṭ al-Māridīnī, <span class=\"italics\">Raqāʾiq al-ḥaqāʾiq fī ḥisāb al-duruj wa-l-daqāʾiq</span> (74v–86r, with an appended multiplication table on ff. 86v–87r)</p><p dir=\"auto\">Maḥmud b. Aḥmad al-Awfī, <span class=\"italics\">Sharḥ Kayfiyyat istikhrāj al-taqwīm</span> (87v–111r)</p><p dir=\"auto\">Kushyār b. Labbān, <span class=\"italics\">Kitāb al-Madkhal fī ṣināʿat aḥkām al-nujūm</span> (111v–137r)</p><p dir=\"auto\">Nawbakht al-Ḥakīm, <span class=\"italics\">Kitāb fī-hi Sarāʾir min aḥkām al-nujūm</span> (137r–138v)</p><p dir=\"auto\">Dāwūd b. ʿUmar al-Anṭākī, <span class=\"italics\">Risāla fī ʿIlm aḥkām al-nujūm</span>, allegedly extracted from his <span class=\"italics\">Tadhkirat ulī l-albāb wa-l-jāmiʿ li-l-ʿajab al-ʿujāb</span> (138v–147r)</p><p dir=\"auto\"><span class=\"italics\">Kitāb wadaʿa-hu l-Hind fī amr al-amṭār wa-l-asʿār wa-yusammā a-l-ḥ-h-r wa-maʿnā-hu ṣūrat al-falak</span> (147v–161v)</p><p dir=\"auto\">ʿUmar b. al-Farrukhān al-Ṭabarī, <span class=\"italics\">Kitāb al-Mawālīd</span> (161v–172r)</p><p dir=\"auto\">Hermes, <span class=\"italics\">Kitāb al-Asās</span>, being the first part of <span class=\"italics\">al-Khamsa wa-l-thamānūn bāban</span> (172v–176r)</p><p dir=\"auto\">Hermes, <span class=\"italics\">al-Kitāb al-Thānī wa-huwa fī jumlat al-khamsa wa-l-thamānīn bāban</span> (176r–178v)</p><p dir=\"auto\">extracts on astrology from <span class=\"italics\">Rasāʾil Ikhwān al-Ṣafāʾ</span> (179r–192v)</p><p dir=\"auto\"><span class=\"italics\">fāʾida</span>s on astrology and numerology (192v–194v)</p><p dir=\"auto\"><strong>Ptolemaica (194v–199r)</strong></p><p dir=\"auto\"><strong>Ptolemaica (199v–223r)</strong></p><p dir=\"auto\">a treatise on nativities by Abū Jaʿfar Muḥammad b. Ayyūb al-Ḥāsib al‐Ṭabarī (224v–238r, in Persian)</p><p dir=\"auto\">Quṭb al-Dīn al-Lārī, <span class=\"italics\">Ḥall-i masāʾil-i nujūm</span> (238v–279v)</p><p dir=\"auto\">Blank: 193v, 223v–224r.</p>",
      "2683": "<p dir=\"auto\">Full copy of <span class=\"italics\">Rasāʿil ikhwān al-ṣafāʾ</span> in two volumes bound together. First volume covers qism 1 & 2, second volume qism 3 & 4. Produced at different times (vol. 2 in 1061/1651 before vol. 1 in 1068/1657), but close in time and following a similar layout programme.</p><p dir=\"auto\">The volume is preceded by an extract (recto and verso of flyleaf, but executed in same hand as main text of vol. 1) from [Ibn] al-Qifṭī’s (d. 646/1248) <span class=\"italics\">Taʿrīkh al-ḥukamāʿ</span>. In a title heading the text is here identified as containing 51 epistles and attributed to Maslama b. Aḥmad al-Majrīṭī. The extract then discusses the several different authorship attributions but concludes on al-Majrīṭī as most likely option. It is then followed by a tabulated overview of the epistles with relevant folio numbers.</p><p dir=\"auto\">The flyleaf also bears the note “rasāʾil kathīr, wa ikhwān qalīl”</p><p dir=\"auto\">The main text then starts on 1b with the Fihrist, but only for the contents of vol. 1 (the rest follows at the start of vol. 2). The epistles are sometimes numbered both in their general numbering within the epistles and within their respective qism, but mostly only the latter.</p><p dir=\"auto\">Colophon vol. 1: 281a</p><p dir=\"auto\">وكان الفراغ من تتميم هذا الجزء المبارك في يوم الاربعا المبارك افتتاح سنه ثماني وستين والف من الهجرة النبوية</p><p dir=\"auto\">علا صاحبها افضل الصلاة واتم السلام على يد العبد العاجز المقصر المفتقر لرحمة مولاه الولي الفقير حسن بن علي بن علي</p><p dir=\"auto\">المالكي الازهري غفر الله له ولوالديه وللامير بتبييض هذا الجزء ولكافه المسلمين والحمد لوليه الى يوم الدين</p><p dir=\"auto\">= Beginning of the year 1068 (= October 1657), by Ḥasan b. ʿAlī b. ʿAlī al-Mālikī al-Azharī</p><p dir=\"auto\">Start of vol. 2: 281b = remainder of fihrist, then start of epistle 3.1: 283a (title page), 283b (start of text). Qism 4 start at 348b.</p><p dir=\"auto\">Colophon vol. 2: 475a (executed in descending triangle to the left of the text’s conclusion, also in a descending triangle):</p><p dir=\"auto\">وكان الفراغ من تكمله هذه النسخة المباركه</p><p dir=\"auto\">في ٢٥ جمادى الاولي سنه ١٠٦١</p><p dir=\"auto\">على يد احقر العباد</p><p dir=\"auto\">محمد الحصّري</p><p dir=\"auto\">لطف الله</p><p dir=\"auto\">= 25 Jumādā I 1061 (= 16 May 1651), by Muḥammad al-Ḥassarī Luṭf Allāh</p><p dir=\"auto\">The colophons thus do not match: they cite incongruent years (i.e. vol. 2 precedes vol. 1) - the volumes were not produced at the same time, but they do follow a similar layout programme. Perhaps vol. 1 was added to the second volume to create a complete copy, by imitating the style of vol. 2.</p><p dir=\"auto\">The name of the first copyist might indicate an Egyptian production. In fact, this is the same copyist as for BnF Arabe 2304, which is indeed executed in a very similar style (but without diagrams). A closer comparison may be worthwhile.</p><p dir=\"auto\"><strong>Codicological description</strong>: 475 folios (= pencil foliation, there is also red ink foliation which counts up to 489 folios but which has been crossed out by the pencil – the PDF contains 482 images, thus closer to the pencil numbering). 31 lines per page. Text in gilded text frame. Extensive rubrication and red overlining, regular use of red text separators. Diagrams carefully executed. Titles of individual titles in red script, in second volume sometimes also in larger script (the layout programme changes). Poetry clearly laid out (note especially long qaṣīda 416a-417b). Few marginal notes, those included are mostly additions/corrections. Some in stylised red signpost “stories” with the word <span class=\"italics\">ḥikāya</span> or <span class=\"italics\">ḥikāyāt</span> (e.g. folio 429a, 473a)</p>"
    },
    "Beyazit Kütüphanesi": {
      "B4003": "<p dir=\"auto\">189 folios. Text written in red frame. Rather many marginal notes identifying sections and adding additions and comments, many of them in Persian. Perhaps a copy that was used by scholars.</p><p dir=\"auto\">Title page 1a notes title in different hand (top right 1a), but the rest of the space is filled up with cursive writing, red for fasl.</p><p dir=\"auto\">Order is all over the place. 8a: start Risala 1.7, preceded by 1.8. Start of rasa'il identified in red. Pdf p. 20: Risala 8 (= 2:17 on languages) extensive note: “wa-l-munajjimūn yuqālū”</p><p dir=\"auto\">Ends on Risala on Animals as explicitly stated at the end (189b).</p><p dir=\"auto\">Waqf seal: Idrīs Bāshā al-Muḥāfiẓ Darūn Warīn (??)</p>",
      "B3948": "<p dir=\"auto\">Gold mistara and headpiece with floral decoration (blue, red, white and gold) on folio 1b).</p><p dir=\"auto\">Appears to be a full copy. Starts with fihrist.</p><p dir=\"auto\">Undated copy, early modern, perhaps 18th century?</p><p dir=\"auto\">459 folios.</p><p dir=\"auto\">Few (if any) marginal notes.</p><p dir=\"auto\">Waqf stamp on folio 409a, another largely unreadable stamp on folio 1a.</p>"
    },
    "İstanbul Üniversitesi Merkez Kütüphanesi": {
      "NEKFY00401": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>, 218 folios 181x100</p><p dir=\"auto\">Relatively extensive marginal annotation. Flyleaf has notes dated to 1125/1713-4 and 1169/1755-6.</p>"
    },
    "Millet Kütüphanesi": {
      "34AliEmiriArabi950": "<p dir=\"auto\">353 folios, 39 lines per page (330x205-255x140 mm).</p><p dir=\"auto\">A full copy of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span>?</p><p dir=\"auto\">Old description on the “Yazmalar” portal (now replaced by YEK) indicated that this might be a rather luxuriously produced copy.</p>",
      "Feyzllah2130and2131": "<p dir=\"auto\">A 2-volume set constituting a full copy of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span>. Cleanly produced copy with red rubrication throughout.</p><p dir=\"auto\"><strong>Feyzüllah 2130</strong> has a luxurious frontispiece: golden rectangular frame with floral motives, title in red, white and blue ink.<span class=\"italics\"> </span>Title given as: <span class=\"italics\">Rasāʾil ikhwān al-ṣafā wa-khulān al-wafā fī tahdhīb al-nafs wa-iṣlāḥ al-akhlāq aḥad wa-khamsūn risāla kamilan wa-l-ḥamdu li-l-Lāh waḥdu-hu</span></p><p dir=\"auto\">Title page notes:</p><p dir=\"auto\">Attribution of the text to al-Majrīṭī</p><p dir=\"auto\">Ownership note by Muṣṭafā b. ʿAlī year 21 (?) , and below that “5000”</p><p dir=\"auto\">Acquisition note of this vol. + second vol., dated to 1015 al-Jānī Waysī (?)</p><p dir=\"auto\">Ownership note 1112 Feyzüllah al-mufti.</p><p dir=\"auto\">Acquisition note ʿAṭāʾ Allāh b. Nawʿī the judge of the city … (name of city and year invisible due to blot) = this is Nevizade Atai (991-1044/1634), a scholar-poet (see EI3 entry by Hatice Aynur) who owned several MSS (including BnF Arabe 1694)</p><p dir=\"auto\">Fol. 200a:</p><p dir=\"auto\">Colophon dated 11 Rabīʿ II 704/19 November 1304, copied by ʿAlī b. Mūsā b. ʿImrān b. Ismāʾīl b. ʿImrān b. Mūsā b. Faḍl al-Shunaynī (al-Shinīnī in vol. 2) al-Sulamī (al-Shalamī in vol. 2)</p><p dir=\"auto\">Waqf stamp Constantinople 1112.</p><p dir=\"auto\">Star with name Yūnis inside it.</p><p dir=\"auto\"><strong>Feyzüllah 2131</strong> has a more simple frontispiece, but title page bears more or less the same ownership notes as vol. 1 + this extensive <span class=\"italics\">khizāna</span> note in Arabic and Persian (only the Arabic content has been transcribed here):</p><p dir=\"auto\">من جملة خزانة كتب سيدنا</p><p dir=\"auto\">ومولانا الأمير السيد الجليل الامام شرف آل رسول الله</p><p dir=\"auto\">فخر العترة الطاهره سيد اكابر الملوك والخواقين سلطان الحكماء</p><p dir=\"auto\">المتقنين خلف ايمة الدين امير المسلمين ..لاذ المتقين الكريم بن الكريم بن المكين</p><p dir=\"auto\">ابن المطاع الأمير بن المتير چنان چهن خان كرم مسترد كه سميرع ورقاق ... خورد سرد كر بدورش بنازم ...</p><p dir=\"auto\">....</p><p dir=\"auto\">....</p><p dir=\"auto\">.... الموعود ودولته وصلوته في المأية العاشرة\t\tمفيض النعم الفاخره شامة ال...</p><p dir=\"auto\">في المأية الاخرة المويّد باحراز كلا الرياستين اجامع بين حكمة ارسطو وحكمة ذى القرنين ...</p><p dir=\"auto\">درة بحر الامام الحسين وقرة عين الامام الحسين سلطان المشرقين خاقان الخافقين ...</p><p dir=\"auto\">السلطان ابي الحسين كاركيا شاه احمد بهادر خان \tسلام الله عليه واحسن كما...</p><p dir=\"auto\">اللهم متع عباده به سرطا ومتعه من دولته ابدًا</p><p dir=\"auto\">There were at least two Aḥmad Kārkiyā’s in the Kārkiyā dynasty of Gilan, the former died in 940/1533-4 after 22 years of rule and the latter is the final ruler of the dynasty for whom there is a <span class=\"italics\">tarjama</span> in <span class=\"italics\">Aʿyān al-shīʿa</span> (the presentation of the dynasty there needs closer study, hence why the identification here is unsure).</p><p dir=\"auto\">In any case, the earliest ruler of this dynasty died in 763 (at least according to <span class=\"italics\">Aʿyān al-shīʿa</span>), so the manuscript was not produced for a ruler of this dynasty, but rather came into the hands of one of their rulers, who then added the <span class=\"italics\">khizāna</span> note.</p><p dir=\"auto\">Fol. 1b has a nicely illuminated headpiece in blue and gold, with a diagram of the <span class=\"italics\">aflāk</span> on facing page 2a.</p><p dir=\"auto\">Colophon 169b: mid-Ṣafar [705? / September 1305 – no year is noted here, but this would be 10 months after the completion of the preceding volume, which seems possible] + slight variation in copyist’s name (see above)</p>"
    },
    "Topkapı Palace Library": {
      "AhmetIII32581": "<p dir=\"auto\">Arabic Manuscripts institute al-falsafa waʾl-manṭiq 209 - “Jild al-awwal”, originally probably a full set, 302 pages, 19 lines, in database attributed to Ibn Sīnā</p>",
      "RevanKk1062": "<p dir=\"auto\">Arabic Manuscript Institute al-falsafa waʾl-manṭiq 211: first volume only. dated to 717 AH, 218 pages, 31 lines, written in different hands // Qism al-riyāḍiyāt al-falsafiyya, ends on risāla 16 “al-ladhdhāt waʾl-ālām” from jismāniyyāt</p>",
      "EmanetHazinesi1684": "<p dir=\"auto\">Arabic Manuscript Institute al-falsafa waʾl-manṭiq 213. According to Karatay a full copy of the <span class=\"italics\">Rasāʾil</span>, but according to Arabic Manuscripts Institute this is rather a copy of the <span class=\"italics\">al-Risāla al-Jāmiʿa</span>.</p>",
      "EmanetHazinesi1686": "<p dir=\"auto\">Copyist ʿĀrif b. ʿAlī al-Ḥalabī, 1161/1748</p><p dir=\"auto\">(Data from Karatay)</p>",
      "AhmetIII32582": "<p dir=\"auto\">Arabic Manuscripts institute al-falsafa waʾl-manṭiq 208 - second qism, in database attributed to Ibn Sīnā, 211 pages, 19 lines</p>",
      "AhmetIII2128": "<p dir=\"auto\">A rather nicely produced copy of the third qism and part of the fourth qism of <span class=\"italics\">RIS</span> (up to 4.4).</p><p dir=\"auto\">The flyleaf contains a reference to the sultan Bayezid b. Muhammad Khan, which can only be Bayezid II. The second flyleaf (1a) also contains his almond-shaped stamp alongside another later sultanic stamp and a tughra.The flyleaf also contains ʿAtūfī’s phrase identifying the work as “mujallad min kitāb Ikhwān al-Ṣafāʾ fī al-riyāḍiyāt wa-ghayra-hu” and in different writing the single word “ḥikma.”</p><p dir=\"auto\">280x190mm. 93 folios, 29 lines per page. Regular use of rubrication for section titles and golden roundels to separate sentences/enumerations. First few epistle titles in gold lined bold black script (a accompanied by decorative roundels), then from folio 31a (epistle 3.8) in blue ink. Poetry layout distinctive.</p><p dir=\"auto\">46b: a note in red script indicates that the copyist consulted a number of manuscripts and included a variant version of the secret alphabet given at the end of epistle 3.10.</p><p dir=\"auto\">Folio 83a is the last folio to contain an epistle title (4.3), but on folio 90a there is an open space which indicates the start of another epistle, though the title has not been filled in. The material here corresponds to the first fasl of epistle 4.4. in the published edition (though skipping its introduction). This and the lack of colophon and the diminishing care in the execution of the layout at the end of the manuscript indicate that the manuscript was perhaps never finished.</p><p dir=\"auto\">Arabic Manuscripts institute al-falsafa waʾl-manṭiq 210 (in database attributed to Ibn Sīnā)</p>"
    }
  },
  "Jedda": {
    "Jāmiʿat al-Malik ʿAbd al-ʿAzīz": {
      "11927": "<p dir=\"auto\">Partial copy of the <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span> evidently (based on start and end of manuscript included in database) starting at 2.1. End unclear, but the manuscript only contains 101 folios.</p><p dir=\"auto\">Copied by Tūmā Buṭrus Jabāra al-ṭabīb, dated to 1801 – no hijrī date given, perhaps because the copyist is clearly Christian.</p><p dir=\"auto\">Two seals on title page and two on first text page, but no details given.</p><p dir=\"auto\">22 lines per page, 17x22 cm. Rubrication of some words.</p>"
    }
  },
  "": {},
  "Jounieh": {
    "Ordre Basilien Alepin": {
      "363": "<p dir=\"auto\">17th C? majmūʿa containng mostly homilies but also about 15 pages of extracts from <span class=\"italics\">Ikhwān al-Ṣafāʾ</span></p>"
    }
  },
  "Kabul": {
    "Kabul Museum Library": {
      "14356": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-Ṣafāʾ,</span> seemingly a full (?) rather nicely produced copy. Naskh, 445 folios, 26x17cm, 21 lines per page, golden frontispiece and font on first two pages, red and black mistara. Red rubrication</p>"
    }
  },
  "Kashan": {
    "Riḍāwī": {
      "70": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>, 11th/17th C. Name of Timur in preface.</p>"
    }
  },
  "Kastamonu": {
    "İl Halk Kütüphanesi": {
      "37Hk21906": "<p dir=\"auto\">Dated to 1234/1817. Multiple-text manuscript compiled by same copyist. Previous text finished in Jum II 1233. <span class=\"italics\">Ikhwan</span> bit: 95a-454a. Very plain but quite orderly copy. 454a: colophon: first half copied in Istanbul (al-Qusṭanṭiniyya) second half in “our city” B-ṭūsiyya” 21 Dhū al-Ḥijja 1234 by Muḥammad Khāliṣ b. Aḥmad.</p><p dir=\"auto\">Also contains some folios from al-Rāzī</p><p dir=\"auto\"><a href=\"http://www.yazmalar.gov.tr/eser/resailu-ihvanis-safa/56953\" target=\"_blank\">http://www.yazmalar.gov.tr/eser/resailu-ihvanis-safa/56953</a></p>"
    }
  },
  "Kayseri": {
    "Raşit Efendi Yazma Eser Kütüphanesi": {
      "865": "<p dir=\"auto\">Title page: double medallion — dedicated to Mehmed b. Murad = Mehmed Fatih. Compare medallions in Nuruosmaniye 2858, 1460 civarı; Sehzade Mehmed 28 in Suleymaniye Library.</p><p dir=\"auto\">Title: “Rasāʾil ikhwān al-ṣafāʾ fī funūn al-ʿulūm wa-gharāʾib al-ḥikam wa-ẓarāʾif al-ādāb wa-ʿajāʾib al-amthāl”</p><p dir=\"auto\">Attributed on flyleaf (later hand) to the group of Scholars identified by al-Tawḥīdī (taken from Katip çelebi)</p><p dir=\"auto\">282 folios, rather luxuriously produced, in gold mistara + regular use of gold ink. Library founded in 1790s.</p><p dir=\"auto\">Note by Omar Ali-de-Unzaga: ‘A very interesting case. The Epistle on Magic (long version only) is numbered 51 (beg. f. 215v). It ends on fl. 272v.21. Then there is a kind of appendix on the mortality of the soul.’</p>"
    }
  },
  "Kerbala": {
    "al-Rawḍa al-Ḥusayniyya Library / Dār al-makhṭūṭāt al-ʿataba al-Ḥusayniyya": {
      "389m9055": "<p dir=\"auto\">Dated 1037, copied by a certain Muḥammad; 286 pages appears to be in full. Owned by “the doctors” in 1289AH. Seemes to be a nicely prepared copy.</p><p dir=\"auto\">This manuscript was lost and/or potentially destroyed during Saddam Hussein’s bombing of Kerbala in 1991. When Gowaart inquired about the manuscript on a visit to Kerbala in 2024, it was not listed in the shrine’s current database of manuscripts.</p>",
      "5494": "<p dir=\"auto\">Undated partial copy of <span class=\"italics\">Rasāʾil ikhwān al-Ṣafāʾ</span> starting in medias res in epistle 3.8, continuing to the end of the text. 265 pages, 29 lines per page. Minimal red rubrication, some marginal main text. Scan kindly provided by the people of the library on a visit in March 2024.</p>"
    }
  },
  "Khansar": {
    "K. Fāḍil Khānsārī": {
      "221": "<p dir=\"auto\">Single risala (51) in majmūʿa? Nastaʿlīq. Copyist Mullā Muḥammad Taqī Golpāygānī, 13th C. 28 pages (folios 147-174).</p><p dir=\"auto\">[Copy (microfilm?) Qom Markaz-i iḥyāʾ-i mīrāth 1144/3; Fehrestegan 16:419]</p>"
    }
  },
  "Konya": {
    "İzzet Koyunoğlu Şehir Müzesi": {
      "Film960?": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>, but potentially a microfilm? (The film may refer rather to the microfilm copy available in Iran, it is listed as 960-F in Tehran University Library). Mentioned in Danishpazhuh edition of Mujmal.</p>"
    },
    "Mevlana müzesi kütüphanesi": {
      "5707": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-</span><span class=\"italics\">ḥikma</span><span class=\"italics\">,</span> late 7th, early 8th C; Seljuq manuscript. From Danishpazhuh’s edition: Not dated, but ownership (?) marks from years 822, 845 (Mūsā b. Baḥshī) and 846 (birth notice of Muḥammad b. Muṣṭafā 1 Rabīʿ II, at dawn).</p><p dir=\"auto\">131 folios, size 27x19 cm, 19 lines per page (19,7x13,8 cm).</p>"
    }
  },
  "Kuwayt": {
    "Kuwayt University Library": {
      "874": "<p dir=\"auto\">qism 3 & 4, 178 folios, 30 lines per page.</p><p dir=\"auto\">See also: <a href=\"https://digitallibrary.al-furqan.com/our_is_item/manid/758318/groupid/0\" target=\"_blank\">https://digitallibrary.al-furqan.com/our_is_item/manid/758318/groupid/0</a></p>"
    }
  },
  "Lahore": {
    "Punjab University Library": {
      "MuammadShafLahr24479": "<p dir=\"auto\">Mujmal al-Ḥikma, copied by Saʿd Allāh, 1014/1605-6.</p>"
    }
  },
  "Leeds": {
    "Leeds University Library": {
      "25": "<p dir=\"auto\">MacDonald catalogue pp. 23-24, authorship al-Tawḥīdī? (I presume this is a mistake by the cataloguer and MS bears ascription to the group discussed by Tawhidi).</p>"
    }
  },
  "Leiden": {
    "Universiteitsbibliotheek": {
      "Or444": "<p dir=\"auto\">Epistles 25-51. Substantial entry in Latin catalogue (see digital resource).</p><p dir=\"auto\">Folio 1a contains a fihrist of included rasāʾil in red ink.</p><p dir=\"auto\">24,2x14,5 cm (16,5x8,5cm), 35 lines per page</p><p dir=\"auto\">Rubrication and red overlining. Some pencil marking of passages (?).</p><p dir=\"auto\">Some empty folios between epistles.</p><p dir=\"auto\">249a: end of text, potentially a colophon but effaced.</p><p dir=\"auto\">Red stamp with coat of arms</p>"
    }
  },
  "London": {
    "British Library": {
      "IOIslamic824": "<p dir=\"auto\">Majmūʿa compiled by Aḥmad ibn Sulaymān Ghūjārātī completed in 1134/September-October 1722; contains a brief extract from Ikhwan epistle on Music.</p>",
      "Persianno99?": "<p dir=\"auto\">Mujmal al-ḥikma, mentioned by Danishpazhuh as dating to 845, TBC.</p>",
      "Or23589": "<p dir=\"auto\">Full copy in <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ.</span> Two volume set</p><p dir=\"auto\">Title page (no decoration) contains author attribution (see below) + acquisition note dated to the day of the feast Shawwāl 1117 (?) in Benares?</p><p dir=\"auto\">رسائل اخوان الصفا املاها ابو سليمان</p><p dir=\"auto\">محمد بن نصر البستي المعروف بالمقدسي</p><p dir=\"auto\">وابو الحسن علي بن هرون الزنجاني وابو</p><p dir=\"auto\">احمد النهروجودي والعوفي وزيد بن رفاعة</p><p dir=\"auto\">كلهم حكماء اجتمعوا وصنّفوا احدى</p><p dir=\"auto\">وخمسين رسالة * من كشف الظنون</p><p dir=\"auto\">عن اسامى الكتب والفنون *</p><p dir=\"auto\">Folio 1b gold mistara (retained throughout most of the MS) + gold red and blue floral header. Contains fihrist. 25 lines per page. Page 255x160 mm, writing surface 170x100mm.</p><p dir=\"auto\"><strong>2358</strong>: 3a-10b is in different handwriting, ends on 9b with scribal note in descending triangle</p><p dir=\"auto\">تمت فهرس رسايل اخوان الصفا وخلان الوفا واهل العدل وابناء الحمد</p><p dir=\"auto\">وارباب الحقايق واصحاب المعانى في تهذيب النفوس</p><p dir=\"auto\">واصلاح الاخلاق والبلوغ الى السعادة الكبرى و المفارة</p><p dir=\"auto\">العظمى والبقاء الدايم والكمال السرمد بخول الله</p><p dir=\"auto\">وقوته وتائيده وتوفيقه وله الحمد وحده</p><p dir=\"auto\">وصلى الله على رسوله سيدنا محمد</p><p dir=\"auto\">واله والائمة الطاهرين وسلم</p><p dir=\"auto\">تسليما كثيرا تمت تمام شد</p><p dir=\"auto\">فهرست اخوان الصفا</p><p dir=\"auto\">بخط خام محمد عبد</p><p dir=\"auto\">الرحمن بهارى</p><p dir=\"auto\">Followed on 10a-10b with a note about the authorship of the <span class=\"italics\">Rasāʾil</span>, following the Tawhidi attribution, and ending on Tawhidi’s death date (414 (in Persian numerals) in Shiraz)</p><p dir=\"auto\">11a: revert to mistara-original, end of qism al-riyadiyat, but 11b seems to start right with risala 1.1</p><p dir=\"auto\">Red rubrication. Goes up to risala 27 (i.e. numbered consecutively, not in aqsām!)</p><p dir=\"auto\">Every new risala has a similar decorated header, risala number in white ink.</p><p dir=\"auto\">Final page of the codex:</p><p dir=\"auto\">“Bequest of Syed Ali, Hyderabad</p><p dir=\"auto\">Deccan, 28 May 1881”</p><p dir=\"auto\"><strong>MS 2359</strong>: picks up where previous manuscript ends, with risala 28, same layout.</p><p dir=\"auto\">253b: “risala 52”, start matches start of Magic risala in Edition</p><p dir=\"auto\">262b: “risala 53” (!), start matches text under first <span class=\"italics\">faṣl</span> of Magic risala in edition</p><p dir=\"auto\">=> two rasa’il given consecutive here, but separated into two epistles</p><p dir=\"auto\">307a: colophon, dated 27 Ṣafar 1088 (?) no name</p><p dir=\"auto\">تمت الكتاب اخوان الصفا وخلان الوفا</p><p dir=\"auto\">والحمد لله رب العالمين والصلوة على محمد وآله اجمعين والسلام</p><p dir=\"auto\">في التاريخ السابع والعشرين من شهر صفر</p><p dir=\"auto\">ختمه الله بالخير والنصر في</p><p dir=\"auto\">سنة ١٠٨٨</p><p dir=\"auto\">هجرية</p><p dir=\"auto\">This is followed by additional material folios 308b-321a: written in different hand, same hand as additional folios in the first volume. Starts with fihrist, but perhaps more detailed than usual, notes all the fuṣūl in addition to the rasa’il</p>",
      "Or4518": "<p dir=\"auto\">Retains oriental binding. Page: 290x180mm, writing surface (mistara) 213x113mm. Red rubrication, 27 lines per page. Starts with fihrist (1b-4b). No title page, but 1b has golden header. 5a start risala on arithmetic. Neither here nor later special large headers for new rasa’il, though they tend to end on triangulated colophons to create a text break). Has quite a few marginal notes that would be worthy of closer study, though most seem to be content indications.</p><p dir=\"auto\">402b: colophon (+ two epigrams):</p><p dir=\"auto\">وهذا كتاب اخوان الصفا وهو احدى وخمسين رسالة ولله الحمد على اتمامه</p><p dir=\"auto\">والصلوة والسلام على محمد خاتم انبيائه وفرغ من</p><p dir=\"auto\">تسويده اقل خلق الله واضعف عباد الله</p><p dir=\"auto\">واعجزهم ظاهرًا ومعنىً محمد بن نعمت الله</p><p dir=\"auto\">الطبلى الكيلكي في يوم الخميس في ست</p><p dir=\"auto\">عشرين من شهر رجب المرجب</p><p dir=\"auto\">لسنة اربع وتسعون</p><p dir=\"auto\">بعد الف</p><p dir=\"auto\">سنة</p><p dir=\"auto\">١٠٩٤</p><p dir=\"auto\">Later ownership notes neatly aligned on bottom of final page, three generations: [11]32 - 1144 - 1168 - “ibnu-hu” (preceding notes difficult to read, but don’t seem no note names)</p><p dir=\"auto\">Title page has the below waqf note (repeated on final page) + an epigram in a different hand, attributed to a certain ʿAlī b. Ḥusayn b. Muḥammad b. Yūsif (+ what seems like a magic square)</p><p dir=\"auto\">اشهدنى السيد حمد بن سعيد بن خلفان البوسعيدى</p><p dir=\"auto\">بانه قد وقف هذا الكتاب ليقرا منه من شاء الله من المسلمين</p><p dir=\"auto\">وقفا مؤيدا الى يوم القيمه فمن بدله بعدما سمعه فانما</p><p dir=\"auto\">اثمه علي الدين يبدلونه ولله سمع عليهم وكتبه بيده وشهد به</p><p dir=\"auto\">الفقير حمد بن سعيد بن عام الطيوني</p><p dir=\"auto\">“Presented by Col. S.B. Miles, 3d Oct. 1891” [From Wikipedia: “<strong>Samuel Barrett Miles</strong> (2 October 1838 – 28 August 1914) was a <a href=\"https://en.wikipedia.org/wiki/British_Army\" target=\"_blank\">British Army</a> officer who served as a diplomat in various Arabic-speaking countries, notably Oman, which he came to know better than any other European of the time. The notes that he made were published after his death as <span class=\"italics\">The Countries and Tribes of the Persian Gulf</span>.”]</p><p dir=\"auto\">1a: waqf note (+ poem + magic square?)</p><p dir=\"auto\">اشهدنى السيد حمد ب سعيد ب خلفان البو سعيدى</p><p dir=\"auto\">بانه قد اوقف هذا الكتاب ليقرا منه من شاء الله من المسلمين</p><p dir=\"auto\">وقفا مؤىدا الي يوم القيمة فمن بدله بعدما سمعه فانما</p><p dir=\"auto\">اثمه علي الدين يبدلونه والله سمىع عليم وكتبه بيده وشهد به</p><p dir=\"auto\">الفقر حمد ب سعيد ب عام الطيونى</p><p dir=\"auto\">[From Wikipedia: <strong>Ahmad bin Said al-Busaidi</strong> (1694 – 15 December 1783) was the first ruler of <a href=\"https://en.wikipedia.org/wiki/Oman\" target=\"_blank\">Oman</a> of the <a href=\"https://en.wikipedia.org/wiki/Al_Said\" target=\"_blank\">Al Said</a> dynasty]</p><p dir=\"auto\">402b: colophon (red overlined)</p>",
      "Or6692": "<p dir=\"auto\">646/1248-9, mentioned in Sotheby’s report for Lot 27.</p><p dir=\"auto\">Gowaart’s notes from consulting the MS:</p><p dir=\"auto\">According to spine pts. 3.5-4.3, BUT in fact starts with section from 3.2 (on the seasons, from astronomy), and then 3.6 => there may be more omitted rasā’il.</p><p dir=\"auto\">6a = risāla 3.6; 16b: 3.7; 38a: 3.8; 53b: 3.9; 79b: 3.10; 90b: 4.1; 183b: 4.2; 190a: 4.3</p><p dir=\"auto\">First page (recto of folio) starts with basmallah (though the first few lines are a restoration and probably written later). 205 folios. Big headers for rasāʾil in red + red rubrication throughout. First one on folio</p><p dir=\"auto\">Seal on frontispiece (incompletely preserved, restored) dated to 1320. Some other notes difficult to read, perhaps one related to waqf. Only one substantial marginal note, 158a.</p><p dir=\"auto\">Colophon: copied (second Sunday of?) Ramaḍān 646 + Iskandar-date Kānūn I 1559, copyist Aḥmad b. Yūsuf al-Nawāsī (al-Bawāsī?)</p><p dir=\"auto\">Below colophon consultation note: Ṣafar winter (?) of the year 830 (indeed December) by someone who borrowed it from its owner (… bi-māliki-hi) Abū l-Ḥasan Muḥammad b. Abī al-Rakān (?) shaykh Fakhr al-Dīn</p><p dir=\"auto\">Bought from I[saac or Ibrahim] E[lias] Gejou in 1906, became French citizen, Iraqi origin, see Nadia Ghanem: <a href=\"https://blogs.soas.ac.uk/soashistoryblog/2021/05/06/ibrahim-elias-gejou-and-old-babylonian-omens/\" target=\"_blank\">https://blogs.soas.ac.uk/soashistoryblog/2021/05/06/ibrahim-elias-gejou-and-old-babylonian-omens/</a></p>",
      "Or8254": "<p dir=\"auto\">Gowaart’s notes from consulting the MS:</p><p dir=\"auto\">Dated to 11 Dhu l-Ḥijja 644/1247.</p><p dir=\"auto\">Epistles 2.7-3.9; every epistle is given a title page and prominent colophon it seems. In (some of- these titles pages, the phrase <span class=\"italics\">min kalām al-ṣūfiyya</span> appears (for example 94a).</p><p dir=\"auto\">Main title page has a poem in Persian nasta’liq. + note by ʿAbd al-Wahhāb b. Yūsuf b. Aḥmad b. ʿAbd al-Raḥman al-mutaṭabbib al-mīrḥusaynī (?) => appears to have circulated in Persian speaking lands. Bought of Abdul Majid Belshah 1919 (see also Or. 8372!) = <a href=\"https://www.qdl.qa/en/baghdadi-bookseller-bloomsbury\" target=\"_blank\">https://www.qdl.qa/en/baghdadi-bookseller-bloomsbury</a></p>",
      "Or8372": "<p dir=\"auto\">1012/1603-4 A philosophical encyclopaedia in the form of a Persian translation of an Arabic abridgement of the Ikhwān al-Ṣafā (see Glyn Meredith-Owens: Handlist of Persian Manuscripts, 1895-1966. [London]: Trustees of the British Museum, 1968, p.88)</p><p dir=\"auto\">Gowaart’s notes from consulting the MS: Bought from Abdul Majid Belshah in 1919. Quite extensive notes and poetry on flyleaves. Note ated 1241 on second flyleaf. Nasta’liq. Only 120 folios, 21.7x10.3cm. Copyist Mīr Sohrab b. Jawānī Afandī, dated 1012AH</p>",
      "Add959927": "<p dir=\"auto\">Extract in majmū'a (fī l-hayʾa) => data from ISMI Website</p><p dir=\"auto\">Gowaart’s notes from consulting the MS: Big majmūʿa, red oriental binding (with flap). Treatises in different hands, several of them maghribi. Folios 228a-239a is the 27th text in this volume, it is attributed to Ibn Sīnā, but heavily reminiscent of Ikhwān materials, if not a direct match. In colophon entitled “al-mukhtaṣar fī ʿilm al-hayʾa”. Cfr. photographs. Copied on Monday 17th of Rabīʿ I 1221 / 4 June 1806</p><p dir=\"auto\">cfr. also Rieu, Charles, and W. Cureton. 1871. Catalogus Codicum Manuscriptorum Orientalium Qui In Museo Britannico Asservantur. Pars Secunda, Codices Arabicos Amplectens . London.</p><p dir=\"auto\">Pp. 444-47 (Ref. no. 977).</p>"
    },
    "Institute of Ismaili Studies": {
      "83E": "<p dir=\"auto\">Title: Rasā’il Ikhwān al-Ṣafā’ wa-khullān al-wafā’</p><p dir=\"auto\">Description: E (83): pp. 225, 22 x 14.5 / 16 x 10 em., 21 lin.</p><p dir=\"auto\">-- Oriental laid paper (laid lines only).</p><p dir=\"auto\">-- Clear Naskhī hand.</p><p dir=\"auto\">-- Rubrics.</p><p dir=\"auto\">-- Reddish-brown leather binding (with flap).</p><p dir=\"auto\">Notes: Qism 3 (risālah 1-10).</p><p dir=\"auto\">-- No date (13/19th cent.).</p><p dir=\"auto\">DocumentationGacek, Adam. Catalogue of Arabic Manuscripts in the Library of The Institute of Ismaili Studies (Vol. 1). London: Islamic Publications Ltd., 1984.</p><p dir=\"auto\">Incipit</p><p dir=\"auto\">اعلم ايها الاخ انا قد فرغنا عن بيان علل اختلاف اللغات والكلام والاصوات ورسوم الخطوط والكتابات ...</p>",
      "84B": "<p dir=\"auto\">Relevant catalogue Gacek.</p><p dir=\"auto\">Rasā’il Ikhwān al-Ṣafā’ wa-khullān al-wafā’</p><p dir=\"auto\">Description: *B (84): pp. 329, 23.5 x 13.5 / 17 x 8.5 em., 17-19 lin.</p><p dir=\"auto\">-- Laid Oriental paper, without chain lines.</p><p dir=\"auto\">-- Irregular but legible Naskhī hand.</p><p dir=\"auto\">-- Word faṣl, overlinings (~) and 'punctuation' (•) in red.</p><p dir=\"auto\">-- Reddish-brown leather binding (without flap).</p><p dir=\"auto\">Notes: al-Juz’ al-rābī‘ (i.e. qism 2, risālah 8).</p><p dir=\"auto\">-- Copied in Amrīṭ, Rabī‘ al-Ākhir 1239/1823, in the time of (fī waqt) Dā‘ī Ṭayyib: Zayn al-Dīn (d.1252/1837), by Ṭayyib ‘Alī ibn al-Ḥājj Mullā Ibrāhīm-jī Ḥakīm.</p><p dir=\"auto\">-- Occasional marginal corrections.</p><p dir=\"auto\">DocumentationGacek, Adam. Catalogue of Arabic Manuscripts in the Library of The Institute of Ismaili Studies (Vol. 1). London: Islamic Publications Ltd., 1984.</p><p dir=\"auto\">Incipit</p><p dir=\"auto\">الحمد لله رب العالمين والعاقبة للمتقين ... واذ قد فرغنا من دكر النبات وبينا طرفا من كيفية تكوينها ...</p>",
      "85C": "<p dir=\"auto\">Description: C (85): ff. 136, 20.5 x 15.5 / 16 x 10 em., 16 lin.</p><p dir=\"auto\">-- Laid Oriental paper, laid lines only.</p><p dir=\"auto\">-- Naskhī hand.</p><p dir=\"auto\">-- Rubrics.</p><p dir=\"auto\">-- Quarter-bound.</p><p dir=\"auto\">Notes: Qism 2 (risālah 1-7).</p><p dir=\"auto\">-- Copied in Rabī‘ al-Awwal 1111/1699 by Fāṭimah-jī bint Khān-jī.</p><p dir=\"auto\">-- Badly wormed.</p><p dir=\"auto\">DocumentationGacek, Adam. Catalogue of Arabic Manuscripts in the Library of The Institute of Ismaili Studies (Vol. 1). London: Islamic Publications Ltd., 1984.</p><p dir=\"auto\">Incipit</p><p dir=\"auto\">اعلم يا اخى انه لما كان النظر فى علم الطبيعيات جزء 1 من صناعة اخواننا ايدهم الله وايانا بروح منه والاصل فى هذا العلم هو معرفة خمسة اشياء و هى الهيولى والصورة ...</p>",
      "86D": "<p dir=\"auto\">Rasā’il Ikhwān al-Ṣafā’ wa-khullān al-wafā’</p><p dir=\"auto\">Description: D (86): ff. 219, 20.5 x 15.5 / 14-17 x 9-10 em., 15-19 lin.</p><p dir=\"auto\">-- Laid Oriental paper (laid lines only).</p><p dir=\"auto\">-- Two Naskhī hands.</p><p dir=\"auto\">-- Rubrics.</p><p dir=\"auto\">-- Quarter-bound.</p><p dir=\"auto\">Notes: Qism 2 (risālah 9-17).</p><p dir=\"auto\">-- No date (12/18th cent.).</p><p dir=\"auto\">-- Some marginal corrections and glosses shaved.</p><p dir=\"auto\">-- Wormed.</p><p dir=\"auto\">DocumentationGacek, Adam. Catalogue of Arabic Manuscripts in the Library of The Institute of Ismaili Studies (Vol. 1). London: Islamic Publications Ltd., 1984.</p><p dir=\"auto\">Incipit</p><p dir=\"auto\">الحمد لله وسلام على عباده الذين اصطفى الله خير اما بعد يشركون اعلم ايها الاخ ... انا قد فرغنا من ذكر رسالة الحيوانات وبيان عجائب هياكلها وغرائب احوالها ...</p>",
      "87G": "<p dir=\"auto\">Rasā’il Ikhwān al-Ṣafā’ wa-khullān al-wafā’</p><p dir=\"auto\">Description: G (87): ff. 331.</p><p dir=\"auto\">-- Other details as in c.C.</p><p dir=\"auto\">Notes: Qism 4 (risālah 3-11).</p><p dir=\"auto\">-- Copied in Rajab 1114/1702 by Fāṭimah bint Miyān Khān-jī-bhā’ī.</p><p dir=\"auto\">-- Wormed.</p><p dir=\"auto\">-- Ref. GAL 1,214; SI 380; Ivanow 18-21 (12).</p><p dir=\"auto\">Documentation: Gacek, Adam. Catalogue of Arabic Manuscripts in the Library of The Institute of Ismaili Studies (Vol. 1). London: Islamic Publications Ltd., 1984.</p><p dir=\"auto\">Incipit</p><p dir=\"auto\">الحمد لله وسلام على عباده الذين اصطفى ... اعلم ايها الاخ ... بانا قد فرغنا من ماهية الطريق الى الله تع وكيفية وصول الى معرفته وهو الغاية القصوى …</p>",
      "88F": "<p dir=\"auto\">TitleRasā’il Ikhwān al-Ṣafā’ wa-khullān al-wafā’</p><p dir=\"auto\">Description: F (88): ff. 131, 19.5 x 15 / 14-15.5 x 9-11 em., 13-15 lin.</p><p dir=\"auto\">-- Oriental laid paper (laid lines only).</p><p dir=\"auto\">-- Two Naskhī hands.</p><p dir=\"auto\">-- Rubrics.</p><p dir=\"auto\">-- Quarter-bound.</p><p dir=\"auto\">Notes: Qism 4 (risālah 1-2).</p><p dir=\"auto\">-- Copied in Jumād al-Ākhir (!) 1133/1721.</p><p dir=\"auto\">DocumentationGacek, Adam. Catalogue of Arabic Manuscripts in the Library of The Institute of Ismaili Studies (Vol. 1). London: Islamic Publications Ltd., 1984.</p><p dir=\"auto\">Incipit</p><p dir=\"auto\">الحمد لله وسلام على عباد الله الذين اصطفى ... اعلم ايها الاخ انا قد فرغنا من بيان الحدود والرسوم التى هى اخر النفسانيات العقليات ...</p>",
      "206": "<p dir=\"auto\">Description:‎\t‎(206): pp. 86-190.‎</p><p dir=\"auto\">‎-- For other details see no. 109.‎</p><p dir=\"auto\">Notes:‎\tAbridgement of those sections of <span class=\"italics\">Rasā‎‎‎‎‎’‎il Ikhwān al-Ṣafā‎‎‎‎‎’‎</span> which ‎deal with metaphysics (ḥikmah).‎</p><p dir=\"auto\">‎-- Copied (and perhaps compiled) by Aḥmad Muḥammad al-‎Ḥājj Khādim al-‎‎‘‎Ilm al-Sharīf in Shawwāl 1282/1866.‎</p><p dir=\"auto\">‎-- Followed by (pp. 191-195) 1. Qaṣīd min kalām Yūsuf ‎ibn ‎‎‘‎Afīf al-Dīn al-Miṣrī (same as no. 65,2), 2. [al-Qaṣīdah] al-‎Ṣūrīyah (pp. 196-228) by [Muḥammad ibn ‎‎‘‎Alī] al-Ṣūrī ‎‎(fl.5/11th cent.), beginning:‎</p><p dir=\"auto\">فاول الرسل الكرام ادم * لانه بكل شئ عالم ‏</p><p dir=\"auto\">علمه الله الاسماء * من بعد ما زوجه حواء ‏</p><p dir=\"auto\">‎-- see Poonawala 110 (1). 3. Qaṣīd fī sharḥ al-Madīnah (pp. 229-‎‎231), beginning:‎</p><p dir=\"auto\">خلاص من الدنيا فهوا صفوا نيتى *‏</p><p dir=\"auto\">وحسن يقينى عارفا بمدينت ‏</p><p dir=\"auto\">Gacek, Adam. Catalogue of Arabic Manuscripts in the Library of The Institute of Ismaili Studies (Vol. 1). London: Islamic Publications Ltd., 1984.</p><p dir=\"auto\"><strong>Incipit</strong></p><p dir=\"auto\">الحمد لله الذى بدع الحدود من الوجود واختراع الاختر اعات بلا تمثيل ولا فكر ... ‏فصل الخطاب والحمد لله رب العالمين اعلم ايها الاخ اننا لما اشفقنا على المومنين ‏بدءنا لهم فى نجز هذا الرسالة المتقدمة على الرسائل ومدخلا لهم العدد ... وقلنا فى ‏فهرسة الرسائل وتتمة اسمائها ان الغرض والمراد من هذا الرسالة رسالة للمتعلمين ‏الفلسفة الموثرين الحكمة ... فصل وذلك ان الاكثير هو الكيما والكيما هو المعنى ‏والمعنى هو السعادة والسعادة هو البقا على افضل الدوام ... ‏</p>",
      "576": "<p dir=\"auto\">Description:‎\tA (576): pp. 861, 25.5 x 15 1 21.5 x 11.5 em., 21 lin.‎</p><p dir=\"auto\">‎-- Fine Oriental wove paper.‎</p><p dir=\"auto\">‎-- Clear Naskhī hand.‎</p><p dir=\"auto\">‎-- Illuminated headpiece, chapter headings and borders; rubrics.‎</p><p dir=\"auto\">‎-- Later washable cloth binding (without f1 ap).‎</p><p dir=\"auto\">Notes:‎\tQiṣm 1-2.‎</p><p dir=\"auto\">‎-- No date (late 11/17th cent.).‎</p><p dir=\"auto\">Gacek, Adam. Catalogue of Arabic Manuscripts in the Library of The Institute of Ismaili Studies (Vol. 1). London: Islamic Publications Ltd., 1984</p><p dir=\"auto\"><strong>Incipit</strong></p><p dir=\"auto\">فهرست رسائل اخوان الصفا وخلان الوفا بجمل معانيها وماهيه اغراضهم فيها ‏وهى اثنتان وخمسون رسالة ... ‏‎(p. 29)‎‏ رسالة العدد وهى الاولى اعلم ايها الاخ ‏البار الرحيم ايدك الله وايانا بروح منه بانه لما كان من مذهب اخواننا الكرام ايدهم ‏الله النظر فى جميع علوم الموجودات .</p>",
      "659": "<p dir=\"auto\">Description:‎\tA (659): ff. 75, 17 x 10 / 11.5 x 7 em., 12 lin.‎</p><p dir=\"auto\">‎-- Laid Oriental paper (no chain lines visible).‎</p><p dir=\"auto\">‎-- Clear Naskhī hand.‎</p><p dir=\"auto\">‎-- Text rubricated.‎</p><p dir=\"auto\">‎-- Quarter-bound.‎</p><p dir=\"auto\">Notes:‎\tAbridgement of some sections from Rasā‎‎‎‎‎’‎il Ikhwān al-Safā‎‎‎‎‎’‎.‎</p><p dir=\"auto\">‎-- fol. 45a -60a: Ajwibat al-masā‎‎‎‎‎’‎il wa-hiya ithnā ‎‎‘‎ashara ‎mas‎‎‎‎‎’‎alah min jawāhir al-‎‎‘‎ilm wa-zubdat al-ḥikam, beginning: ‎ايدك الله الى طاعته وهداك الى جنته وايانا وجميع اخواننا برحمته من العلم الكريم ‏‏... المسالة الاولى ما هو اسم الله الاعظم ... الثانية ما معنى كلمة الله وكلام الله ... ‏الثالثة ما حقيقة رسول الله ...‏</p><p dir=\"auto\">No date (13/19th cent.).‎</p><p dir=\"auto\">‎-- Beginning same as Goriawala 6 (9), entitled Jāmi‎‎‘‎at al-‎jāmi‎‎‘‎ah fī al-ḥaqā‎‎‎‎‎’‎iq.‎</p><p dir=\"auto\">Gacek, Adam. Catalogue of Arabic Manuscripts in the Library of The Institute of Ismaili Studies (Vol. 1). London: Islamic Publications Ltd., 1984.</p><p dir=\"auto\">Incipit</p><p dir=\"auto\">‏(فصل) فى معرفة ادم الكلى وزوجته وابليس الكلى والشجرة المنهى عنها وما كان ‏من الامر فى حال البداية ... ‏</p>",
      "914": "<p dir=\"auto\">Nr. 50 in Cortese catalogue <span class=\"italics\">IIS Ismaili and Other Arabic Manuscripts</span>.<strong> </strong></p><p dir=\"auto\"><span class=\"italics\">Risālat jāmiʿat al-jāmiʿa</span> - Ṭayyibī/Bohra recension. A full HTR/transcription of this manuscript has been prepared by Gowaart.</p><p dir=\"auto\">The text is called <span class=\"italics\">al-Risāla al-Jāmiʿa</span><span class=\"italics\">t al-jāmiʿa</span> and attributed to “mawlānā Aḥmad b. ʿAbd Allāh b. Muḥammad” on the title page. However, there are several places on the top left of recto folios where there is a note to designate the <span class=\"italics\">juzʾ</span> of the text, where it is always noted as [<span class=\"italics\">al-Risāla] al-Jāmiʿa,</span> going up to part twelve. As these do not match rubrications, these are perhaps meant to relate the text of the MS to MSS of the <span class=\"italics\">RJ</span> so they can be studied together. This is just a hypothesis and remains to be ascertained.</p><p dir=\"auto\">The manuscript was copied by <span class=\"italics\">mamlūk</span> <strong>Miyā Maʾmūjī b. ʿAlī Pāʾīn b. Tājkhān b. Khūj</strong> - ʿurfat sadīkūt (?) fī ḥaḍrat al-sharīf wa-majālis mawlā-nā Zakī al-Dunyā waʾl-Dīn shaykh ʿAb[d al-Ṭay]yib ibn Ismaʿīl (last three words in secret script). This would be Syedna <a href=\"https://en.wikipedia.org/wiki/Abduttayyeb_Zakiuddin_II\" target=\"_blank\">Abduttayyeb Zakiuddin II</a> bin Syedna Ismail Badruddin I — Dai period: 1085–1110 AH = 1676–1692 AD, office in Jamnagar (Gujarat), Delia Cortese suggests the manuscript is mid-13th/19th C, but if the colophon is to be accepted as authentic this cannot hold, and the manuscript would be 11th/17th century. I am inclined to see the colophon as authentic, as I have not seen the practice of copying colophons wholesale on other MSS from the Bohra tradition.</p><p dir=\"auto\">The handwriting is rather irregular and even gives the impression of having been written in different hands. For example, it seems like there is a change in hand and <span class=\"italics\">qalam</span> on page 32: before that page the writing is very regular and bold, after it the writing is much more cursive, but after that it sometimes varies again towards being like the original pages. It may simply be a case of a scribe being rather irregular.</p><p dir=\"auto\">Ownership note by <span class=\"italics\">shaykh al-mashāyīkh</span> Mullā Muḥammad ʿAlī b. Fattāḥ Bahādī (?) b. Mīr Bahādī b. Sulaymān … from Ahmadabād in Kawthar</p><p dir=\"auto\">Ends on a long colophon with praise to Muḥammad, ʿAlī b. Abī Ṭālib, and Abū l-Qāsim al-Ṭayyib amīr al-muʾminīn.</p>",
      "927": "<p dir=\"auto\">Nr. 45 in Cortese catalogue <span class=\"italics\">IIS Ismaili and Other Arabic Manuscripts</span>.<strong> </strong></p><p dir=\"auto\">According to Cortese these are selections and extracts from the <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ.</span> This is indeed a kind of florilegium from the <span class=\"italics\">RIS</span>, as it were. The copyist’s name is <strong>Isḥāq b. al-Shaykh al-Fāḍil Sulaymānjī</strong>, who copied it in Shāhjahānpūr on Friday 18 Shaʿbān 1311 = 23 February 1894.</p><p dir=\"auto\">As a sampling of the manuscript’s eclectic contents, here is what is contained on the first three folios:</p><p dir=\"auto\">1v: Basmallah + this poem (quick and rough transcription)</p><p dir=\"auto\">رسالة شريفات المعاني\t\tوروضات طريقات المغاني</p><p dir=\"auto\">وجنات بها ما تشتهيه\t\tالنفس معا وتلتذ الرواني</p><p dir=\"auto\">لإخوان الصفا وابن أحمد\t\tوالباب العناصر والزمان</p><p dir=\"auto\">حصرن جميع اقسام لعلم\t\tباقنع ما يكون من البيان</p><p dir=\"auto\">فما شيء من الاشياء الا\t\tوفيها ذاك ووبه وجود الكيان</p><p dir=\"auto\">كمالا خير والتفضيل الا\t\tومنشيها لدخير المكان</p><p dir=\"auto\">وماذا القول في الانشأ هذا\t\tتولاه الامام عظيم شان</p><p dir=\"auto\">وكل صناعة تأتي على قد\t\tرصانعها كمشهود العيان</p><p dir=\"auto\">فطالعها تجدها فوق ما قيل\t\tفيها بالغا اقصى الامان</p><p dir=\"auto\">سلام الله واصله وآبا\t\t\tءه والآل منه بكل ان</p><p dir=\"auto\">Bottom margin poem</p><p dir=\"auto\">كل الهاكل صورة مذمومة\t\tالا التي في صورة الافلاك</p><p dir=\"auto\">وأتمها بين الذوات لانها\t\tقبلت تماما صورة الادراك</p><p dir=\"auto\">كم بين نفس شامخ في ذروة\t\tاو ما يكون حجارة الحكاك</p><p dir=\"auto\">The margins contain more comments. One of them discusses how many miles fit into a parasang, and how many fingerbreadths into a mile (taken from risala 1.4 on geography).</p><p dir=\"auto\">2r-2v: fihrist of the general <span class=\"italics\">RIS,</span> given as general information, it would seem, rather than as guidance to the materials in the presen MS, as is evident from the material on the immediately following folio.</p><p dir=\"auto\">3r: direct start (<span class=\"italics\">wa-minhā) </span>into a dialogue between a king and a <span class=\"italics\">ḥakīm,</span> taken from risāla 2.8 (not specifically attributed) on animals. It follows the anecdote from <span class=\"italics\">RIS</span> only for a couple of lines — essentially a single paragraph from the edition — before switching to another extract, attributed to “Risālat ḥikmat al-ḥaywa waʾl-mawt”, i.e. risāla 2.15. Then, on the penultimate line, it switches again to another extract attributed to risāla 3.9.</p><p dir=\"auto\">The modus operandi of the manuscript is thus clear from the first pages, although the reasons for directly putting extracts next to each other needs further study. Not all the material included in the manuscript can be mapped onto the <span class=\"italics\">RIS</span>. For example, the final section of the MS, on 144v to 145r, directly preceding the colophon, is not attested in the edition of <span class=\"italics\">RIS</span> and concerns an anecdote about a conversation between the angel Gabriel and the Prophet. It may be taken from the <span class=\"italics\">RJ</span> or even the <span class=\"italics\">RJJ</span>.</p><p dir=\"auto\">I have not mapped the contents further, but it is potentially a very rich source for engagement with the <span class=\"italics\">RIS</span> and related materials<span class=\"italics\"> </span>by a late nineteenth century agent, that is Isḥāq b. al-Shaykh al-Fāḍil Sulaymānjī, and/or his teacher Muḥammad ʿAlī Hamdānī. The fairly extensive marginal commentary may be very useful for this as well.</p><p dir=\"auto\">This copyist’s intellectual activities may be gauged further as well through these other MSS he copied:</p><p dir=\"auto\">1416-7: first volume of <span class=\"italics\">Daʿāʾim al-islām,</span> copied<span class=\"italics\"> </span>in two volumes<span class=\"italics\"> </span>dated 1313/1895-6</p><p dir=\"auto\">1425-6: al-Qāḍī al-Nuʿmān’s <span class=\"italics\">al-Muntakhaba al-manẓūma</span> in two volumes<span class=\"italics\">,</span> copied between 1893 and 1895), explicitly noted as having been copied for Muḥammad ʿAlī b. Fayḍ Allāh [al-Hamdānī]</p><p dir=\"auto\">1445: al-Sijistānī’s <span class=\"italics\">al-Risāla al-bāhira fī al-maʿād.</span> Colophon in different hand notes copyist, but no date. François de Blois notes on the authority of Abbas Hamdani that the copyist was a student of Muḥammad ʿAlī Hamdānī.</p><p dir=\"auto\">1465: <span class=\"italics\">al-Majālis al-Muʾayyadiyya</span> by al-Shirāzī, second of eight volumes, dated 9 Rabīʿ II 1311/1893, explicitly stated to be copied for “his lord Muḥammad ʿAlī b. Fayḍ Allāh b. Ibrāhīm b. ʿAlī al-Hamdānī al-Masārī.”</p><p dir=\"auto\">Is it possible that this copyist is a descendant of Quṭbhāʾī Sulaymānjī Burhānpūrī (d. 1241/1826)? Cfr. Cortese <span class=\"italics\">Arabic Ismaili Manuscripts,</span> pp. 123-4. He wrote an important Dāʿūdī history of the Ismāʿīlī <span class=\"italics\">daʿwa</span></p>",
      "992": "<p dir=\"auto\">Nr. 46 in Cortese catalogue <span class=\"italics\">IIS Ismaili and Other Arabic Manuscripts</span>.<strong> </strong></p><p dir=\"auto\"><span class=\"italics\">al</span><strong>-</strong><span class=\"italics\">Risāla al-jāmiʿa</span> (first half); copied by <strong>Amīn b. ʿAlī al-Kātihyāwārī</strong> <span class=\"italics\">waṭn</span><span class=\"italics\">an</span><span class=\"italics\"> </span>al-Gādahkarwī; Thursday 1 Muḥarram 1338/25 September 1919. The manuscript was copied for the Madrasa al-Ḥakīmiyya in Būrhānpūr. Copy in rather cursive script. Manuscript is paginated, not foliated.</p><p dir=\"auto\">The text is attributed to “mawlānā ṣāḥib al-rasāʾil mujammiʿ al-faḍāʾil” imam Aḥmad [b ʿAbd Allāh b. Muḥammad b. Ismāʿīl b. Jaʿfar al-Sādiq] on page 2 following the work’s title which is rendered here and in the colophon as <span class=\"italics\">al-Risāla al-jāmiʿa dhāt al-fawāʾid al-nāfiʿa</span>.</p><p dir=\"auto\">تم النصف الاول من الرسالة الجامعة ذات الفوائد النافعة بحمد الله ومنه وصلواته على محمد واله ويتلوه النصف الثاني منها</p><p dir=\"auto\">قد قوع الفراغ من زبر هذه الرسالة النصف الاول من الرسالة الجامعة يوم الخميس الاول من شهر المحرم اول شهور سنة ١٣٣٨ هي المطابق للتاريخ الخامس والعشرين من شهر سپتمبر من سنة ١٩١٩ ع كتبه الاقل الراجي رحمه ربه الاجل امين ابن علي الكاتهياواري وطنا الگادهكروي مسكت ثبته الله تو على طاعته وعلى طاعته جميع حدود العلويين والسفليين الروحانيين و ع الجسمانيين بحق سيدنا محمد وآله والطاهرين امين يا رب العالمين في بلدة برهانپور للمدرسة الحكيمية للمدرسة الحكيمية الوقعة في بلد برهانپور من صلع غاژ حرسها الله تع بحق سيدنا محمد وآله الطاهرين صلوات الله عليهم اجمعين امين يا ري العالمين</p><p dir=\"auto\">This manuscript and MS 1009 were used for the edition of the text by Muṣṭafā Ghālib (Dār al-Andalus Beirut) as is evident from the reproduced folios included in the edition.</p><p dir=\"auto\">The Madrasa al-Ḥakīmiyya in Būrhānpūr is mentioned in T. Qutbuddin “The Da’udi Bohra Tayyibis: Ideology, Literature, Learning and Social Practice”, in Daftary, <span class=\"italics\">A Modern History of Ismāʿīlīs: Continuity and Change in a Muslim Community</span> 315. See also Christlle Brun, <span class=\"italics\">De la caste marchande gujarati à la communauté religieuse fatimide : construction identitaire et conflits chez les daoudi bohras (ouest de l’Inde)</span> (PhD Diss, Toulouse 2013), 172-3 about the conflict with the <span class=\"italics\">dāʿī.</span></p>",
      "1000": "<p dir=\"auto\">Nr. 49 in Cortese catalogue <span class=\"italics\">IIS Ismaili and Other Arabic Manuscripts</span>.<strong> </strong></p><p dir=\"auto\"><span class=\"italics\">Risālat jāmiʿat al-jāmiʿa (Masāʾil fī l-ḥaqāʾiq; Risālat majmūʿa min rasāʾil Ikhwān al-Ṣafāʾ</span>). The identification as <span class=\"italics\">Risālat jāmiʿat al-jāmiʿa</span> is only found at the end of the text, just before the colophon (p. 262 — this manuscript is paginated, not foliated): <span class=\"italics\">Tammat risālat jāmiʿat al-jāmiʿa al-ladhī hiya mukhtaṣar min rasāʾil Ikhwān al-ṣafā wa-khillān al-wafā dhawā al-sarāʾir wa-ahl al-baṣāʾir</span> (rendered as in the MS). In the incipit of the text, right after the basmallah it is called <span class=\"italics\">Risāla majmūʿa min rasāʾil Ikhwān al-Ṣafā wa-khillān al-wafā — ṣalawāt Allāh ʿalayhim ajmaʿīn — fī māhiyat al-mawt waʾl-ḥayyāt …</span></p><p dir=\"auto\">The start of the text is similar to the published edition by ʿĀrif Tāmir, which was based on three Syrian manuscripts, and is also found in the 1349/1930 Salamiyya manuscript partly reproduced by Mourad Kacimi in his article “Reflexiones sobre la relación de la Risalat Gami'at al-gami’a.”</p><p dir=\"auto\">The present manuscript is most definitely of Syrian origin as well. It was copied by the shaykh <strong>ʿAbd Allāh b. al-shaykh Muḥammad Ḥamdūsh</strong>, on a Friday at the end of 1271/1854. This same Ḥamdūsh is attested as one of two copyists of a copy of <span class=\"italics\">al-</span><span class=\"italics\">al-Risāla al-Jāmiʿa</span><span class=\"italics\"> </span>now held in Maktabat al-Assad in Damascus (MS 9900, dated to 1280/1863-4, copied by ’Abd Allāh Ḥamdūsh and Maḥmūd ʿAlī Sulaymān). The handwriting of these two MSS appears fairly similar to Gowaart, although 1000 is generally speaking cleaner and the handwriting more regular.</p><p dir=\"auto\">This copy was owned by Muṣṭafā Ghālib in Salamiyya (nr. 14 in his personal library). Before that it was owned by a certain ʿAlī Aḥmad Raṣīṣa (or maybe Ruṣayṣa?).</p>",
      "1004": "<p dir=\"auto\">Nr. 47 in Cortese catalogue <span class=\"italics\">IIS Ismaili and Other Arabic Manuscripts</span>.<strong> </strong></p><p dir=\"auto\"><span class=\"italics\">al</span><strong>-</strong><span class=\"italics\">Risāla al-jāmiʿa.</span> Copied by <strong>Ḥusayn b. Mullā Muḥammad ʿAlī al-Burhānpūrī,</strong> in Burhānpūr, copied for his sister Kulthūmbāʾī, wife of Ṭāhirbhāʾī al-Kinkhwābwālā in Sūrat; 1 Muḥarram 1378/17 July 1958.</p><p dir=\"auto\">This MS has a great similarity to MS 992. It is likely a direct copy of that MS, as even the colophon is nearly identical except for the change of dates, names and patrons. The author and title designations at the start of the text are also identical.</p><p dir=\"auto\">The colophon of this manuscript runs as follows:</p><p dir=\"auto\">تم النصف الاول من الرسالة الجامعة ذات الفوائد النافعة بحمد الله ومنه وصلواته على محمد واله ويتلوه النصف الثاني منها -</p><p dir=\"auto\">قد قوع الفراغ من زبر هذا النصف الاول من الرسالة الجامعة يوم الخميس الاول من شهر الحرام المحرم اول شهور سنة ١٣٧٨ هجرية المطابق للتاريخ الخمسة السبعة العشرة من شهر جولائى من سنة ١٩٥٨ -</p><p dir=\"auto\">كتبه الاقل الراجي رحمه ربه الاجل سلام حسين ابن المرحوم الماجد ملا محمد على المعروف بالبرهان پورى ثبته الله تو على طاعته وعلى طاعته جميع حدود العلويين والسفلين الروحانيين والجسمانيين بحق سيدنا محمد وآله والطاهرين امين يا رب العالمين في بلدة برهان پور للاخت الشريفة الممسماة كلثوم بائى الزوجة الرئيس الطاهر بهائى المعروف بالكمخواب والا وبلدة سورت حرسها الله تع بحق محمد وآله الطاهرين صلوات الله عليهم اجمعين</p><p dir=\"auto\">=> The same copyist is recorded in:</p><p dir=\"auto\">MS 1113, 28 Ṣafar 1355/1936, in Burhānpūr</p><p dir=\"auto\">MS 1136, 11 Rabīʿ II 1359/1940</p><p dir=\"auto\">MS 1210, dated to Dhu’l-Ḥijja 1355/1937, also in Burhānpūr (here he appears to have copied his own father’s copy)</p><p dir=\"auto\">MS 1244, dated to Dhu’l-Ḥijja 1355/1937, also in Burhānpūr (here he appears to have copied his own father’s copy) (identical info for both these MSS!)</p><p dir=\"auto\">MS 1292, dated to 6 Rabīʿ II 1356/1937, also in Burhānpūr (a <span class=\"italics\">risāla</span> with various Ṭayyibī contents)</p>",
      "1009": "<p dir=\"auto\">Nr. 48 in Cortese catalogue <span class=\"italics\">IIS Ismaili and Other Arabic Manuscripts</span>.<strong> </strong></p><p dir=\"auto\"><span class=\"italics\">al-Risāla al-Jāmiʿa</span>; first quarter of 14th/20th C => this is the second volume of a two-volume set of which the first volume is IIS Special Collections Unit MS 992. The colophon of the present manuscript is largely lost due to the loss of 4 folios (the manuscript’s pagination jumps from 378 to 387), but the layout and script are highly similar and what is preserved from the colophon of MS 1009 is very similar to the final part of the colophon of MS 992. The author and title identification of the work are also formulated identical to MS 992. Additionally, Muṣṭafā Ghālib paraphrases identical information for the colophon of this volume as for that of vol. 1. This would indicate either that the colophon was still whole when Ghālib studied the manuscript in the late 1960s, or that Ghālib simply assumed the colophon would be identical to that of vol. 1.</p>",
      "1033": "<p dir=\"auto\">Nr. 155 in Cortese catalogue <span class=\"italics\">IIS Ismaili and Other Arabic Manuscripts</span>.<strong> </strong></p><p dir=\"auto\">Extract in majmū'a (<span class=\"italics\">Risāla majmūʿa min zubd Ikhwān al-Ṣafāʾ</span>), possibly a Syrian Ismaili production? One dated part (fol. 31v) to 15 Kanun al-awwal 1210/1795.</p>",
      "1040": "<p dir=\"auto\">Nr. 44 in Cortese catalogue <span class=\"italics\">IIS Ismaili and Other Arabic Manuscripts</span>.<strong> </strong></p><p dir=\"auto\">First half + part of second half; copied Shaʿbān 953/October 1546 by al-Ḥasan b. al-Nuʿmānī al-Ismāʿīlī, probably in Iran.</p><p dir=\"auto\">For an extensive description of the MS, see Ali-de-Unzaga, “The Missing Link”: <a href=\"https://www.academia.edu/81304596/The_Missing_Link_MS_1040_An_Important_Copy_of_the_Rasāʾil_Ikhwān_al_Ṣafāʾ_in_the_Collection_of_The_Institute_of_Ismaili_Studies?f_ri=50510\" target=\"_blank\">https://www.academia.edu/81304596/The_Missing_Link_MS_1040_An_Important_Copy_of_the_Rasāʾil_Ikhwān_al_Ṣafāʾ_in_the_Collection_of_The_Institute_of_Ismaili_Studies?f_ri=50510</a> )</p><p dir=\"auto\">Not mentioned by Ali-de-Unzaga is that this MS was bought from Christies:</p><p dir=\"auto\"><strong>Christies -</strong> 1997 Live auction 5861 - Lot 84.</p><p dir=\"auto\">Lot description :</p><p dir=\"auto\">Probably Persia, AH Sha'ban 953/October 1546 AD</p><p dir=\"auto\">An encyclopaedia of scholastic thought in four parts, Arabic manuscript on paper, 739ff. with 21ll. of neat black <span class=\"italics\">naskh</span>, overlining, occasional words and diagrams in red, opening bifolio within gold clouds, opening illuminated title page, other titles in white <span class=\"italics\">naskh</span> on gold panels within illuminated spandrels, folio 406 with colophon dated Sha'ban 953 and signed al-Hasan b. 'Ali al-Nu'mani al-Isma'ili, considerable worming, some folios lacking, folios loose, light staining, in later red morocco binding</p><p dir=\"auto\">Folio 12 x 7½in. (30 x 19cm.)</p>",
      "ZhidAli1163": "<p dir=\"auto\"><span class=\"italics\">Majmūʿ al-tarbiyya,</span> by Muḥammad b. Ṭāhir b. Ibrāhīm al-Ḥārithī (d. 584/1188), an anthology containing extracts from the <span class=\"italics\">Rasāʾil</span>; copied in 1294/1877 by Faḍl ʿAlī b. Mullā Muḥsin ʿAlī b. Murād ʿAlī — this is a bit of an uncertain case, considering the “authorial” layer to the compilation.</p>",
      "ZhidAli1277": "<p dir=\"auto\">Vol. 1 and about 1/5 of vol. 2 of <span class=\"italics\">al-Risāla al-jāmiʿa.</span> This is unique in the IIS collection for being a codex that originally contained both halves of the <span class=\"italics\">RJ.</span> The text is explicitly announced on page 2 (the manuscript is paginated, not foliated) and on the flyleaf as <span class=\"italics\">al-Risāla al-jāmiʿa dhāt al-fawāʾid al-nāfiʿa,</span> which conforms to what we see in the preceding copies,<span class=\"italics\"> </span>but notably no author is named. Unlike MSS 992, 1004 and 1009, the manuscript itself states that it consists of six parts instead of the usual two, subdivided in <span class=\"italics\">rasāʾil.</span> There is a colophon on p. 260 which announces the end of vols. 1, 2, and 3, which is followed by (presumably) vol. 4, but explicitly noted as <span class=\"italics\">risāla</span> 13. The start of this <span class=\"italics\">risāla</span> conforms to the start of vol. 2 in Ghālib’s edition. The text is acephalous and ends in the 37th <span class=\"italics\">faṣl</span> of Ghālib’s edition (p. 342 in the edition).</p><p dir=\"auto\">Delia Cortese suggests the manuscript was composed mid 13th/19th C just like MS 1264 with which she pairs it. However, the lay-out and handwriting are very different from MS 1264, not to mention the fact this manuscript likely would have constituted the full <span class=\"italics\">RJ</span> in its original state and thus overlaps significantly with the beginning of MS 1264. The handwriting of this copy is rather curly and idiosyncratic, with a notable tendency to elongate final letters of words (a similar tendency is seen in MS 1483, although they are unrelated copies otherwise).</p><p dir=\"auto\">The flyleaf of this MS contains what appears to be a commentary note on the text, and the margins also contain several notes. The final flyleaf also contains notes: page 308 contains schematisations of some of the text’s core elements and page 309 a list of “ḥaqāʾiq”, with what appear to be page numbers. A combination of all these notes could thus be used to study how a later agent (perhaps Zāhid ʿAlī himself?) studied the <span class=\"italics\">RJ</span>.</p>",
      "ZhidAli1264": "<p dir=\"auto\">Vol. 2 (<span class=\"italics\">al-niṣf al-thānī) </span>of <span class=\"italics\">al-Risāla al-jāmiʿa.</span> Title written only in that shortened form, no author attribution. written during time of ʿAbd al-Qādir Najm al-Dīn (d. 1885), Cortese suggests mid 13th/19th C. The copyist is Ismāʿīl b. Mullā Khānbhāʾī. The ending formula in the colophon after the scribe’s name is very similar to that used in MSS 992 and 1004 of the IIS collection (MS 1004 is a direct copy of MS 992), so this manuscript may be the source from which MS 1009 was copied.</p><p dir=\"auto\">Delia Cortese groups this manuscript together with MS 1277 as two halves of the same text, but this is surely incorrect (see also description of MS 1277): they have different layout and handwriting and furthermore overlap for several folios. One may however be a partial copy of the other. If so, I would suggest that 1264 is copied from 1277, of which the handwriting strikes me as older, and that the first volume of 1264 has been lost.</p>",
      "ZhidAli1310": "<p dir=\"auto\"><span class=\"italics\">Risālat jāmiʿa al-jāmiʿa.</span><strong> </strong>copyist Ḥasan ʿAlī Afḍal al-Murād, written at college at the time of ʿAbd al-Qādir Najm al-Dīn [47th Dawudi Bohra da’i, 1814-1885]; <span class=\"italics\">ʿīd al-fiṭr</span> 1275/1858.</p><p dir=\"auto\">Identified as a copy of <span class=\"italics\">Risālat Jāmiʿat al-Jāmiʿa</span> by Delia Cortese. There is no title page, but there is a note on folio 1a that reads “hādhā kitāb [jāmiʿat?] al-jāmiʿa.” This does not appear to be the same handwriting as that of the manuscript’s copyist, so it would be a later attribution. The text starts without <span class=\"italics\">muqaddima</span>, after the basmala the first words are “faṣl fī maʿrifat Ādam al-kullī wa-zawjatuhu.” The published edition of <span class=\"italics\">RJJ</span> starts completely differently, but MS 914 starts and ends similarly to MS 1310.<strong> </strong>Closer study is thus called for to establish whether or not this is indeed a version of the <span class=\"italics\">RJJ</span>. For sure, the text is related to the <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span> corpus — note for example the division if knowledge in four types of sciences following the <span class=\"italics\">aqsām</span> of the <span class=\"italics\">Rasāʾil</span> on folio 81b where repeated mention is also made of brethren<span class=\"italics\">.</span></p><p dir=\"auto\">Some folios have preserved a <span class=\"italics\">misṭara</span>. Text is written carefully and in rather distinctive handwriting. There are some marginal notes indicate contents and possibly some comments, written in different handwriting than the main text, mostly in the first half of the manuscript. On 39a one of these comments appears to be in Persian and refers to the fourth volume (<span class=\"italics\">jild-i chuhāram) </span>of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ,</span> perhaps<span class=\"italics\"> </span>indicating that this reader compared information between the two texts. The comment is inserted next to a rubrication for the section on <span class=\"italics\">al-adwār wa’l-akwār</span> (this usually corresponds in fact to the fifth <span class=\"italics\">risāla</span> of the third <span class=\"italics\">qism</span> of the <span class=\"italics\">Rasāʾil</span>). This is notable because otherwise those parts of the IIS collection that were produced in South Asia contain predominantly copies of the <span class=\"italics\">RJ</span> and <span class=\"italics\">RJJ,</span> but only one incomplete copy of the <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span> (MS 1482).</p><p dir=\"auto\">The copyist of this manuscript is <strong>Ḥasan ʿAlī Afḍal al-Murād</strong> (he utilises a rather distinctive signature), written at college (<span class=\"italics\">katabahu fî darsihi</span>) at the time of the 47th Dawudi Borha <span class=\"italics\">dāʾī</span> ʿAbd al-Qādir Najm al-Dīn (1814-1885) on <span class=\"italics\">ʿīd al-fiṭr</span> 1275/1858. There are other manuscripts copied by a copyist with the similar name Murād ʿAlī b. Mullā Afḍal ʿAlī (MSS 1201, 1219, dated 1271/1854; he is also attested MSS 1148, 1218 and 1179, which are dated 1850 and 1848), from which the handwriting might be compared to ascertain. It would be especially interesting to compare these and see whether they too might have been written “in class”, by which we might get some idea of a textual curriculum in the mid-19th century Dawudi Bohra community.</p>",
      "Hamdani1482": "<p dir=\"auto\">Incomplete copy of the 4th section (de Blois describes its condition as “disordered leaves”) of the <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ.</span> Dated 18 Jum I 1126/1714, copyist Ādam b. Mullā Najm Khān b. Aḥmad</p><p dir=\"auto\">Many marginal notes, mostly corrections but some may be commentary. Red punctuation and rubrication (mostly for <span class=\"italics\">faṣl</span> and <span class=\"italics\">iʿlam</span>), titles of epistles in visually distinctive red headers. Manuscript foliation is very confusing: it goes up to 180, then starts again at 1a, and then reverts to 181 again. To avoid confusion I use r and v to denote recto and verso of folio in this description.</p><p dir=\"auto\">As François de Blois notes, the manuscript has been scrambled in the past (judging by the way the folio numbers are written I would guess it was done not very long ago - the numerals look very modern). As it is currently assembled the manuscript starts in the fourth <span class=\"italics\">faṣl</span> of the final epistle on Magic as published in the Calcutta-Cairo-Beirut edition. By cross-checking phrases of text from the manuscript with the digital edition (digitised by the Hindawi foundation, included in the OpenITI corpus) I was able to assess that the manuscript contains six full <span class=\"italics\">rasāʾil</span> of the fourth <span class=\"italics\">qism</span> (4.6-4.11) as well as the final section of risāla 4.5.</p><p dir=\"auto\">The manuscript can be re-assembled in what must have been its original order as follows. Note that my assessment of this differs somewhat from de Blois’ assessment:</p><p dir=\"auto\"><strong>181-214</strong>: the final section of risāla 4.5 until first half of 4.7 (catchword <span class=\"italics\">hādhā</span>) - this also bears a note in purple ink that it is the start of the preserved MS. The incorrect assembly thus must have taken place after this note was written.</p><p dir=\"auto\"><strong>100-32a</strong>: second half of 4.7 until first half of 4.11 (catchword <span class=\"italics\">wa-ʿal..</span>)</p><p dir=\"auto\"><strong>1-99</strong>: second half of 4.11 (starts with <span class=\"italics\">wa-ʿallamū</span>), directly following onto folio 32a verso (catchword <span class=\"italics\">hādhā</span>)</p><p dir=\"auto\"><strong>215:-228</strong>: final section of 4.11 (starts again with <span class=\"italics\">hādhā</span>) going up to the end with colophon</p><p dir=\"auto\">More details on how the text maps onto the edition:</p><p dir=\"auto\">MS starts in medias res of 4.11</p><p dir=\"auto\">folio 1r = ms1366 of OpenITI version (Hindawi)</p><p dir=\"auto\">11r = ms1376</p><p dir=\"auto\">39v = ms1404, the two inserted folios right after this follow the edition => these two inserted folios on different paper are clearly a correction of originally partially omitted material, as evidenced by 2/3 of folio 42a being crossed out. The handwriting appears identical to the main text, so it’s a correction done after collating the text.</p><p dir=\"auto\">83v = faṣl 69 (ms 1444)</p><p dir=\"auto\">89r-90r = three pages crossed out which do not appear in the edition (compare ms1450, sections on al-samak and al-ghafr)</p><p dir=\"auto\">95v: gap of a few lines but information maps perfectly onto the edition (paragraph break) ms1456</p><p dir=\"auto\">At 100r a mistaken catchword identification (<span class=\"italics\">hadhā</span>) has led to a mix-up, this folio is part of <span class=\"italics\">risālā</span> 4.7 = ms1228</p><p dir=\"auto\">101v to 102r seems to be a mistake but in fact follows the edition nicely, the rubrication is to be inserted in the final lineof 101b = compare ms1230</p><p dir=\"auto\">105v = ms1233</p><p dir=\"auto\">125v: fasl here does not follow the edition here, straight to fasl 20 instead of 17, continues onwards to fasl 21 on 128b</p><p dir=\"auto\">129v: fasl 17 starts here but unannounced, simply rubricated as <span class=\"italics\">iʿlam.</span> The fact that this happens in the middle of the page shows that this is not a mix-up but a variation in ordering of materials.</p><p dir=\"auto\">131r: fasl 18, 132r: fasl 19</p><p dir=\"auto\">134r: clearly titled risāla 4.8</p><p dir=\"auto\">142r: <span class=\"italics\">faṣl</span> where edition has <span class=\"italics\">iʿlam</span></p><p dir=\"auto\">145r: <span class=\"italics\">iʿlam</span> where edition has <span class=\"italics\">faṣl</span></p><p dir=\"auto\">168v: <span class=\"italics\">iʿlam</span> where edition has <span class=\"italics\">faṣl</span></p><p dir=\"auto\">170 and 171 are again corrections, filling in parts that had been left out => 172a most of the page crossed out</p><p dir=\"auto\">172v: clearly titled risāla 4.9 = appears to be included more or less in full in the same order as in edition</p><p dir=\"auto\">11a verso: clearly titled risāla 4.10</p><p dir=\"auto\">13a recto: first <span class=\"italics\">faṣl</span> corresponds to second <span class=\"italics\">faṣl</span> in edition, after that continues as in the edition, so our manuscript omits this first <span class=\"italics\">faṣl</span></p><p dir=\"auto\">18a recto:<strong> </strong>clearly titled risāla 4.11: starts at ms1352 in the OpenITI/Hindawi edition, i.e. this is the long recension of the Epistle on Magic, the short recension is entirely omitted.</p><p dir=\"auto\">31a recto <span class=\"italics\">faṣl = faṣl</span> 4 on ms1365</p><p dir=\"auto\">181r: note on the top that this is fourth qism and that it starts at the 7th risāla of the fourth qism. This is incorrect if we compare to the edition (which the manuscript elsewhere largely follows). The <span class=\"italics\">faṣl</span> on 181r corresponds to the final section of risāla 4.5 and the preceding lines to the text immediately preceding that <span class=\"italics\">faṣl</span> (ms1199-ms1200 in OpenITI)</p><p dir=\"auto\">185r: clearly titled risāla 4.6 = follows the order of the edition perfectly</p><p dir=\"auto\">202v: clearly titled risāla 4.7</p><p dir=\"auto\">215r: the culprit catchword <span class=\"italics\">hādhā</span>! This does not follow on to 214v, here 100r needs to follow, this matches with the edition as well (compare ms1228: <span class=\"italics\">waʾl-baḥth ʿan taḥqīq // hādhā al-amr waʾl-taṣawwur</span>)</p><p dir=\"auto\">216r: follows directly onto 99v, <span class=\"italics\">bi-quwwat // hādhā al-arwāḥ al-rūḥāniyya,</span> so this is continuation of 4.11 all the way to the end of the epistle</p><p dir=\"auto\">The manuscript is dated 18 Jumādā I 1126/1714, copyist <strong>Ādam b. Mullā Najm Khān b. Aḥmad</strong>. This date predates the emigration of Ali b. Saʿīd al-Yaʿburī al-Hamdānī (d. 1798) from Yemen to India (mid-18th century). Given that we know he took his manuscript collection to India and that this collection forms the core of the Hamdani collection, much of which is now at IIS, the manuscript was likely copied in Yemen (F. de Blois, <span class=\"italics\">Arabic, Persian and Gujarati Manuscripts,</span> xiv). The same copyist is attested in MS 1429: a copy of al-Qāḍī al-Nuʿmān’s <span class=\"italics\">Mukhtaṣar al-āthār,</span> dated 22 Jumādā I 1128/1716 (perhaps 1138 — unfortunately no location is provided here either).</p><p dir=\"auto\">The colophon:</p><p dir=\"auto\">تم كتاب</p><p dir=\"auto\">اخوان الصفا وخلان الوفا * والحمد لله رب العالمين *</p><p dir=\"auto\">بخط الفقير الحقير الصغير عبيد ادم بن ملا نجم خان بن احمد</p><p dir=\"auto\">محتاج الى الله الغني الكريم غفر الله له ولوالديها</p><p dir=\"auto\">ولقاريه ولجميع المؤمنين والمؤمنات انه ولي ذلك</p><p dir=\"auto\">والقادر عليه سنة ١١٨٦ الف ومائة وخمس سادس العشرين</p><p dir=\"auto\">من شهر جماد الاول في اليوم الثامن عشر والخمس</p><p dir=\"auto\">Marginal colophon:</p><p dir=\"auto\">المكتوب في يوم الخميس ١٨ ه سنة ١١٢٦ ه</p><p dir=\"auto\">بخط ادم بن ملا نجم حان بن احمد ( غفر الله منهم )</p>",
      "Hamdani1483": "<p dir=\"auto\"><span class=\"italics\">al-Risāla al-Jāmiʿa</span><span class=\"italics\">,</span> second half only. Signature of Fayḍ Allah b. Muḥammad ʿAlī al-Hamdānī (d. 1969)</p><p dir=\"auto\">Second half <span class=\"italics\">(niṣf</span>) of<strong> </strong><span class=\"italics\">al-Risāla al-jāmiʿa.</span> This MS appears to be produced independently of the other copies in the collection. The title is noted only in its short form on the flyleaf and at the incipit, but in much longer form in the colophon: <span class=\"italics\">al-Risāla al-jāmiʿa dhāt al-fawāʾid al-nāfiʿa waʾl-ḥujaj al-qāṭiʿa waʾl-barāhīn al-lāmiʿa wa-tāj Rasāʾil Ikhwān al-ṣafā wa-khillān al-wafā</span> (spelling rendered as in the MS). No author is noted. Nor does the colophon mention a location, date or copyist.</p><p dir=\"auto\">Extensive description by de Blois. Hiis evaluation that the manuscript was copied by two scribes is correct. There are only few marginal notes, except the name of Fayḍ Allāh Hamdani as noted by de Blois, as well as the seal on the final page — which the scan provided to me does not fully reproduce, however. De Blois does not suggest a date for the manuscript and I am unsure where to date it myself. Comparing it to other MSS of the same text in the collection I would very carefully suggest it to be from the 19th century as well, but this remains to be ascertained</p>",
      "Hamdani1484": "<p dir=\"auto\"><span class=\"italics\">Jāmiʿat</span><span class=\"italics\"> </span><span class=\"italics\">al-jāmiʿa, </span>according to de Blois entirely different from the version published by Tāmir apparently, and does not appear to be directly related to the <span class=\"italics\">Rasāʾil.</span> However, as noted above, MSS 914 and MS 1310 are also highly divergent from the published edition, so MS 1484 may very well belong to the same South Asian tradition of the <span class=\"italics\">RJJ</span> which diverges from the Syrian tradition. Naturally, this remains to be ascertained.</p>",
      "Hamdani1541": "<p dir=\"auto\">Brief extract of Rasāʾil ikhwān al-ṣafāʾ in <span class=\"italics\">majmūʿa</span></p>",
      "Hamdani1662": "<p dir=\"auto\">Extracts of Rasāʾil ikhwān al-ṣafāʾ in <span class=\"italics\">majmūʿa</span></p>"
    },
    "Royal Asiatic Society Library": {
      "Persian184": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span> (acephalous)</p>"
    },
    "SOAS Library": {
      "ms45812": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-Ṣafāʾ</span>. 11th/17th century according to Adam Gacek catalogue (very little info in catalogue)</p><p dir=\"auto\">Gowaart’s notes from consulting the manuscript:</p><p dir=\"auto\">Appears to be a full copy. Preceded by some flyleaves with (Persian?) poetry. Neatly written, 33 lines per page. Red rubrication. Quranic citations overlined. Individual Rasa’il clearly titled. Colophons undated. Has a seal (see picture)</p><p dir=\"auto\">No title page, starts with fihrist, then 1.1.</p><p dir=\"auto\">11b-12a: scientific illustrations missing.</p><p dir=\"auto\">259a: start of risala on magic, ends on 272a - this appears to be a case of the short and (most of the) long recension of this risala being consecutively reproduced (if not in their entirety)</p><p dir=\"auto\">Then followed by material that does not appear to have a direct match, needs further study (272a-276b).</p>"
    }
  },
  "Los Angeles": {
    "UCLA": {
      "CaroMinasianCollectionbox120940": "<p dir=\"auto\">Majmūʿa containing “min rasāʾil ikhwān al-ṣafāʾ” mostly on physics (natural bodies, stars, etc.), but also on music.</p><p dir=\"auto\"><strong>Abstract</strong>: DP 700f. This is a very messy volume, with script written diagonally, parallel, mixed-up. Various Arabic & Persian fragments. In listing the individual works, I'm following DP's account. Apparently all contents by one hand. Detached from binding.</p>",
      "CaroMinasianCollectionbox122976": "<p dir=\"auto\">Majmūʿa ‘12th century AH (17th-18th century),</p><p dir=\"auto\"><strong>Abstract</strong>\nDP 703. All in the same, beautiful script. Fihrist on title page lists several texts, but Dānish-pazhūh, only identifies three major works.</p>",
      "Unknownnumber15187?": "<p dir=\"auto\">Manuscript found online through ketabpedia with a possible link to Samuel Stern. Needs further study.</p>",
      "M77": "<p dir=\"auto\">Persian translation, 9th or 10th C (classified as Rasāʾil ikhwān al-Ṣafāʾ in catalogue). Ownership notes:</p><p dir=\"auto\">ʿAlāʾ al-Dīn Ḥusayn b. Rafīʿ al-Dīn Muḥammad b. Shujāʿ al-Dīn Maḥmūd Ḥusaynī, dated to 1019.</p><p dir=\"auto\">ʿAlī b. Muḥammad Khalwatī Ghafārī</p>",
      "M556": "<p dir=\"auto\">Mujmal al-ḥikma, 11th/17th C, nasta’liq</p>",
      "M1434": "<p dir=\"auto\">Mujmal al-ḥikma, copyist (?) Abū Turāb Ḥusaynī Mūsawī 1st month (?) of 1246/1830, apparently requested by Muḥammad Reza Khan.</p>"
    }
  },
  "Medina": {
    "ʿĀrif Ḥikmet Library": {
      "2663": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span> in majmūʿa (?).</p>"
    }
  },
  "Madras": {
    "Oriental Manuscripts Library": {
      "150": "<p dir=\"auto\">Risālat (?) ikhwān al-ṣafāʾ, apparently a full copy,<strong> </strong>authorship Ibn al-Jaladī</p>",
      "151": "<p dir=\"auto\">Risālat (?) ikhwān al-ṣafāʾ, apparently a full copy,<strong> </strong>authorship Ibn al-Jaladī</p>",
      "478": "<p dir=\"auto\">Mujmal al-ḥikma, apparently a full copy</p>",
      "879": "<p dir=\"auto\">Mujmal al-ḥikma, apparently a full copy<strong> </strong></p>"
    }
  },
  "Madrid": {
    "Escorial": {
      "Derenbourg900Casiri895": "<p dir=\"auto\">“min rasāʾil ikhwān al-Ṣafāʾ wa-khillān al-wafāʾ liʾl-..ma al-Majrīṭī [fī takwīn al-ḥayawān”, only risāla 22 (2.8) on animals</p><p dir=\"auto\">Copying date is pre-942/1535-6 based on consultation note on title page: “read it and looked into it the poor servant ʿAlāʾ al-Dīn al-Nāsikh … known as … wrote it 19 Dhū al-… year 942 (?)”</p><p dir=\"auto\">End has reading note by a certain Shaʿbān b. … al-Rūmī dated 965. Could do with clearer scan.</p>",
      "Derenbourg928Casiri923": "<p dir=\"auto\">first tome of two, 22 first rasāʾil, attributed in a different hand to Maslama al-Majrīṭī (dated Dhū l-Ḥijjā 862/ October-Nov 1458), attributed in a different hand to “Maslama b. Amīr al-ʿArab min ḥukamāʾ al-islām kāna bi-Qurṭuba fī zaman Khālid b. Yazīd b. Muʿāwiyya”, Maghrebi script</p>",
      "Derenbourg942Casiri937": "<p dir=\"auto\">Brief extract in <span class=\"italics\">majmūʿa</span>: first some “opuscules” of al-Ghazālī (2a-33b) then — according to catalogue — material from epistles 2.1. (=14) (34b-39a) and 3.10 (40 or 41) (40a-47b)/. Colophon possibly followed by note about Sufism? Dated 9 Jumādā I 742/1341, Maghrebi script.</p>"
    }
  },
  "Manchester": {
    "John Rylands Library": {
      "Or376": "<p dir=\"auto\">first qism, but disordered. Indian Nasta’liq of about 1750AD,</p>",
      "Or377": "<p dir=\"auto\">second qism, “careless Indian nasta’liq of about 1780AD”</p><p dir=\"auto\">=> these may be the two volumes noted as 464 and 465 in Bibliothetca Lindesiana Haig Hall collection (if not, they moved to British Library):</p><p dir=\"auto\">461, 465.- IXWÁNU S SAFÁ. Risa’il. Treatises of the \" Brothers of Purity\"</p><p dir=\"auto\">Sections 1 and 2 only (out of 4).</p><p dir=\"auto\">280 x 155 mm. and 220 x 150 mm. About 1760.</p>",
      "Gasterar174": "<p dir=\"auto\">Geniza fragment: note or folio from the epistle on animals, from the Rasāʾil Ikhwān al-Ṣafāʾ.</p><p dir=\"auto\">\"رسالة الحيوان من رسايل اخوان الصفا وخلان الوفا من كلام الحكمة و [ ] النفس واصلاح الاخلاق من جملة اثنين وخمسين ..\"</p>",
      "PersianMS457": "<p dir=\"auto\"><span class=\"italics\">Jung-i Kalām-i Isti‘mālī</span> (Anthology of Customary Sayings): “encyclopedic anthology” composed by Muḥammad Saʿīd for Quṭb Shāhī ruler, includes selections from <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span>.</p><p dir=\"auto\">Cfr. extensive description on Fihrist.</p>"
    }
  },
  "Manisa": {
    "Kitapsaray (?)": {
      "17052": "<p dir=\"auto\">Risāla on Geography. Second risāla in <span class=\"italics\">majmūʿa</span>, 7th C, folios 9a-15a. Data from Ramzan Sesen “mukhtārāt”</p>",
      "2760": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-</span><span class=\"italics\">ḥikma</span><span class=\"italics\">,</span> 133 folios, 7th C.</p>"
    }
  },
  "Mashhad": {
    "Dānishgāh-i IIllāhiyāt (Ferdowsi)": {
      "203": "<p dir=\"auto\">Other call numbers: (= Mawlawī 2030 = 239)</p><p dir=\"auto\">Partial copy (13 epistles from first qism). 8th/14th or 9th/15th C.</p><p dir=\"auto\">141 folios, 22 lines (20,5x13cm), 23,5x17cm.</p><p dir=\"auto\">Flyleaf bears notes attributing to Tawhidi group. Fihrist added later, it is followed by an actual title page, bearing a faded title and a clearer table of contents. Also a note about the Mongol capture of Baghdad attributed to al-Ṭūsī. + note about “the epistles of the Brethren of Purity are many, but the Brethren of Purity are few”</p><p dir=\"auto\">Partially visible online (where it is listed with call number 239).</p>",
      "429": "<p dir=\"auto\">(Call number maybe 490?):<strong> </strong>Persian translation, dated to Muḥarram 937/September 1530. According to online catalogue (where it is filed as <span class=\"italics\">Mujmal al-ḥikma</span>) it is <span class=\"italics\">Muntakhab Rasāʾil ikhwān al-Ṣafāʾ</span> and it was made on the order of Bahāʾ al-Dīn Sayf al-Dawla Shujāʿ al-Mulk Muḥammad b. Biktāsh (founder of Bektashi order). Compare Tehran Malek 457 for the Bektashi link.</p><p dir=\"auto\">Partially visible online (where it is listed with call number 490), unfortunately not the title page.</p>",
      "14761": "<p dir=\"auto\">(Call number maybe 911?) <strong>-</strong> Partial copy of <span class=\"italics\">Rasāʾil</span>, qism 1 & 2. Dated to 1080/1669-70. Attributed to imām Aḥmad. Illuminated titles. Seal of “Dāʿī imām al-mutaqīn Hibat Allāh Jamāl al-Dīn b. Sayyid ʿAbdallāh b. Shaykh Ādam Ṣafī al-Dīn” (= 40th Dawoodi Bohra <span class=\"italics\">dāʿī.</span> <a href=\"https://en.wikipedia.org/wiki/Hebatullah-il-Moayed_Fiddeen\" target=\"_blank\">https://en.wikipedia.org/wiki/Hebatullah-il-Moayed_Fiddeen</a> )</p><p dir=\"auto\">375 folios, 25 lines per page (19x10cm), size 30x19cm.</p><p dir=\"auto\">Partially visible online (where it is listed with call number 911).</p>"
    },
    "Goharshād Mosque": {
      "256": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>. 13th/19th C. Seal of Ḥājj Sayyid Saʿīd.</p>",
      "1742": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>. 2 Ramaḍān 1038/18 May 1629.</p><p dir=\"auto\">Wāqif: Sayyid Saʿīd Ṭabātabāʾī in year 1332/1913-14.</p>"
    },
    "Astan Quds Razavi": {
      "402": "<p dir=\"auto\">Persian translation, <span class=\"italics\">khulāṣat rasāʾil ikhwān al-Ṣafāʾ?</span> Translator Aḥmad Hindī? Waqf in Kitabkhāna-yi gharb-i Hamadān. 21 lines per page.</p>",
      "526": "<p dir=\"auto\">Full copy of<strong> </strong>Rasāʾil ikhwān al-ṣafāʾ, 51 epistles. Copyist Aḥmad b. Muḥammad ʿAlī Iṣfahānī, 1238/1822-3, collated in 1241. Appears to be a very nice copy, with illuminated titles. Nāʾīnī waqf.</p><p dir=\"auto\">447 folios, 27 lines per page, 30x18cm.</p>",
      "527": "<p dir=\"auto\">Full copy of<strong> </strong>Rasāʾil ikhwān al-ṣafāʾ. Includes fihrist, 51 epistles. Naskh. Copyist ʿAbdallāh Baḥrānī, 1097/1685-6. Waqf of “Nāʾīnī”. 431 folios, 19 lines per page, 27x19cm.</p>",
      "528": "<p dir=\"auto\">Partial copy: 13 epistles of Qism 1, 2 of Qism 3. Copyist Rajab ʿAlī b. ʿAbdallāh Iṣfahānī, 1265/1848-9. Copied for Qahar prince Shahzādeh Imamqoli Mīrzā, ruler of Kermanshāh (r. 1268-92). On this prince, see: <a href=\"http://azadamirkhizi.blogfa.com/post/2284\" target=\"_blank\">http://azadamirkhizi.blogfa.com/post/2284</a></p><p dir=\"auto\">+ A manuscript linked to him: <a href=\"https://ketabpedia.com/تحميل/دیباچه-بیاض-نواب-شاهزاده-امامقلی-میرز/\" target=\"_blank\">https://ketabpedia.com/تحميل/دیباچه-بیاض-نواب-شاهزاده-امامقلی-میرز/</a></p>",
      "529": "<p dir=\"auto\">8 rasāʾil from the second qism (2.8-2.17), of which the seventeenth differs from printed version. Waqf “Fihristī”. 111 folios, 19 lines per page, size 25x13cm.</p><p dir=\"auto\">آغاز: اعلم ايها الاخ البار الرحيم الكريم ايدك االله ايانا بروح منه ان علم الناس؛</p><p dir=\"auto\">انجام: ثم اوردنا ايضا ما عرفنا من الاخبار و من جهة السمع</p>",
      "5500": "<p dir=\"auto\">Two treatises of Mujmal al-ḥikma. Undated. 17 lines per page, page 22,5x18cm.</p>",
      "6920": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>. Dated to 1240/1824-5.</p>",
      "8756": "<p dir=\"auto\">Mujmal al-ḥikma. Dated to Shaʿbān 971/March-April 1564.</p>",
      "10479": "<p dir=\"auto\">Mujmal al-ḥikma or another Persian translation, dated to 1300/1882-3. 17 lines per page (15x8,5cm), page 22,5x18cm.</p>",
      "10755": "<p dir=\"auto\">Mujmal al-ḥikma. Possibly 11th C. Nastaʿlīq script. 155 folios, 14 lines per page.</p><p dir=\"auto\">Wāqif: Mīrzā Muḥammad Ṭāhir b. Ẓahīr al-Dīn Mīrzā Muḥammad Ibrāhīm.</p>",
      "12319": "<p dir=\"auto\">Rasāʾil Qism 2, 17 epistles. Waqf: “Sayyid Jalāl al-Dīn Ṭihrānī.” 114 folios, 29 lines per page, 28,5x19cm.</p><p dir=\"auto\">آغاز: اعلم يا اخي ايدك االله و ايانا بروح منه انه لما كان النظر في الطبيعيات جزوا من صنايع اخواننا؛</p><p dir=\"auto\">انجام: الحمد لواهب الكل.</p>",
      "137352": "<p dir=\"auto\"><span class=\"italics\">Ikhwān al-Ṣafāʾ wa-ikhlāʾ (?) al-wafāʾ</span> in majmūʿa (?)<span class=\"italics\">,</span><strong> </strong>21 lines per page, potentially dated to 1134/1721-2? Donated (?) by Mīr Karīm sulṭān al-wāʿiẓīn.</p>",
      "22759": "<p dir=\"auto\">Partial copy, from Fihrist up to 4.3. (final line is found in faṣl 4 of that epistle in Hindawi version). Naskh. Size = 20x12cm.</p><p dir=\"auto\">آغاز: ثبت رسائل اخوان الصفا و الاصدقاء الكرام؛</p><p dir=\"auto\">انجام: و ما في ايديهم من كتب الانبياء فراي ان</p>",
      "23432": "<p dir=\"auto\">Nasta’liq, preceded by an introductory note in Persian saying this is a text of selections; 1058 / 1648</p>",
      "24175": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>, nasta’liq, 10th century.</p>",
      "26338": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>, ownership note by ʿAlī Muḥammad b. Muḥammad b. Ismāʿīl.</p>",
      "27516": "<p dir=\"auto\">13th C, Persian translation; Moqaddasi b. Nasr ū-Dīgerān</p>",
      "27804": "<p dir=\"auto\">Rasāʾil ikhwān al-Ṣafāʾ. 12th/18th C.</p>",
      "34773": "<p dir=\"auto\">Persian translation. Dated to 1263/1846-7? 29 lines per page. Gifted by Maqām-i muʿaẓẓam-i rahbarī (= Grand Ayatollah) in 1386/2007.</p>",
      "37654": "<p dir=\"auto\">Mujmal al-ḥikma. 12th/18th C. 14 lines per page. Gifted by Maqām-i muʿaẓẓam-i rahbarī (= Grand Ayatollah) in 1386/2007.</p>"
    },
    "Maybadī": {
      "334": "<p dir=\"auto\">Mujmal al-ḥikma. 11th/17th C, nastaʿlīq script. 154 folios, 14 lines per page.</p><p dir=\"auto\">Ownership note: Aghā Muḥammad Ḥusayn.</p>"
    },
    "Shaykh ʿAlī Ḥaydar": {
      "1272": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>. Seal with “Muḥammad nabī Allāh ʿAlī walī Allāh”, another seal reading “Fakhr al-Aṭṭibāʾ 1278.” 182 folios, 14 lines per page.</p>"
    }
  },
  "Masyaf": {
    "Private library?": {
      "NA": "<p dir=\"auto\">A copy of Risālat jāmiʿat al-jāmiʿa mentioned by Arif Tamur as one the MSS he used for his edition. He provides no further details about any of the MSS he used.</p>"
    }
  },
  "Milan": {
    "Ambrosiana": {
      "118Sup": "<p dir=\"auto\">Oriental cover, but binding is without flap. Majmūʿa with decorated title page, 15th century or earlier (ownership note dated 884 (Persian 4!) on title page, Yaḥyā Ḥajjī al-Rifaʿī (?))</p><p dir=\"auto\">first work (decorated title page) is <span class=\"italics\">Lubāb al-ishārāt</span> by al-Rāzī => commentary on Ibn Sīnā</p><p dir=\"auto\">text by al-Suhrawardī</p><p dir=\"auto\">Some random pages of hadith and duʿāt</p><p dir=\"auto\"><span class=\"italics\">Sharḥ fuṣūs</span> by Fārabī 116r onwards = this seems to be in similar handwriting as the first text, copyist of this part is Maḥmūd b. Faḍl Allāh b. Aḥmad al-Hamadhānī, copied 647/1249</p><p dir=\"auto\">188v: colophon = awākhir Ṣafar 647 (June 1249) Maḥmūd b. Faḍl Allāh b. Aḥmad al-Hamadānī?</p><p dir=\"auto\"><span class=\"italics\">Min ikhwān al-ṣafāʾ</span>: acephalous start in Risāla 2.8 at 189r (<span class=\"italics\">Ḥayawān,</span> ms0560 in OpenITI), appears to be different copyist; risala 2.9 at 233r-246r risāla 2.10 announced on final page, but verso is empty however, => I believe this must have been extracted either from a full manuscript, or perhaps a manuscript of qism 2, or perhaps considering the empty verso folio, a copy in progress that was abandoned for some reason.</p>",
      "X82sup": "<p dir=\"auto\">Partial (epistles 1-6), 7th/13th C?</p><p dir=\"auto\">Old binding, worm-eaten, no visible title on the side</p><p dir=\"auto\">Ex-libris Evgenii Griffini 39 => purple seal on book is his => likely Yemeni origin</p><p dir=\"auto\">This is an Ikhwan manuscript, very plain handwriting, rather messy, disintegrating at the ends (final and first folio ripped up)</p><p dir=\"auto\">Binding contains different text (reused pages?) , but had no time to look at them in detail</p><p dir=\"auto\">أوحانيف غري…</p><p dir=\"auto\">٣٢</p><p dir=\"auto\">2a = ms0022, i.e. risala 1.1</p><p dir=\"auto\">19a: end of risala 1.1.</p><p dir=\"auto\">19b: different handwriting, reminds of West-African MSS?</p><p dir=\"auto\">20a: doesn’t seem to match risala 1.2? Starts with sort of fihrist, but then folios with geometrical figures = scrambled MS?</p><p dir=\"auto\">31b: note that risala fī al-handasa 1.2. is finished</p><p dir=\"auto\">32a: risala al-asṭurnūmiyya, announced as 1.3 (is correct), below title different handwriting</p><p dir=\"auto\">33b and 34a contain diagram of the spheres going up to falak al-muhit (i.e. Ibn al-Dawadari doesn’t seem to follow these)</p><p dir=\"auto\">57a: risala fī al-musiqa, announced as 1.4</p><p dir=\"auto\">99a: Risāla fī jughrāfiyyā - clear title page, given as fifth risala of first qism</p><p dir=\"auto\">104a: different handwriting, starts with basmallah</p><p dir=\"auto\">110a & 111a and a few further folios have tables with names of cities</p><p dir=\"auto\">117a: risāla fī al-nisba al-ʿadadiyya etc.</p><p dir=\"auto\">120a: numbers in the margin = rendering of contents?</p><p dir=\"auto\">125b = ms0164 folio starts at:</p><p dir=\"auto\">عند الطبخ لها على النسبة كان</p><p dir=\"auto\">~~الطبيخ طيب الرائحة، لذيذ الطعم، جيد الصنعة، ومتى كان على غير النسبة كان</p><p dir=\"auto\">~~بخلاف ذلك، ومن أجل هذا ذكر في كتاب الطب وفي كتب الصنعة أن تلك العقاقير</p><p dir=\"auto\">~~متى ركبت على النسبة، ودبرت على تلك النسبة صحت، ومتى كانت على غير ذلك</p><p dir=\"auto\">~~فسدت ولم تصح.</p><p dir=\"auto\">20a:</p><p dir=\"auto\">العلوم التي تتخرج بها اولاد الفلاسفة .. وصون بها تلامذتهم</p><p dir=\"auto\">اربعة احىاس تلها العلوم الرياضيات والتاني العلوم</p><p dir=\"auto\">المنطقبات والثالث العلوم الطبيعية</p><p dir=\"auto\">والرابع العلوم الالهية ….</p><p dir=\"auto\">Sort of fihrist?</p>",
      "C93": "<p dir=\"auto\">Partial (2.8-2.14 + 1.9), dated 1055/1645</p><p dir=\"auto\">Original (?) cover, worm eaten. At the end, text recycled into the binding is visible.</p><p dir=\"auto\">Text in</p><p dir=\"auto\">Title page (black with red vocalisation) going into a slight oval-triangular shape:</p><p dir=\"auto\">رسالة شريفة هي رسالة</p><p dir=\"auto\">تركيب الجسد ورسالة الحاس</p><p dir=\"auto\">والمحسوس ورسالة مسقط</p><p dir=\"auto\">النطقة ورسالة في ان الانسان</p><p dir=\"auto\">عالم صغير ورسالة في كيفية</p><p dir=\"auto\">نشو الأنفس الحروية</p><p dir=\"auto\">في الأجساد وكيفية</p><p dir=\"auto\">انبعاثها وارتفاعها</p><p dir=\"auto\">ورسالة جامعة</p><p dir=\"auto\">الجامعة</p><p dir=\"auto\">Then in red on the sides:</p><p dir=\"auto\">ورسالة الاخلاق</p><p dir=\"auto\">والحمد لله رب العالمين</p><p dir=\"auto\">1b: start of first risala as announced, in red mistara, but this is continued only up to folio 18b.</p><p dir=\"auto\">19 lines per page. Rather careful handwriting. Red rubrication</p><p dir=\"auto\">20a:</p><p dir=\"auto\">Start, as announced of risāla misqaṭ al-naṭqa, number 11 of jismāniyya</p><p dir=\"auto\">47b: handwriting changes, thicker. Also no more red rubrication, but from here on in bold</p><p dir=\"auto\">50a: colophon for risala about man being a microcosmos, start risala on kayfiyya (as announced)</p><p dir=\"auto\">57a: colophon for risala, no date or further info</p><p dir=\"auto\">57b: start risala fī tanāhī ʿilm al-insān wa-bayān ṭāqatihi fī al-maʿārif</p><p dir=\"auto\">62a => start RJJ, handwriting of first scribe again</p><p dir=\"auto\">اذا ما صدرت عن الجامعة … فدونك جامعة الجامعة</p><p dir=\"auto\">تعيها اذا اذن واعيه … وتسمعها افبدة سامعة</p><p dir=\"auto\">صلوة الا له على من اتى … بمشرق انوارها اللامعة</p><p dir=\"auto\">63b:</p><p dir=\"auto\">فصل في معرفة ادم الكلي.</p><p dir=\"auto\">= start is identical to the Bohra version of <span class=\"italics\">RJJ</span>.</p><p dir=\"auto\">96b: colophon: (the name of the copyist is crossed out and blackened in MS, my reading is a reconstruction of trying to see through the blotting)</p><p dir=\"auto\">تمت الرسالة جامعة الجامعة الواقية عنا والبذافعة في نهار</p><p dir=\"auto\">الثلاثا المبارك لعلى احد وعشرين من شهر القعدة الحرام</p><p dir=\"auto\">سنة خمس وخمسين والف من الهجرة النبوية ١٠٥٥</p><p dir=\"auto\">بخط العبد الفقير الى عفو الله تعالى ورضاه</p><p dir=\"auto\">اسمعيل بن محمد بن اسمعيل بن موسى …</p><p dir=\"auto\">…. تولى الله …</p><p dir=\"auto\">وتمت على منهج الهدا الطريقة وررقي</p><p dir=\"auto\">العلم الشريف منه وكرمه</p><p dir=\"auto\">كتبها لنفسه وبرسمه</p><p dir=\"auto\">وفي الرسالة المباركة في … بعض شي من غلط الكاتب يقبل الله ممن وقف عليها</p><p dir=\"auto\">واصلح خللها وكافاه بالحسنى …</p><p dir=\"auto\">97a: title page for risala ikhtilāf al-akhlāq being the ninth from the qism al-riyadiyat, including again a two-line poem to introduce it</p><p dir=\"auto\">= first scribe again, but reverts at 114a again to second scribe</p><p dir=\"auto\">143b: colophon</p><p dir=\"auto\">تمت رسالة الاخلاق</p><p dir=\"auto\">والحمد لله وصلواته رسوله مستنبط</p><p dir=\"auto\">يدنا بيع الحكمة وصف حوهره والقارع به</p><p dir=\"auto\">انوف الجاجدىن لاوله ومصدره وعلى</p><p dir=\"auto\">المفصح عن عراىىه علي واله وسلم عليهم اجمعين</p>",
      "1518incorrectcallnumberTBC": "<p dir=\"auto\">Incorrect call number, needs to be ascertained!<strong> </strong>Fragments of 3.10, 3.9, 3.7, 4.1. Copied in 795/1392, copied by Muḥammad b. Sulaymān b. Muḥammad al-ʿArjī (?)</p>"
    }
  },
  "Mosul": {
    "Madrasa al-Aḥmadiyya (Maktabat al-awqāf al-ʿāmma)": {
      "194": "<p dir=\"auto\">Extract or fragment (only 61 folios), potentially attributed to Abū l-Qāsim al-Andalusī, Maslam b. Qāsim al-Kharmīṭī</p><p dir=\"auto\"><a href=\"https://scripts.nlai.ir/result/NG8mcEG9/رسائل-اخوان-الصفا-نسخه-خطی/\" target=\"_blank\">https://scripts.nlai.ir/result/NG8mcEG9/رسائل-اخوان-الصفا-نسخه-خطی/</a></p><p dir=\"auto\"><a href=\"https://digitallibrary.al-furqan.com/our_is_item/manid/1948892/groupid/0\" target=\"_blank\">https://digitallibrary.al-furqan.com/our_is_item/manid/1948892/groupid/0</a></p>"
    }
  },
  "Mumbai": {
    "University Library": {
      "Fyzee3": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil Ikhwān al-ṣafāʾ wa-khillān al-wafāʾ</span>; thirty rasāʾil, first two aqsām; no date.</p><p dir=\"auto\">Data from Goriawala catalogue.</p>",
      "Fyzee4": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil Ikhwān al-ṣafāʾ wa-khillān al-wafāʾ</span>; qism 2 (17 rasāʾil).</p><p dir=\"auto\">Data from Goriawala catalogue.</p>",
      "Fyzee5": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil Ikhwān al-ṣafāʾ wa-khillān al-wafāʾ</span>; qism 3.</p><p dir=\"auto\">Data from Goriawala catalogue.</p>",
      "Fyzee6": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil Ikhwān al-ṣafāʾ wa-khillān al-wafāʾ</span>; qism 4.</p><p dir=\"auto\">Data from Goriawala catalogue.</p>",
      "Fyzee7": "<p dir=\"auto\"><span class=\"italics\">Risāla</span> 26 (2.13) + extracts from other rasāʾil (27th risāla; risāla fī l-ḥayawānāt) + extract from a work entitled <span class=\"italics\">Tanbīh al-ghāfilīn.</span></p><p dir=\"auto\">Data from Goriawala catalogue.</p>",
      "Fyzee8": "<p dir=\"auto\"><span class=\"italics\">al-Risāla al-Jāmiʿa</span>; vol. 2 only; 2.13-end.</p><p dir=\"auto\">Data from Goriawala catalogue.</p>",
      "Fyzee9": "<p dir=\"auto\"><span class=\"italics\">Risālat jāmiʿat al-jāmiʿa fī l-ḥaqāʾiq</span> - copied by ʿAbd al-Qādir b. Māmā Jaʿfarjī b. Nūrbhāʾī; 27 Jum I 1270 / 1854.</p><p dir=\"auto\">Data from Goriawala catalogue.</p>",
      "16": "<p dir=\"auto\">A “complete copy” of <span class=\"italics\">Rasāʾil Ikhwān al-ṣafāʾ</span>, bound in three volumes. A clear copy in <span class=\"italics\">naskh</span>, with red rubrication. Catalogue notes correspondence of final folio with Cairo edition, which might indicate that this manuscript follows the short recension of the Risala on Magic.</p><p dir=\"auto\">Copied by ʿAbd al-Karīm b. Nāṣir Abī Ismāʿīl on a Sunday in Dhū al-Qaʿda 1297/October 1880 (not 1800 as converted by Khān Bahādur in the catalogue). Name of Shaikh Ahmad Nooroodin 1879 is mentioned alongside description of the European paper’s watermark in catalogue. Unclear if this name appears in the watermark or in a note. Former option seems more likely given the copying date.</p>"
    },
    "Mulla Firuz Library": {
      "SupplementLogicandPhilosophyV1": "<p dir=\"auto\">Mujmal al-ḥikma, 16 lines per page, 5.8x3.5 (inches?). Unclear if description in catalogue is of text in general or of this MS.</p>"
    }
  },
  "Munich": {
    "Bayerische Staatsbibliothek": {
      "Codarab652": "<p dir=\"auto\">Late Ottoman copy (Constantinople 1785/1200), no notes</p><p dir=\"auto\">Authorship: “al-waḥīd dahri-hi wa farīd ʿaṣri-hi al-raʾīs al-fāḍil waʾl-faylusūf al-kāmil al-shaykh Maslama b. Aḥmad al-Majrīṭī al-Andalusī”</p><p dir=\"auto\">“Kutiba bi-rasm mawlānā shaykh al-islām wa-ʿalāmat al-anām al-fāḍil al-raʾīs mawlānā al-shaykh ʿAbd al-Raḥman b. Ḥasan efendi al-Jabartī, sana 1200” => famous al-Jabartī! (1753-1825 — Cairo rather than Istanbul then?)</p>",
      "Codarab653": "<p dir=\"auto\"><span class=\"italics\">al-Risāla al-Jāmiʿa dhāt al-fawāʾid al-nāfiʿa</span> (referred to as such ff. 42b; 116b, 172b, contains some kind of note on title page which appears to discuss the miraculous composition of the work in different places + a note in secret script</p>",
      "Codarab654": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span><strong> </strong>written by Michel Sabbâgh + extracts from Ibn Khaldūn’s <span class=\"italics\">Muqaddima</span> (about the influence of heavenly bodies, dreams and secret scripts)</p>",
      "Codarab655": "<p dir=\"auto\">Single risāla: 1.8/21 = epistle on animals. Copied in India before 1858.</p>"
    }
  },
  "Najaf": {
    "Amīr al-Muʾminīn Library": {
      "1404": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma,</span> dated to 20 Jumādā I 1110/24 November 1698, copyist Muḥammad Shafīʿ b. Muḥammad Muqayyim Ardakānī. Nasta’liq script. Same volume contains a treatise on the stars in the same handwriting. MS at one point owned by Ḍiyāʾ Lashkar Taqī Dānish.</p><p dir=\"auto\">A MS of some of this owner’s writings is available here: <a href=\"https://ketabpedia.com/تحميل/نوشین-روانتقی-دانش-ملقب-به-ضیاء-لشکر-و/\" target=\"_blank\">https://ketabpedia.com/تحميل/نوشین-روانتقی-دانش-ملقب-به-ضیاء-لشکر-و/</a></p><p dir=\"auto\">+ an MS of his diwan: <a href=\"https://ketabpedia.com/تحميل/دیوان-148/\" target=\"_blank\">https://ketabpedia.com/تحميل/دیوان-148/</a></p><p dir=\"auto\">Found by Aslisho.</p>"
    },
    "Library of Ayatollah Jaʿfar Baḥr al-ʿUlūm": {
      "41": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma,</span> formerly owned by prince Farhād Mīrzā son of ʿAbbās Mīrzā b. Fatḥ ʿAlī Shāh, in the year 1282/1865-6. Found by Aslisho.</p>"
    },
    "Kāshif al-Ghiṭāʾ al-ʿĀmmā Library": {
      "555": "<p dir=\"auto\">5 Dhū al- Ḥijja 1237Q/1858, Bilingual Persian-Arabic by Kāẓim al-Rashtī (d. 1843); 329 pages.</p><p dir=\"auto\">Excel-catalogue of the library: text title is أجوبة مسائل اخوان الصفا Copied by Aḥmad al-Khurāsānī</p><p dir=\"auto\">On the scholar whose library this is, see <a href=\"https://de.wikipedia.org/wiki/Kaschif_al-Ghita\" target=\"_blank\">https://de.wikipedia.org/wiki/Kaschif_al-Ghita</a> (+ Arabic wiki)</p>"
    },
    "Madrasa al-Sharabyānī": {
      "1": "<p dir=\"auto\">1245/1829, by “al-kātib al-iṣfahānī” in 774 pages, starts, funnily with رسائل اخوان الصفاء كثیرة و لكن اخوان الصفاء قلیل</p><p dir=\"auto\">Includes material not in the edition</p><p dir=\"auto\"><a href=\"https://scripts.nlai.ir/result/NqjqWGsc/رسائل-اخوان-الصفا-نسخه-خطی/\" target=\"_blank\">https://scripts.nlai.ir/result/NqjqWGsc/رسائل-اخوان-الصفا-نسخه-خطی/</a><strong> </strong></p>"
    }
  },
  "New Haven": {
    "Yale Beinecke Library": {
      "ArabicMSS532": "<p dir=\"auto\">Risāla 11, No. 4 of 9 titles bound together, copied ca. 1800. Purchased from Captain Tekeş, Istanbul in February 1965 on the Beinecke fund.</p>"
    }
  },
  "New York City": {
    "Jewish Theological Seminary": {
      "ENA4193210": "<p dir=\"auto\">Nine folios from epistle on senses preserved in the Geniza</p>"
    },
    "New York Public Library": {
      "V161MA51871A": "<p dir=\"auto\">Acephalous, <span class=\"italics\">taʿlīq,</span> 257 folios. <span class=\"italics\">Ikhwān al-ṣafāʾ ahl al-mawaddah waʾl-wafāʾ</span></p><p dir=\"auto\">According to catalogue copied 8th/14th century.</p><p dir=\"auto\"><span class=\"italics\">Gowaart consulted the MS in person 31/10/2023:</span></p><p dir=\"auto\">Purchased from Jacob H. Schiff fund</p><p dir=\"auto\">The catalogue dates this to the 8th/14th century date, but Gowaart would suggest rather 16th or even 17th century given the use of <span class=\"italics\">nasta</span><span class=\"italics\">ʿ</span><span class=\"italics\">l</span><span class=\"italics\">ī</span><span class=\"italics\">q</span> and the general layout of the codex. It does seem to be copied on oriental paper however. No visible watermark and without clear gridlines</p><p dir=\"auto\">Entirely written in gold and red frame - evidently added later, see 243b. Red rubrication.</p><p dir=\"auto\">Side + flyleaf: “al-jild al-awwal min kitāb Ikhwān al-Ṣafā Ahl al-mawadda wa-l-wafā”</p><p dir=\"auto\">Title page missing, likely single folio only at the start, because 1a-4b = fihrist.</p><p dir=\"auto\">Pages with new rasail have a piece of paper attached to the border (this seems to have got cut during rebinding) => navigational help</p><p dir=\"auto\">No consultation or ownership notes.</p><p dir=\"auto\">4b: conclusion notes al-Risāla al-Jāmiʿa as “zubdat al-rasāʾil kulluhā”</p><p dir=\"auto\">5a: start risala 1.1</p><p dir=\"auto\">12a: start risala 1.2</p><p dir=\"auto\">18a: start risala 1.3</p><p dir=\"auto\">20b: later hand (?) has added data on planets</p><p dir=\"auto\">27a: start risala 1.4</p><p dir=\"auto\">41a: start risala 1.5 on geography (= 1.4 in printed ed.)</p><p dir=\"auto\">44a: different Qalam filled in names of regions, but tables on following folios not filled in (how usual is it to have such tables? And are they usually filled in? Further on also empty space for illustrations/maps?)</p><p dir=\"auto\">66a: start of risala 1.6</p><p dir=\"auto\">70b: start of risala 1.7 on al-ṣanāʾiʿ al-ʿilmiyya</p><p dir=\"auto\">75a: start of risala 1.8</p><p dir=\"auto\">80a: start of risala 1.9 fi Bayan ikhtilaf al-akhlaq</p><p dir=\"auto\">107b: start of risala 1.10 Isagoge</p><p dir=\"auto\">111b: start of risala 1.11 Categories</p><p dir=\"auto\">115a: start of risala 1.12 Analytics 1</p><p dir=\"auto\">119a: start of risala 1.13 Analytics 2</p><p dir=\"auto\">126a: risala 14 (Announced as part of jismaniyya wa-tabi’iyya = shift in designation of parts)</p><p dir=\"auto\">131a: risala 2.1 on al-samāʾ wa-l-ʿālam</p><p dir=\"auto\">142b: risala 2.4</p><p dir=\"auto\">234b: start of risala 2.10 has wa-mahsus</p><p dir=\"auto\">239b: start of risala 2.11</p><p dir=\"auto\">241a: start of risala 2.12 man as microcosm</p><p dir=\"auto\">257b: final note on second volume to follow. Here the title is the more conventional “kitāb ikhwān al-ṣafā wa-khullān al-wafā”</p>"
    }
  },
  "Oman (Muscat?)": {
    "Ministry of Culture (?)": {
      "2350": "<p dir=\"auto\">No further info available</p>"
    }
  },
  "Oslo": {
    "National Library of Norway": {
      "Msfol431383": "<p dir=\"auto\">A partial copy of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span>, according to Qalamos from the 9th/15th century.</p><p dir=\"auto\">The second flyleaf provides the title of the text and denotes the manuscript as “quires” (<span class=\"italics\">karārīs</span>). It then starts to provide the text of the “first epistle” (= epistle 3.1). The next folio is in an entirely different, apparently older handwriting on different paper. The flyleaf thus contains a reparation, made at some point before the year 1076/1665-6 at which point an owner left a note on this flyleaf. Folios 117 and 118 are in fact also flyleaves containing reparation in later handwriting. 117a contains a collation note dated to the year 126../1844-52.</p><p dir=\"auto\">The verso of the first flyleaf provides a table of contents with markers of the folios where the start of each epistle is found. The verso of this flyleaf contains further notes.</p><p dir=\"auto\">The epistles are numbered as follows (mapping onto the Hindawi edition between brackets, this mapping is based on the epistle’s titles – brief comparisons indicate substantial textual variation):</p><p dir=\"auto\">Flyleaf 2-folio 3a: “Epistle 1” (= 3.1),</p><p dir=\"auto\">3a-14a: “Epistle 2” (= 3.10)</p><p dir=\"auto\">14a-24a: “Epistle 3” (= 3.2)</p><p dir=\"auto\">24a-63a: “Epistle 5” (= 3.5)</p><p dir=\"auto\">63a-74a: “Epistle 6” (= 3.4)</p><p dir=\"auto\">74a-82b: “Epistle 8” (= 3.6)</p><p dir=\"auto\">82b-95b: “Epistle 9” (= 3.8)</p><p dir=\"auto\">95b-116b: “Epistle 10” (= 3.9)</p><p dir=\"auto\">Given that the ordering of these epistles skips epistles 4 and 7 (3.3. and 3.7 in the Hindawi edition), there may be quires missing. This would need closer study.</p><p dir=\"auto\">Regular marginal notes signposting contents in the body text, some preceded by the term “maṭlab”. Folio 75a contains a marginal doodle. In the second half of the manuscripts some floral markers are also found where new sections start (e.g. 97b, 103b, 112b) One of the marginal notes on 88a appears to be signed by Aḥmad al-Ghanīmī al-Anṣārī, an Egyptian scholar of the 11th/17th century (d. 1044/1635). This appears to be the same handwriting as most of the other marginal notes. Another longer such note is found on 105a. This marginal annotation needs closer study.</p><p dir=\"auto\">Codicological description: 118 folios + … flyleaves. Numbered folios have 17 lines per page. A rather clear rounded naskh handwriting. Red overlining. Bold layout for start of epistles. Some marginal rubrication for start of <span class=\"italics\">fuṣūl</span>. No catchwords.</p>"
    }
  },
  "Oxford": {
    "Bodleian": {
      "Fraser180": "<p dir=\"auto\">A composite manuscript (texts executed in different hands) including one epistle from <span class=\"italics\">RIS</span> attributed as <span class=\"italics\">risāla fī al-qamar</span>, together with a work by al-Ṭūsī and Ibn Bābawayh and two unidentified works. Inside front cover contains a note in Latin identifying the contents.</p><p dir=\"auto\">Contents:</p><p dir=\"auto\">1b-60b - Ibn Bābawayh, <span class=\"italics\">Iʿtiqād al-imāmīyah</span>, containing many interlinear notes in <span class=\"italics\">nastaʿlīq</span> (this is the text by which the manuscript was identified on its side)</p><p dir=\"auto\">62b-79b - Ikhwān al-Ṣafāʾ, <span class=\"italics\">Risāla fī al-qamar</span>; explicitly attributed as “risāla min rasāʾil ikhwān al-ṣafāʾ” in concluding lines (79b) – there is no <span class=\"italics\">Risāla fī al-qamar</span> in the <span class=\"italics\">Rasāʾil</span> but some of the material in this extract matches part of the epistle on magic (ca. ms1411-ms1423, <span class=\"italics\">faṣl</span> 68 and <span class=\"italics\">faṣl</span> 69).</p><p dir=\"auto\">80a - flyleaf of Persian text, containing several notes</p><p dir=\"auto\">80b-118b: Persian text, dated to Muḥarram 1005/September 1596</p><p dir=\"auto\">122b-149a - a text in Persian on <span class=\"italics\">ḥisāb,</span> dated Dhū al-Qaʿda 1085/February 1675</p><p dir=\"auto\">150a - blank page containing a note praising Imām Riḍā and naming Mīrzā Dawud (?) “mutawallī-yi Astā[na? maybe Astāra?]-i muqaddasa”</p><p dir=\"auto\">150b-206b - a copy of Naṣīr al-Dīn Ṭūsī’s <span class=\"italics\">Taḥrīr uṣūl al-handasah li-Uqlīdīs</span></p><p dir=\"auto\">207a-207b: several notes</p>",
      "Huntington296": "<p dir=\"auto\">pts. 1-3 of 4, cfr. [UAM. 904 with corrig. Nicoll p. 600] [ff. 24v-38 are Farmer 1*]</p><p dir=\"auto\">Oriental binding. Written in mistara, red rubrication, has diagrams. Has green strings sown into the leaves, matching start of rasa’il</p><p dir=\"auto\">Title page (seems to be later addition): author identified as al-Majrīṭī. Some notes: Muḥammad b. Jamāl al-Dīn al-Qadasī (?) Qadi of Damietta (?); another note in Jerusalem?; a certain Muḥammad Hibat Allah;</p><p dir=\"auto\">1b-4b: fihrist</p><p dir=\"auto\">4b: risala 1.1</p><p dir=\"auto\">209b: end of risala 1.10, followed by rendering of the text’s title, including the reference to “min kalām al-ṣūfiyya” (in fact at every risala change)</p>",
      "IndInstArab14": "<p dir=\"auto\">8th letter, faṣl 2-end, only = pp. 173-317 in Cairo edn. of 1928, with scattered Persian interlinear glosses.</p><p dir=\"auto\">Large manuscript, oriental binding.</p><p dir=\"auto\">Ex-libris Sir M. Monier-Williams (d. 1899, see <a href=\"https://en.wikipedia.org/wiki/Monier_Monier-Williams\" target=\"_blank\">https://en.wikipedia.org/wiki/Monier_Monier-Williams</a> ) => he left some pencil notes (?), there are also two other notes on the flyleaf, one dated 1860.</p><p dir=\"auto\">Paper is very thing, reminds one of Bible paper. Persian note at the end (colophon? See photograph) dated 1828, maybe reference to Yerevan?</p><p dir=\"auto\">Mostly only on one side, with opposing blank page => meant for translation?</p>",
      "LaudOr255": "<p dir=\"auto\">apparently a full copy? [UAM. 871]</p><p dir=\"auto\">Large manuscript</p><p dir=\"auto\">1b: start with fihrist</p><p dir=\"auto\">4b: start risala 1.1.</p><p dir=\"auto\">93a: end of qism 1</p><p dir=\"auto\">94a: start of qism 2</p><p dir=\"auto\">181b: end of “fasl 2”, has note</p><p dir=\"auto\">182a: start with hiss wa-mahsus</p><p dir=\"auto\">280a: start of qism 4</p><p dir=\"auto\">366b: end of risala 4.8, start of risala on “kimiyya anwāʿ al-siyāsāt”</p><p dir=\"auto\">372a: end of risala 4.9, start of</p><p dir=\"auto\">374a: start of risala on magic, so this must be short recension</p><p dir=\"auto\">379a: colophon, ramaḍān ..3 (? Maybe 800? Difficult to tell, no dots, needs closer study), name mentioned Muḥammad b. Muḥammad b. ʿAbd al-Malik</p><p dir=\"auto\">380a: announcement of what seems to be an addendum “sharḥ”, cfr. Pics</p><p dir=\"auto\">Owned by al-Taqawī (see Benedikt Reier p. 510 <a href=\"https://www.degruyter.com/document/doi/10.1515/islam-2021-0030/pdf\" target=\"_blank\">https://www.degruyter.com/document/doi/10.1515/islam-2021-0030/pdf</a></p>",
      "LaudOr260": "<p dir=\"auto\">A full copy of the <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span>.</p><p dir=\"auto\">Original (?) binding, written in mistara, red rubrication, with Ottoman-style titlehead and nicely decorated title page, very clean copy; no marginal annotation. Uniquely, the copy contains sumptuous illustrations in the Risāla on animals.</p><p dir=\"auto\">The colophon on 366b notes the scribe as al-Qadīr Aḥmad b. ʿAlī al-Saʿūdī, who finished copying the work on 23rd of Safar 968 (= 1560). Boris Liebrenz notes that he also copied the manuscript preserved as Ayasofya 1321, a copy of <span class=\"italics\">Ghāyat al-bayān wa-nādirat al-zamān fī ākhīr al-awān</span> by Amīr Kātib <span class=\"italics\">al-Itqānī al-Fārābī</span> (d. 758/1357). Accessible at: <a href=\"https://portal.yek.gov.tr/works/detail/200594\" target=\"_blank\">https://portal.yek.gov.tr/works/detail/200594</a>).</p><p dir=\"auto\">The title page attributes the text to al-Majrīṭī.</p><p dir=\"auto\">The title page contains two ownership notes. The following information was provided by Boris Liebrenz:</p><p dir=\"auto\">The first note reads</p><p dir=\"auto\">مما ساقه سائق التقدير</p><p dir=\"auto\">الى سلك ملك الفقير</p><p dir=\"auto\">حسن الحقير عفا الله سبحانه</p><p dir=\"auto\">عنه بمنه ويمنه</p><p dir=\"auto\">وكرمه آمين</p><p dir=\"auto\">This man’s fuller name is حسن بن عبد المحسن and [Liebrenz] has collected 20 books he owned between 955 and 980 AH. He was chief judge of Damascus at some point, which means that he would most likely have been an Ottoman career jurist based in Constantinople and sent around the empire.</p><p dir=\"auto\">The next owner, Muḥammad b. al-ḥāǧǧ ʿAlī known as Ibn Wafāʾ. The note is dated to 1025.</p><p dir=\"auto\">Then in 1045 there is نجم الدين محمد بن محمد الانصاري الحلبي الشهير بابن الحلفا. Liebrenz has identified nine volumes that he owned between 1012 and 1045 AH, with one in Gotha, this one in Oxford, and the rest all in Istanbul. He never says where he lived. One could assume that he was an Ottoman from Constantinople. Still, pretty much all those volumes have some connection to Aleppo and some were definitely there after him. And he has the nisba al-Halabi as well. The writing style is also more Arabic province than Ottoman center. This may indicate that the manuscript mostly circulated in Aleppo. Much of the Laud collection came through the agency of the Levant Company which was especially active in Aleppo.</p>",
      "Marsh189": "<p dir=\"auto\">Appears to be a full copy. [UAM. 989 with corrig. Nicoll p. 605] [ff. 25v-41v are Farmer 2]</p><p dir=\"auto\">Similar size to Laud Or 260. Authorship attributed to al-Majrīṭī. The manuscript contains some marginal content markers (sometimes using “maṭlab”), as well as post-it strings. The titles are in some cases in glittery ink, but given usually as kitab (at least once as <span class=\"italics\">bāb</span> (358b), this may actually be part of a “kitab”) without numbering. It seems that the scribe has omitted all the “ayyūhā al-akh/bār…”, and simply uses the “iʿlam”.</p><p dir=\"auto\">1a: title page, ownership note of a certain Yūsuf b. Muḥammad al-Fakhrī + stamp, possibly the same person; another note has been damaged, a certain al-Ḥanafī ?</p><p dir=\"auto\">16b: science of the stars => contains several circles</p><p dir=\"auto\">41b: geography => contains several tables and a few circles</p><p dir=\"auto\">146b-193b: hayawan</p><p dir=\"auto\">373b: “kitāb 11 fī māhiyyat al-siḥr ..”, considering the length presumably the long recension</p><p dir=\"auto\">395b: colophon (?) dated to 15 Ramaḍān 981 (1574)</p>",
      "Marsh502": "<p dir=\"auto\"><span class=\"italics\">al-Risāla al-Jāmiʿa</span><span class=\"italics\"> </span>79ff.</p><p dir=\"auto\">Vol. 1* only, with lacuna** after f. 70</p><p dir=\"auto\">* ending with the 12th risālah, p. 642 of Ṣalībāʼs edn. (1949); Vol. 1 of his edn. contains 16 risālahs</p><p dir=\"auto\">** corresponding to pp. 521, 1.4 - 585, 1.7 of Ṣalībāʼs edn.</p><p dir=\"auto\">[NAM. 254, with corrig. Nicoll p. 530, plus 40 fols. (ff. 1-40) formerly MS. Bodl. Or. 527 [= NAM. 386] and now restored]</p><p dir=\"auto\">Paper is filigrained, but the watermark is difficult to make out. Nice visualisation 65b; 79b final colophon, but no date.</p>",
      "Marsh524": "<p dir=\"auto\"><span class=\"italics\">M</span><span class=\"italics\">ajmūʿa</span> with three texts by Najamī, Shaybānī, and Fīrūzābādī + three rasāʾil [UAM. 138 (1), with corrig. Nicoll p. 569]</p><p dir=\"auto\">Multiple text manuscript in different hands, not clear when it was bound together, but final text has margins cut off — the fact that the side reads Ikhwan al-Safa suggests they were bound in the islamic world still</p><p dir=\"auto\">36b: colophon, copyist Abū al-Faḍl Muḥammad b. Wafā, Thursday 8 Shawwāl 881, attested to by Yūsuf b. Aḥmad b. Yūsuf al-Ṣafī al-Miṣrī in Muḥarram 882</p><p dir=\"auto\">37a: title page, risala 4.4. = big red rubrication for fasl</p><p dir=\"auto\">137b: end, colophon, no data</p><p dir=\"auto\">138a: title page of risala 4.2.</p><p dir=\"auto\">138b: end, colopgon, na date</p><p dir=\"auto\">139a: title page of risala 4.3.</p><p dir=\"auto\">173b: colophon undated, note below is same handwriting as the one who left some notes throughout the text</p><p dir=\"auto\">174a: title page for al-Fīrūzābādī, <span class=\"italics\">Ithārat al-ḥajūn li-ziyārat al-ḥujūn,</span> reading session note dated to 770 in Mecca</p><p dir=\"auto\">187a: colophon, dated to 845 also in Mecca, so this is a later copy that copied the reading session note from an earlier MS?</p>",
      "Pococke178": "<p dir=\"auto\">part 2 of <span class=\"italics\">Rasāʾil -</span> 1541 CE [UAM. 966 [the second of the two consecutive entries so numbered], with corr. Nicoll p. 604]</p><p dir=\"auto\">Title noted on the side. Neatly written. 21 lines per page. Red rubrication. Some underlining in pencil. On the title page the text is attributed to Sulaymān al-Ghazzī (on him, see <a href=\"https://www.degruyter.com/document/doi/10.7591/9781501751301-009/pdf\" target=\"_blank\">https://www.degruyter.com/document/doi/10.7591/9781501751301-009/pdf</a> )</p><p dir=\"auto\">كتاب | من احسن رسائل اخوان الصفا وخلان | الوفا للفيلسوف المحقق والحبر | المدقق الراهب العابد الزاهد سليمان | الغزي كان يراسل بها اخوانه بالديار | المصرية تغمده الله برحمته</p><p dir=\"auto\">Folio 27a: fasl on qiyama (ms0351), my impression is that overly Muslim material was expurgated, maybe even Christianised? On this page a pencil note links it to the Apocalypse of St John.</p><p dir=\"auto\">220a: some Syriac?</p><p dir=\"auto\">225b: Dated in Coptic calendar = “22 Baūnah year 238, which converts to 16 ḥazīrān 522 in Roman Christian calendar” (perhaps this should be read as [1]238 which converts to 26 June 1522)</p><p dir=\"auto\">Christian Arabic copyist (226a): al-shammās al-mukarram Jirjis al-ḥakīm</p><p dir=\"auto\">227b has a full page of notes - scribal exercises? Includes some secret script.</p>",
      "Pococke261": "<p dir=\"auto\">parts 3 & 4 of <span class=\"italics\">Rasāʾil -</span> [UAM. 959]</p><p dir=\"auto\">Vertically bound book. Fairly nicely calligraphed title page. Several ownership/consultation notes:</p><p dir=\"auto\">Consultation: on bottom right refers to Constantinople: Maḥmūd b.Muḥammad b. Al-imām … year 869 (?) = if so, this manuscripts is from the 9th/15th century or earlier.</p><p dir=\"auto\">Ownership: Muḥammad b. Sulaymān Bey al-mutaṭabbib al-Nakhjuwānī (?), maybe followed by a data in the 1000s?</p><p dir=\"auto\">Ownership: Yaḥyā b. Muḥammad al-Malakī (?)</p><p dir=\"auto\">Not just red rubrication but entire phrases (Quran?) in red.</p><p dir=\"auto\">5b: Start risala 3.2</p><p dir=\"auto\">248b: Syriac interlinear</p><p dir=\"auto\">269b: text matches risala 4.6</p><p dir=\"auto\">Colophon 269b: lots of designations, but name has been effaced?</p>",
      "Pococke342": "<p dir=\"auto\">Rasāʾil 32-51 [UAM. 894]</p><p dir=\"auto\">Relatively large manuscript, 27 lines per page mostly, but sometimes 25 (folio 62 for example); 178 folios (Latin script foliation, Arabic foliation goes up to 513, so this was likely once part of a larger MS), oriental paper but different types throughout. Red overlining and marginal rubrication notes/keywords (partly cut off). Epistles numbered from [1]-51, but also with their numbering within the <span class=\"italics\">aqsām</span>. Every epistle has a colophon (sometimes simply “the Xth epistle is ended”), but none are dated. Some pages have mistara preserved. Different handwritings throughout the MS: , risala 40 is in a different blocky hand, 41-51 seems to be consistent (loose hand).</p><p dir=\"auto\">Folios 6a, 29a and 63b-64a are completely blank. The latter are followed by risala 41 (4.1) => perhaps intended for title page illumination? Notably after these blank pages the handwriting changes quite significantly, though at other points they also change without a blank page intervening. Between 5b and 6a there is a loose leaf inserted.</p><p dir=\"auto\">Risala 47 (4.7) contains a letter that is somewhat distinctively laid out, at folio 146b, does not appear to be present in the edition, one phrase framed in black (found in Hindawi ms1205, is 4.7), maybe simply because it’s a copyist mistake and is repeated</p><p dir=\"auto\">و نحن لا نعرف انفسنا لان مثل من يدعى معرفة حقائق الاشياء</p><p dir=\"auto\">Final risala is the one on Magic, but it is very short, only 2 folios (+ one preceding with the title) => it appears that the largest part of this risala has not survived, only the final two folios.</p><p dir=\"auto\">Ownership note on 178b, Muḥammad Fatḥ Allāh Alṭaf dated Dhī al-Qaʿda 1038 (July 1629), so the MS is older than that.</p>",
      "SDigbyOr109": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span></p><p dir=\"auto\">Copied 6th Shaʻbān 1095 AH; 19th July 1684 CE; very small handwriting, 167 folios.</p><p dir=\"auto\">3a: Waqf note dated 1289</p><p dir=\"auto\">Colophon + stamps (same stamps as in beginning of the book, but clearer), one of these is dated 1289 as well</p><p dir=\"auto\">Collection of Simon Digby.</p><p dir=\"auto\">(= Bodleian 1492 noted by Danishpazhuh in their edition?)</p>"
    }
  },
  "Paris": {
    "Bibliothèque nationale de France": {
      "Arabe213": "<p dir=\"auto\">Two short extracts from epistles 26 (man as microcosmos) and 18 (meteorology) in a Coptic Christian <span class=\"italics\">majmūʿa</span> produced in 1602 (Coptic year 1318). Discussed and edited by La Spisa.</p>",
      "Arabe2303": "<p dir=\"auto\">1020/1611, before frontispiece notes to remember where the stories + ʿajāʾib are to be found in the MS (check whether the page indications are actually correct?)</p>",
      "Arabe2304": "<p dir=\"auto\">A full copy of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span> dated to 1065/1654.</p><p dir=\"auto\">Size: 29,5 x 20,5 cm. 31 lines per page.</p><p dir=\"auto\">Epistles are numbered both by their general ordering, and within their respective qism.</p><p dir=\"auto\">The manuscript contains content notes in French and Latin, mentioning among other things the text’s prevalence in Iran. This might give the impression that the text was an Iranian production, but it is likely Egyptian instead: the copyist is named as Ḥasan b. ʿAlī b. ʿAlī al-Azharī known as al-Nashratī, which indicates Egyptian origins (Nashra is an Egyptian village, and al-Azhar is of course in Cairo). This same copyist is also attested as the copyist of Nuruosmaniye 2683 which is executed in a very similar manner but is in fact a convolute of two volumes produced at slightly different times by two different copyists.</p><p dir=\"auto\">The patron is also named as Musṭafā Efendī, son of Sohrāb Efendī. P.M. Holt mentions him as an Egyptian <span class=\"italics\">rüznameci</span> (a high financial official) accompanying the <span class=\"italics\">bey</span> Dhū l-Faqār al-Māhī when the latter was summoned to Istanbul in 1075/1664 (i.e. a decade after this manuscript was copied – [Holt, “The Beylicate in Ottoman Egypt”, <span class=\"italics\">BSOAS</span> 24:2 (1961), p. 233 (number 23). Reprinted in Studies. It is unclear at this point why the bey was summoned to Istanbul]). Musṭafā Efendi’s name is preceded by a plethora of reverent designations, though none denoting actual office, and the manuscript itself was clearly produced at some expense, given the (unfinished) title page illumination in blue and gold, so it seems Musṭafā was a man of some means. Moreover the colophon emphasises that the patron was a scholar himself (he is said to have engaged in the <span class=\"italics\">ʿulūm al-awāʾil</span>) as well as a <span class=\"italics\">muhaqqiq</span>. At least one text of his, a commentary on a work by Ibn al-ʿArabī, appears to be attested in manuscript form (GAL: <span class=\"italics\">al-Dāʾira al-kubrā</span> (MS Alexandria Ḥurūf 12) – I am grateful to Aslisho Qurboniev for finding this).</p>",
      "Arabe2305": "<p dir=\"auto\">1153/1740, copyist Muḥammad b. ʿĪsā b. Ibrāhīm al-Kūrānī al-Ḥusaynī</p>",
      "Arabe2306": "<p dir=\"auto\">14th-16th century, attributed al-Majrīṭī. According to Tibawi 1955 this is the al-Risāla al-Jāmiʿa and indeed announced as such on title page, first volume only. Waqf note on title page is dated 1134/1722, possibly Egypt?</p>",
      "Arabe2307": "<p dir=\"auto\">majmūʿa starting with “min Rasāʾil” = Contient : Extrait de l'lkhwân al-Ṣafâ d'Al-Madjrîṭî ; Extrait du حلّ الرموز و مفاتيح الكنوز d'ʿAbd al-Salâm al-Maqdasî ; Le Maqṣoûd, traité de grammaire ; L'Adjarroûmiyya ; Traité de la foi et du repentir (معرفة فى شروط الايمان و التوبة) ; .البديعيّة Traité des figures de rhétorique, par le schaïkh Ṣafî al-Dîn ʿAbd al-ʿAzîz ibn Sarâyâ ; Un Isagoge ; l' Isagoge d'Athîr al-Dîn al-Abharî ; Commentaire du schaïkh Ḥosâm al-Dîn Kânî (ms. كاتى); 17th century</p>",
      "Arabe2308": "<p dir=\"auto\">The treaty on Music, explicitly attributed to al-Majrīṭī; cfr more info on Gallica</p>",
      "Arabe2309": "<p dir=\"auto\">“min Rasāʾil”; extract, Maṣyāf 16th (14th?) century</p>",
      "Arabe23412344": "<p dir=\"auto\">Four volumes. Variant introduction. First vol. dated to 28 Muḥarram 1228/1813.</p>",
      "Arabe4663": "<p dir=\"auto\">Majmūʿa including an extract from the Epistle on Music. Very diverse contents: Ibn ʿArabshāh, al-Mutanabbī, Ḥajjī Khalīfa on the sciences, etc. , strangely bound together with a French-Italian grammar/glossary by (de?) Scoppa! Most of it early 20th century (?) apparently.</p>",
      "Arabe6000": "<p dir=\"auto\">Partial copy, starts with fihrist, then first eight epistles (though first risala is suspiciously short, manuscript may be scrambled), but colophon notes epistles to follow. Rather many ownership statements on opening folio. No date in colophon, but looks rather old. Needs closer study, preferably of the physical copy.</p>",
      "Arabe66476648": "<p dir=\"auto\">Two MSS (second explicitly “niṣf al-thānī”)</p><p dir=\"auto\">The first volume was copied in Shaʿbān 675 (February 1277); the second volume does not include a colophon, but the manuscript is written in the same hand. Although no place of production is noted, by the year 709/1309 the manuscript had ended up in Yazd, where someone crossed out the colophon and added a collation note next to the first volume’s colophon.”</p><p dir=\"auto\">Authorship attributed to:</p><p dir=\"auto\">Abou Solaïman Mohammad ibn Nasr al-Bousti, surnommé al-Mokaddisi,</p><p dir=\"auto\">Aboul-Hasan ʿAli ibn Haroun al-Zandjani,</p><p dir=\"auto\">Abou Ahmad al-Nahrdjauri,</p><p dir=\"auto\">al-ʿAufi,</p><p dir=\"auto\">Zaïd ibn Rifaʿa</p><p dir=\"auto\">Has TOC, lots of marginal notes and other notes inserted</p><p dir=\"auto\">Second volume preceded by a poem by Ibn al-Fāriḍ (<a href=\"https://www.aldiwan.net/poem1525.html\" target=\"_blank\">https://www.aldiwan.net/poem1525.html</a> ) copied by a certain ʿUmar b. ʿUthmān b. ʿĀlim Shaykh … 4 Ramadan 771.</p>",
      "Persan131": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-Ḥikma</span> in majmūʿa, folios 2v-57. First page says “al-niṣf al-thānī”, but seems to start with handasa. Copied 3 Jumādā I 844 / 30 September 1440). Nasta’liq script, red rubrication. 13 lines per page (9,5x12,5cm), size 15,5x19,5cm, oriental paper.</p><p dir=\"auto\">Bought in Constantinople for the royal library by Abbé Sevin. Signed noted by d’Armain.</p><p dir=\"auto\">[Richard, <span class=\"italics\">Catalogue des manuscrits persans I, ancien fonds,</span> pp. 178-9]</p>",
      "Persan162": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-Ḥikma</span> in majmūʿa. Densely written pages, very busy first folio full of notes. Colophon folio 57a: Thursday early Rabīʿ I 848 / June 1444. Copyist Šāhīn b. ʿAbd al-Raḥman al-Muḥarrir.</p><p dir=\"auto\">Followed by text in Turkish in different hand: <span class=\"italics\">Mukhtaṣar-i ʿilm-i siyyāqāt</span> by ʿAbdī b. Maḥmūd b. ʿAbd al-Jabbār.</p><p dir=\"auto\">Bought in Constantinople for the royal library by Abbé Sevin in 1729-30. Signed noted by d’Armain.</p><p dir=\"auto\">[Richard, <span class=\"italics\">Catalogue des manuscrits persans I, ancien fonds,</span> pp. 154-5]</p>",
      "SupplmentPersan322": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-Ḥikma</span>, though also titled <span class=\"italics\">Khulāṣat-i Mujmal al-ḥikma</span> on f. 107<span class=\"italics\">.</span> Folio 1 replaced to complete acephalous MS. Dated to 6 Muḥarram 924/1518 by Fakhr al-Dīn b. Muḥammad al-Khunjī. Naskh script, rubricated titles, writing surface 90x155mm, size 145x215mm. Final folio contains some poetry added by the copyist, one of the poets named ʿAbd al-Qahhār.</p><p dir=\"auto\">Acquired for the .. library 5 August 1867, originates in collection of Barbier de Meynard, said to have been bought in Isfahan (between 1854-6).</p><p dir=\"auto\">[Richard,<strong> </strong><span class=\"italics\">Catalogue des manuscrits persans, tôme II, le supplément persan, première partie,</span> pp. 418-9]</p>"
    }
  },
  "Patna": {
    "Khuda Bakhsh Oriental Public Library": {
      "2962": "<p dir=\"auto\">On website MS call number given as 2222. -<strong> </strong>1190AH, nasta’liq, seal of Maḥmūd al-Dawla munshī Muḥammad Ṣafdar ʿAlī Khān Bahādur</p><p dir=\"auto\">However, data on NLAI is quite divergent: two different MSS?</p><p dir=\"auto\"><a href=\"https://scripts.nlai.ir/result/N6Ka8wKs/رسائل-اخوان-الصفا-ترجمه-نسخه-خطی/\" target=\"_blank\">https://scripts.nlai.ir/result/N6Ka8wKs/رسائل-اخوان-الصفا-ترجمه-نسخه-خطی/</a></p>"
    }
  },
  "Princeton": {
    "Princeton University Library": {
      "Garrett4263Y": "<p dir=\"auto\">[Damascus?, 1551] Incomplete copy, first 13 epistles of qism 1 + epistles 8 and 9 of qism 4. cfr.</p><p dir=\"auto\">Copyist known: Abū al-Ṣidq Abū Bakr ibn Ibrāhīm ibn Muḥammad ibn Ḥusayn? ibn ʻAlī ibn ʻAbd al-Malik al-ḥakīm al-Bakrī al-Dhabāḥ al-Maqdisī al-Qādirī al-Ḥanbalī, khaṭīb in Masjid al-Qadam Damascus => described in al-Ghazzī’s “Kawākib” (as noted on catalogue info, new ed. p. 86) = born in Yemen, copied Sufi texts, including Ibn ʿArabī, “People came to him to write talismans (<span class=\"italics\">ḥirz</span>) and other such things”</p><p dir=\"auto\">Ownership notes title page:</p><p dir=\"auto\">Abū l-Wafā b. ʿUmar al-ʿArḍ (?) al-Shāfiʿī al-Qādirī in Rajab (?) 1060</p><p dir=\"auto\">Yaḥyā (?) b. ʿAbd al-Raḥīm al-ʿAlwānī al-Ḥanafī, bought legally (?)</p><p dir=\"auto\">? 1192</p><p dir=\"auto\">Extensive marginal annotation in beginning (corrections?), including a note attributing the text to al-Majrīṭī</p><p dir=\"auto\">Catalogue info + full scan <a href=\"https://catalog.princeton.edu/catalog/4941772\" target=\"_blank\">https://catalog.princeton.edu/catalog/4941772</a></p>",
      "Garrett189Lq": "<p dir=\"auto\">Copied A.H. 1127 [A.D. 1715] by ʻAbd al-Qādir ibn Ṣafāy Chalabī ibn Ṭāhā. A fragment of the famous compendium of sciences known as Rasāʼil Ikhwān al-Ṣafāʼ. This fragment contains parts of the first ten risālahs. A few marginal lines. In the colophon the work is attributed to Ibn al-Qāsim Maslamah ibn Aḥmad, known as al-Majrīṭi, A.H. 398 [A.D. 1007/8].</p><p dir=\"auto\"><a href=\"https://catalog.princeton.edu/catalog/6357634\" target=\"_blank\">https://catalog.princeton.edu/catalog/6357634</a><strong> </strong></p>",
      "IslamicManuscriptsNewSeriesno192": "<p dir=\"auto\">Persian translation <span class=\"italics\">Mujmal al-ḥikma</span></p><p dir=\"auto\">Catalogue info: <a href=\"https://catalog.princeton.edu/catalog/6489855\" target=\"_blank\">https://catalog.princeton.edu/catalog/6489855</a><strong> </strong></p>",
      "IslamicManuscriptsNewSeriesno418": "<p dir=\"auto\">majmūʿa with earliest dated text 16th century <a href=\"https://catalog.princeton.edu/catalog/6416288\" target=\"_blank\">https://catalog.princeton.edu/catalog/6416288</a><strong> </strong></p><p dir=\"auto\">1. fol. 2a-25b: [Astronomical treatise in Persian] / Muḥammad al-Hādī ibn Abī Naṣr al-madʻū bi-Tāj al-Saʻīdī. Divided into muqaddimah, 16 ṭabaqah, and khātimah; with many diagrams. Dated Shawwāl 918 H.</p><p dir=\"auto\">2. fol. 26b-27a: [Notes].</p><p dir=\"auto\">3. fol. 27b-52a: [Iʻtiqādāt al-Ṣadūq].</p><p dir=\"auto\">4. fol. 52b-54a: [Extracts].</p><p dir=\"auto\">5. fol. 54b-79b: al-Nuṣūṣ mafātīḥ al-fuṣūṣ.</p><p dir=\"auto\">6. fol. 80a: [Extracts].</p><p dir=\"auto\">7. fol. 80b-125b: Dar bayān-i ḥaqāyiq-i vijdānī va maʻārif-i rabbānī. An explanation of some of the more difficult concepts in the Rasāʾil Ikhwān al-Ṣafāʾ; dated 1201 H.</p><p dir=\"auto\">8. fol. 128a-159b: [Lavāmiʻ sharḥ-i Khamrīyah-i Ibn Fāriz̤ / Jāmī]. Dated 7 Muḥarram 1244 H.</p>",
      "IslamicManuscriptsNewSeriesno2005": "<p dir=\"auto\">17th century</p><p dir=\"auto\">A collection of largely philosophical, Sufi, and Shiʻite texts and extracts. Frequently quoted texts interspersed throughout the volume, not listed below, include Bahāʼ al-Dīn al-ʻĀmilī's al-Kashkūl, the Rasāʼil Ikhwān al-ṣafāʼ, and Nahj al-balāghah.</p><p dir=\"auto\">1. fol. 1b-4b: [Extracts].</p><p dir=\"auto\">2. fol. 4b-5a: Risālah fī al-ʻilm al-ladunī wa-al-kasbī.</p><p dir=\"auto\">3. fol. 5b-40a: [Extracts].</p><p dir=\"auto\">4. fol. 40b-53b: [Persian philosophical treatise]. Incomplete at end.</p><p dir=\"auto\">5. fol. 54a-57a: [Extracts].</p><p dir=\"auto\">6. fol. 57b-58a: Waṣīyat Luqmān li-ibnihi.</p><p dir=\"auto\">7. fol. 58b-59b: Min Bābā Jāmī. Extract from the writings of Jāmī.</p><p dir=\"auto\">8. fol. 59b-60a: [Commentary on Qurʼān 61:6]. In Arabic.</p><p dir=\"auto\">9. fol. 60b-63b: [Persian Sufi treatise]. Cites the writings of Ibn al-ʻArabī and Saʻd al-Dīn Ḥammūyah.</p><p dir=\"auto\">10. fol. 63b-66a: [Risālah fī bayān al-qaḍāʼ wa-al-qadar].</p><p dir=\"auto\">11. fol. 66b-74a: [Extracts and poetry].</p><p dir=\"auto\">12. fol. 74b-78a: Risālah dar māhiyat-i nafs va rūḥ / lil-Shaykh al-Raʼīs Abī ʻAlī ibn al-Ḥusayn ibn ʻAbd Allāh [ibn] Sīnā. In four fuṣūl.</p><p dir=\"auto\">13. fol. 78b-93b: Risālah fī bayān māhīyat al-rūḥ wa-al-ḥayāt wa-al-nafs wa-al-ʻaql wa-aqsāmihā wa-tawābiʻihā.</p><p dir=\"auto\">14. fol. 94a-95b: [Extracts].</p><p dir=\"auto\">15. fol. 96a-98a: [Letter].</p><p dir=\"auto\">16. fol. 98b-116b: [Selections from Ḥall mushkilāt al-Ishārāt / Naṣīr al-Dīn al-Ṭūsī]. A commentary on Avicenna's al-Ishārāt wa-al-tanbīhāt.</p><p dir=\"auto\">17. fol. 117a-128a: [Extracts].</p><p dir=\"auto\">18. fol. 128a-130a: [Selections from ʻAwārif al-maʻārif / ʻUmar ibn Muḥammad al-Suhrawardī]. Interspersed with other extracts.</p><p dir=\"auto\">19. fol. 130b-131b: [Extracts].</p><p dir=\"auto\">20. fol. 132a-143a: [Selections from Rabīʻ al-abrār / Maḥmūd ibn ʻUmar al-Zamakhshārī].</p><p dir=\"auto\">21. fol. 143a-209a: [Extracts].</p><p dir=\"auto\">22. fol. 209b-211a: [Letters].</p><p dir=\"auto\">23. fol. 211b-255b: [Extracts].</p><p dir=\"auto\">24. fol. 255a-264a: [Persian treatise on the stations of the soul]. In 12 marḥalah; text begins in the middle of marḥalah 8.</p><p dir=\"auto\">25. fol. 264a-265b: [Letters].</p><p dir=\"auto\">26. fol. 266b-278a: Risālah-i sabʻah-i aqālīm / az taṣānīf-i ... Naṣīr al-Dīn Muḥammad Ṭūsī.</p><p dir=\"auto\">27. fol. 279a: [Extract].</p><p dir=\"auto\">28. fol. 280b-361a: [al-Ruʼyā wa-al-taʻbīr] / al-Shaykh al-Raʼīs Abū ʻAlī ibn ʻAbd Allāh ibn Sīnā.</p>",
      "IslamicManuscriptsNewSeriesno459": "<p dir=\"auto\">[1693 AD] Collection of Shiite texts on a variety of topics, interspersed with extracts.</p><p dir=\"auto\">1. fol. 1a-8a: Risālah dar mabdaʼ va maʻād / [Athīr al-Dīn al-Abharī].</p><p dir=\"auto\">2. fol. 8b-18b: [On the eight principles of religion].</p><p dir=\"auto\">3. fol. 18b-19a: Mimmā yanfaʻu lil-ramad. Extract in Arabic.</p><p dir=\"auto\">4. fol. 19a-20a: Masʼalah / min taṣnīf nawwāb khātim al-mujtahidīn Mīr Muḥammad Bāqir. Answers to several legal matters; in Arabic.</p><p dir=\"auto\">5. fol. 20a-21b: Qāla ṣāḥib Kitāb Taqwīm al-qiblah / [al-Bīrūnī?]. Extract in Arabic.</p><p dir=\"auto\">6. fol. 21b-25a: Min Kitāb Ikhwān al-Ṣafā. Extract in Arabic.</p><p dir=\"auto\">7. fol. 25b-35a: ʻAsharah-i kāmilah / Muʻizz al-Dīn Muḥammad ibn al-Ḥasan al-Mūsavī.</p><p dir=\"auto\">8. fol. 35a-35b: Min Kitāb Aḥsan al-kabāyir fī maʻrifat al-aʼimmah al-aṭhār. Tradition concerning the imams in Arabic.</p><p dir=\"auto\">9. fol. 35b-37a: Min al-Kashkūl : ilzām mukhālifīn bi-naṣṣ kalām mujīd / [Bahāʼ al-Dīn al-ʻĀmilī]. Extract in Persian and Arabic.</p><p dir=\"auto\">10. fol. 37b-43a: [Ṣiyagh al-ʻuqūd va al-nikāḥ / Muḥammad Bāqir al-Majlisī].</p><p dir=\"auto\">11. fol. 43a-43b: Ṣūrat ʻaqd al-mutʻah / min amlāʼ khātim al-mujtahidīn al-Shaykh ʻAlī ibn ʻAbd al-ʻĀlī. In Arabic.</p><p dir=\"auto\">12. fol. 43b-44b: [Answers to questions / Ḥasan al-ʻAskarī].</p><p dir=\"auto\">13. fol. 44b-59b: [Ikhtiyārāt al-ayyām] / Muḥammad Bāqir ibn Muḥammad Taqī.</p><p dir=\"auto\">14. fol. 59b-60a: Nuqila min Ḥadīqat al-shīʻah. Ḥadīth in Arabic.</p><p dir=\"auto\">15. fol. 60b-85a: Ṣaḥīfat al-Riḍā.</p><p dir=\"auto\">16. fol. 85b-106a: Lubb al-ḥasanāt / [Fayḍ al-Kāshī].</p><p dir=\"auto\">17. fol. 106a-106b: Munājāt al-imām al-maʻṣūm Imām Zayn al-ʻĀbidīn. Prayer in Arabic.</p><p dir=\"auto\">18. fol. 106b: Li-afḍal al-muḥaqqiqīn wa-al-mudaqqiqīn Naṣīr al-Millah wa-al-Dīn al-Ṭūsī. Poem in praise of ʻAlī ibn Abī Ṭālib; in Arabic.</p><p dir=\"auto\">19. fol. 107a-108a: Fī taḥqīq al-kabāʼir / lil-shaykh al-ajall al-sanad ... Bahāʼ al-Millah wa-al-Dīn Muḥammad. Extract in Arabic.</p><p dir=\"auto\">20. fol. 108a-109a: [Anecdote concerning Jaʻfar al-Ṣādiq told by Abū Ḥanīfah]. In Arabic.</p><p dir=\"auto\">21. fol. 109a-110b: [Ḥadīths]. In Arabic.</p><p dir=\"auto\">22. fol. 111b-145a: [Treatise on the validity of lineage through women] / Muḥammad Hādī ibn Muʻīn al-Dīn Muḥammad al-Sharīf al-Shīrāzī.</p>",
      "Garrett52B": "<p dir=\"auto\">[Treatise on ancient, alchemical and magical alphabets], 18th century</p><p dir=\"auto\">Treatise on ancient, alchemical and magical alphabets and their use in talismans and magic, with tables, incomplete at end. Contains also transcriptions of secret scripts used in a series of texts, such as the Rasāʾil Ikhwān al-Ṣafāʾ (fol. 30a-b).</p><p dir=\"auto\">Fol. 1a-22a: 24 scripts (from the language of Adam to the Kūfī script, which appeared during the reign of ʻAlī) -- fol. 22b-23b: consideration on scripture in general and the Arabic script -- fol. 23b-34a: the seven \"al-aqlām al-musnadah\" -- fol. 34b-37b: the seven ancient \"al-aqlām al-musnadah\" -- fol. 37b-40b: other scripts (qummī, fahlawī, etc.) -- fol. 41b-45b: al-aqlām al-sīmīyā -- fol. 46a-b: blank.</p><p dir=\"auto\">=> Acquired by Robert Garrett from Brill, Leyden, 1925, from the books of Murād Bey Bārūdī (Beirut).</p>",
      "Garrett832Y": "<p dir=\"auto\">17th or 18th century majmūʿa containing many different excerpts (largely theological at first glance?), of which a little bit of Ikhwān (unidentified what exactly), see full list of contents here: <a href=\"https://catalog.princeton.edu/catalog/5571290\" target=\"_blank\">https://catalog.princeton.edu/catalog/5571290</a><strong> </strong></p><p dir=\"auto\">=> Acquired from Yahuda</p>"
    }
  },
  "Qadmus": {
    "Private library?": {
      "NA": "<p dir=\"auto\">A copy of <span class=\"italics\">Risālat jāmiʿat al-jāmiʿa</span> mentioned by Arif Tamur as one the MSS he used for his edition. He provides no further details about any of the MSS he used.</p>"
    }
  },
  "Qazvin": {
    "Imām Ṣādiq": {
      "276": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span> (Persian) fragment from 1st up to 4th risala. An apparently pretty nasta’liq.</p>"
    }
  },
  "Qom": {
    "Golpāygānī": {
      "4174704": "<p dir=\"auto\">Ascertain call number in Fehrestegan. <span class=\"italics\">Mujmal al-ḥikma</span>, 11th/17th C (ownership note dated to 1084/1673-4).</p>",
      "۲۵۱۴۶۵۰۵۶۱۱": "<p dir=\"auto\">Ascertain call number in Fehrestegan. <span class=\"italics\">Mujmal al-ḥikma</span>, 13th/19th C.</p>",
      "۵۸۷۲۴۵۷": "<p dir=\"auto\">Ascertain call number in Fehrestegan. <span class=\"italics\">al-Risāla al-Jāmiʿa</span> (evident from colophon cited). Copyist Muḥammad ʿAlī Ḥusaynī. Naskh script. 166 folios, 15-17 lines per page, 24,5x18,5cm.</p><p dir=\"auto\">آغاز: بلا استکبار و مره االله سبحانه من الملائکة عن السجود لإدم الذين هم العالمون ... و ذکرنا ان في کتبنا المحکمة و رسائلنا المتقنة انه يجب علي الناظر فيها ان يبدأ فيها؛</p><p dir=\"auto\">انجام: واخفي له ما في السموات و ما في الارض و ما تحت الثري و الحمدالله اولا و آخرا و نسأله لسان ًا ذاکر ًا و قلبا شاکر ًا و صلي االله علي سيدنا محمد و آله و سلم تسليم ًا کثير ًا تمت الرسالة الجامعة</p>",
      "۶۸۵۱۳۵۳۱": "<p dir=\"auto\">Ascertain call number in Fehrestegan. An apparently nicely produced full copy of the <span class=\"italics\">Rasāʾil.</span> 15 Rab II 1233 / 22 February 1818. Copyist Muḥammad Bāqir b. Muḥammad Ḥusayn Muḥammad Ābādī Jarqawiyya Iṣfahānī.</p><p dir=\"auto\">533 folios, page 29x18cm.</p><p dir=\"auto\">آغاز: بسمله الحد الله الذي لا يحسن الاشياء الا ان يکون بداها احمده و کل ناطق؛</p><p dir=\"auto\">انجام: و صارت واحدة و علي هذه الجملة تتولد الصاعقة و هذا ما اردنا الا نبين و من االله التوفيق.</p>"
    },
    "Marʿashī": {
      "37163": "<p dir=\"auto\">Extract from a Persian translation in majmūʿa, 1097/1685-6. Nasta’liq. Copyist: Ṣadr al-Dīn Muḥammad Ḥusaynī. 10 folios (78p-87r), size 12x21cm.</p>",
      "5300": "<p dir=\"auto\">Full copy from the 11th/17th C. Likely including Fihrist. Apparently a rather luxurious copy: extensively rubricated and decorated in gold, blue and red, floral motifs.</p><p dir=\"auto\">878 folios, 21 lines per page, 27x15,5cm.</p>",
      "78697870": "<p dir=\"auto\">Two volumes of what appears to be a full copy. Dated to 848/1444-5 (7870 dated to Dated to 1 Rabīʿ I 848/27 June 1444).</p><p dir=\"auto\">7869: Seals reading “ʿabduhu al-Rājī Faḍl Allāh Ṣāliḥī”; “dhālika Faḍl Allāh yuʾtīhu man yashāʾ”; “ʿabduhu Muḥammad Mahdī b. Abū al-Qāsim.” 156 folios, 29 lines, 21x14cm.</p><p dir=\"auto\">7870: colophon notes copyist Maḥmūd b. Dawlatkhān Wāhiyāri Dakkawī.</p><p dir=\"auto\">120 folios, 21x14cm.</p><p dir=\"auto\">Entry for vol. 2 on Khizana: <a href=\"https://khizana.bibliotheca-arabica.de/#id:AfKA6uTVVBM7nxchrSGW\" target=\"_blank\">https://khizana.bibliotheca-arabica.de/#id:AfKA6uTVVBM7nxchrSGW</a></p>",
      "10454": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>. 7 Muḥarram 1272 / 19 September 1855. Seal of “Sulaymān al-Sharīf”. 136 folios, 15 lines per page.</p>",
      "12456": "<p dir=\"auto\">Mujmal al-ḥikma, 1085/1674-5. Nasta’liq. 163 folios, 15 lines per page.</p>",
      "13421": "<p dir=\"auto\">Abridged risāla 4.1 by Fayḍ Kāshānī in Arabic apparently in verse? Late 11th C. This MS is possibly the author’s holograph.</p><p dir=\"auto\">Seals:</p><p dir=\"auto\">Naṣīr al-Dīn Sulaymān b. Muḥammad ʿAlam al-Hadī b. Fayḍ Kāshānī dated to 1117</p><p dir=\"auto\">Abū Turāb ibn Nasir al-Din Sulayman (grand son of al-Fayḍ Kāshānī)</p><p dir=\"auto\">Waqf by this same Abū Turāb al-Fayḍī</p><p dir=\"auto\">52 folios; nastaʾliq; luxurious copy apparently;</p><p dir=\"auto\">آغاز: الحمدالله و الصلاة علي رسول االله و علي اهل بيت رسول االله، اما بعد، فهذا الملخص الرسالة الاولي من القسم الرابع من كتاب اخوان الصفا؛</p><p dir=\"auto\">انجام: و عليها تقع المجازاة و المكافاة من الثواب و العقاب، انتهي كلامه بتلخيص و اختصار، و الحمدالله و الصلاة علي محمد و آله</p>",
      "136601": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>. Copied by Muḥsin b. Muḥammad Bāyazīd Bisṭāmī on 27 Muḥarram 1071/2 October 1660, apparently between Ṭayyibeh Ashraf (?) and Bastam. Ayātollah Marʿashī Najafī’s stamp which notes that ʿAlī is preferrable over Muḥammad.</p>",
      "16163": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>. Acephalous copy. 12th/18th C. Seal reading “Muḥammad”, Bayḍawī (?). 177 folios, 16 lines per page.</p>",
      "7568": "<p dir=\"auto\"><span class=\"italics\">al-Risāla al-Jāmiʿa</span>. 11th/17th C, ownership note from Kāẓīm ibn Ja'far ibn Khalil ibn Muhammad Ismail ibn Muhammad Mahdi on the date of Rabi al-Thani 1225. 121 folios, incomplete copy.</p>"
    },
    "Masjid-i Aʿẓam": {
      "1397": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>, seal of “ʿabduhu ʿAbd Allāh 1198”</p>",
      "1830": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>, nasta’liq script.</p>"
    },
    "Markaz-i iḥyāʾ-i mīrāth": {
      "353": "<p dir=\"auto\">Persian translation, 198 folios, 11th C => microfilm: ʿUlūm-i ʿaqlī-yi islāmī Library 155 ʿaksī</p><p dir=\"auto\">Last page, possession note of Darwish Ibrahim, son of Darvish Mahmoud.</p><p dir=\"auto\">Description of contents (included rasa’il) given on NLAI:</p>"
    }
  },
  "Rabat": {
    "Bibliothèque nationale du royaume de Maroc": {
      "alKhiznaalkattniyya365": "<p dir=\"auto\">Partial copy of <span class=\"italics\">Rasāʾil ikhwān al-</span>ṣafāʾ. Catalogue of al-Kattāniyya collection (ʿAbd al-Ḥayy al-Kattānī (d. 1382/1962)) on website of BNRM only has first half of the collection, doesn’t include this MS.</p><p dir=\"auto\">This MS has been mentioned as of special importance by de Vaulx d’Arcy.</p><p dir=\"auto\">186 pages, 21 lines per page</p><p dir=\"auto\">Includes fihrist and first qism. Naskh script written in red mistara, Maghrebi script on flyleaf.</p><p dir=\"auto\">Catchwords in Maghrebi script</p><p dir=\"auto\">6b: <span class=\"italics\">fihrist</span> concludes on note attributed to Abū Sulaymān (also in Atif Efendi 1681)</p><p dir=\"auto\">Maghrebi correction/addition on 36b, Maghrebi notes 51b, 52a, 52b, 54b; 88b—90a, 92a; 170a, 171a, 172a, 174a => to be confirmed whether these are by al-Kattānī or an earlier Maghrebi scholar</p><p dir=\"auto\">50a: title page risala 1.4 on music</p><p dir=\"auto\">76b: title risala 1.5 on geography</p><p dir=\"auto\">87a: title page risala 1.6</p><p dir=\"auto\">95a: title page risala 1.7</p><p dir=\"auto\">102a: title risala 1.8</p><p dir=\"auto\">110b: title risala 1.9 (in bold black ink unlike preceding titles which were in red ink)</p><p dir=\"auto\">156a: titlr risala 1.10 isagoge</p><p dir=\"auto\">163b: title risala 1.11 categorius</p><p dir=\"auto\">168b: title risala 1.12 + stamp (?) maktaba al-Kattāniyya in Fez (d. 1962)</p><p dir=\"auto\">175b: start risala 1.14 (matches OpenITI) but no title given</p><p dir=\"auto\">186b: colophon, dated middle Shaʿbān 619 (September/October 1222) in Konya, copyist Ismāʿīl b. ʿUmar b. Badl al-khaṭīb al-D-m-ḥ-rqānī (according to Arabic Manuscripts Institute rather copied in 617)</p><p dir=\"auto\">Several open spaces for diagrams which haven’t been included in first few rasa’il</p>"
    }
  },
  "Rampur": {
    "Raza Library": {
      "3473651D": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span> complete (“nice”) copy<span class=\"italics\">,</span> 10/16th C; 757 folios; seal of ʿAlī Muẓaffar Khān; decorated with gold lawḥ</p>",
      "347419M": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span> complete copy<span class=\"italics\">,</span> 11th/17th C; seal of M. ʿAẓmat Allāh (dated 1219/1804-5)</p>",
      "3475330D": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil 1-14 =</span> qism 1; 1140/1727; luxuriously produced, every risala has a lawh, gold and coloured and blue. Seal of ʿAbd al-Qādir Muḥammad Shāhī</p>"
    }
  },
  "Riyadh": {
    "Jāmiʿat al-imām Muḥammad b. Saʿūd al-islāmiyya": {
      "Unknowncallnumber": "<p dir=\"auto\">Very little info available. I assume it is a partial copy because of its size of 280 folios with 18 lines per page, which seems too little to cover the full text.</p><p dir=\"auto\">The manuscript was copied by ʿAbd al-Raḥīm b. shaykh Maḥmūd Multānī.</p>",
      "Unknowncallnumber2": "<p dir=\"auto\">Only info available is the title and the fact that the manuscript contains 201 folios. This seems too little to cover the full text hence why I assume it is a partial copy.</p>",
      "6671?": "<p dir=\"auto\">“Mukhtaṣar Rasāʾil ikhwān al-ṣafāʾ ʿalā al-tamām waʾl-kamāl waʾl-ḥamdu liʾl-Lāh ʿalā kull ḥāl...”</p><p dir=\"auto\">60 folios.</p><p dir=\"auto\">Authorship attributed to Dāwūd b. ʿUmar al-Anṭākī (d. 1008/1559), a famous physician and scholar of the 16th century. Compare MS Ankara Adnan Ötüken İl Halk Kütüphanesi 06 Hk 1454 (where there is no authorship attribution on title page).</p><p dir=\"auto\">First page of likely this MS available here (download link for whole MS is dead), whence the shelfmark: <a href=\"https://ketabpedia.com/تحميل/مختصر-رسائل-اخوان-الصفا/\" target=\"_blank\">https://ketabpedia.com/تحميل/مختصر-رسائل-اخوان-الصفا/</a></p><p dir=\"auto\">Basic data on the MS in Arabic but no shelfmark noted: <a href=\"https://eservices.kfnl.gov.sa:8060/mans/Home/Details/bc2225aa-bb9b-50d2-74c7-41d3e1f8a02a\" target=\"_blank\">https://eservices.kfnl.gov.sa:8060/mans/Home/Details/bc2225aa-bb9b-50d2-74c7-41d3e1f8a02a</a></p>"
    },
    "Maktabat al-Malik ʿAbd al-ʿAzīz al-ʿāmma": {
      "31243": "<p dir=\"auto\">A mukhtaṣar of the Rasāʾil. Title on title page has been partly wiped out, so authorship unclear: “Mukhtaṣar Rasāʾil ikhwān al-ṣafāʾ ʿalā al-tamām … ʿAlī …”</p><p dir=\"auto\">48 folios, 23 lines per page. Rubrication for section markers (<span class=\"italics\">faṣl</span>) and epistle titles, some of these rubrications for epistles have developed a sheen which make them difficult to read on the scan available.</p><p dir=\"auto\">Dated mid-Rajab 1284/November 1867</p><p dir=\"auto\">Some epistles summarised very short, others over multiple pages.</p><p dir=\"auto\">0b - First epistle: akhlāq</p><p dir=\"auto\">6a - Second epistle: Isagoge</p><p dir=\"auto\">7a - Third epistle: Categorias</p><p dir=\"auto\">8a - 4 - Arminias</p><p dir=\"auto\">8b - 5 - Analitica al-ṣughrā</p><p dir=\"auto\">8b - 6 - Analitica al-kubrā</p><p dir=\"auto\">9b - 7 - al-ṣanā’iʿ al-ʿilmiyya</p><p dir=\"auto\">11a - 8 - al-ṣanā’iʿ al-ʿilmiyya</p><p dir=\"auto\">12a - 9 - akhlāq al-lughāt</p><p dir=\"auto\">12a - 10 - al-mabādī</p><p dir=\"auto\">12b - 11 - on the meaning of the philosopher’s statement that man as microcosm</p><p dir=\"auto\">12b - 12 - al-akwār wa-l-adwār</p><p dir=\"auto\">14b - 13 - al-ʿāqil wa-l-maʿqūl</p><p dir=\"auto\">15a - 14 - al-ʿilal al-nafsāniyya</p><p dir=\"auto\">15b - 16 - risālat al-fihrist al-rasāʾil</p><p dir=\"auto\">16a - 17 - al-ʿadad</p><p dir=\"auto\">17b - 18 - j-r…</p><p dir=\"auto\">19a - 19 - asṭrāwnumiyā yaʿnī ʿilm al-nujūm</p><p dir=\"auto\">20b - 20 - music</p><p dir=\"auto\">22b - 21 - geography? (Scan unclear, but discusses aqālīm and the earth etc.)</p><p dir=\"auto\">24b - 22 - al-nasab</p><p dir=\"auto\">25a - 23 - al-hayūlī wa-l-…</p><p dir=\"auto\">25b - 24 - al-mā wal-ʿālam</p><p dir=\"auto\">27b - 25 - al-kawn wa-l-fasāda</p><p dir=\"auto\">27b - 26 - al-anār al-ʿalawiyya</p><p dir=\"auto\">28b - 27 - takwīn al-maʿādin</p><p dir=\"auto\">30a - 28 - māhiyya al-ṭabīʿiyya</p><p dir=\"auto\">30b - 29 - ajnās al-nabāt</p><p dir=\"auto\">31a - 30 - al-ḥayawān</p><p dir=\"auto\">32a - 31 - al-ḥāss wa-l-maḥsūs</p><p dir=\"auto\">32a - 32 - man as microcosm</p><p dir=\"auto\">33b - 33 - … al-juzʾiya</p><p dir=\"auto\">33b - 34 - al-insān fī al-ʿulūm wa-l-maʿārif</p><p dir=\"auto\">34a - 35 - māhiyya … wa-l-ḥayāt</p><p dir=\"auto\">34a - 36 - …</p><p dir=\"auto\">34b - 37 - al-mabādī al-ʿaqliyya</p><p dir=\"auto\">35a - 38 - al-mabādī ʿalā raʾy ikhwān al-Ṣafāʾ</p><p dir=\"auto\">35b - 39 - māhiyya al-ʿashq</p><p dir=\"auto\">35b - 40 - …</p><p dir=\"auto\">36a - 41 - al-ḥarakāt</p><p dir=\"auto\">36b - 42 - al-ḥudūd wa-l-rusūm</p><p dir=\"auto\">37a - 43 - …</p><p dir=\"auto\">39a - 44 - al-daʿwā ilā Allāh</p><p dir=\"auto\">39a - 45 - iʿtiqād ikhwān al-Ṣafāʾ</p><p dir=\"auto\">39a - 46 - …</p><p dir=\"auto\">39b - 47 - … al-nubuwwa</p><p dir=\"auto\">40b - 47 (bis) - al-nāmūs wa-sharāʾiṭ al-nubuwwa</p><p dir=\"auto\">41a - 48 - kayfiyya …</p><p dir=\"auto\">41b - 49 - al-rūḥāniyyāt</p><p dir=\"auto\">42a - 50 - …</p><p dir=\"auto\">47b - 51 - al-kahāna wal-fāl</p><p dir=\"auto\">48b - 52 - al-siyāsāt</p><p dir=\"auto\">48b - colophon:</p><p dir=\"auto\">وكان الفراغ من تحرير هذه الرسائل يوم الاحد المبارك الموافق ١٧ خلت من</p><p dir=\"auto\">شهر رجب الذي هو من شهور سنه ١٢٨٤ اربع</p><p dir=\"auto\">وثمانين ومايتين والف من هجرة من له العز</p><p dir=\"auto\">والشرف صلى الله عليه وسلم</p><p dir=\"auto\">على يد الفقير الى الله تعالى</p><p dir=\"auto\">محمد ال… ابن</p><p dir=\"auto\">المرحوم مصطفى</p><p dir=\"auto\">عز الله له</p><p dir=\"auto\">ولوالديه</p><p dir=\"auto\">امين</p>",
      "33551": "<p dir=\"auto\">Partial copy of <span class=\"italics\">Rasāʾil</span>. Starts with <span class=\"italics\">Fihrist</span>, end unclear but certainly not a full copy given the limited number of folios.</p><p dir=\"auto\">152 folios, 21 lines per page. Rubricated.</p>",
      "329132": "<p dir=\"auto\">The epistle on magic included in a <span class=\"italics\">majmūʿa</span> (folios 62b-178b). 116 folios, 16 lines per page.</p><p dir=\"auto\">In the manuscript the text is preceded by a copy of “Nuzhat al-Nufūs wa-muzīl al-ʿukūs” attributed to Abū al-Ḥasan ʿAlī b. al-Fāḍil al-Madanī al-Maghribī, apparently a work on geomancy (<span class=\"italics\">raml</span>). (<a href=\"https://eservices.kfnl.gov.sa:8060/mans/Home/Details/0a3ad461-a957-4820-a758-cf5d2567c980\" target=\"_blank\">https://eservices.kfnl.gov.sa:8060/mans/Home/Details/0a3ad461-a957-4820-a758-cf5d2567c980</a> )</p>"
    },
    "King Faisal Center": {
      "219": "<p dir=\"auto\">Partial copy of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span> (appears partial because of limited folio number). Appears to start at 1.1, first folios replaced by another hand.</p><p dir=\"auto\">Dated 1054/1644.</p><p dir=\"auto\">286 folios, 33 lines per page.</p><p dir=\"auto\">Copyist is Aḥmad b. Sharaf al-Dīn. Copied for wālī Ḥasan Bāshā ṣāḥib al-fukhār (?). Apparently has consultation notes by shaykh al-Azhar Ḥasan b. Muḥammad al-ʿAṭṭār (<a href=\"https://ar.wikipedia.org/wiki/حسن_العطار\" target=\"_blank\">https://ar.wikipedia.org/wiki/حسن_العطار</a>) and Maḥmūd Abī l-Wahāb.</p><p dir=\"auto\"><a href=\"https://library.kfcris.com/cgi-bin/koha/opac-detail.pl?biblionumber=961189\" target=\"_blank\">https://library.kfcris.com/cgi-bin/koha/opac-detail.pl?biblionumber=961189</a></p>",
      "220": "<p dir=\"auto\">Partial copy of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ. </span>Appears to start with fihrist, then epistle 1.1, and appears to end in 1.7 (based on opening and closing lines transcribed). Unclear whether the folios in between would cover the epistles between those two following the standard order.</p><p dir=\"auto\">Two data sources, one dates it to 11th/17th C,</p><p dir=\"auto\">406 (or 411) folios, 21 lines per page.</p><p dir=\"auto\">Two different scribes.</p><p dir=\"auto\">Ownership mark Muḥammad ʿĀrif [al-ʿAskarī bi-Dār al-khilāfa = this last info only on data source 1]. The MS also contains a bibliographic note about the text lifted from Ḥajjī Khalīfa’s <span class=\"italics\">Kashf al-ẓunūn</span>.</p>",
      "05287": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-Ṣafāʾ</span>, maybe a full copy.</p><p dir=\"auto\">407 folios, 24x18cm.</p>",
      "05942": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-Ṣafāʾ</span>, maybe a full copy.</p><p dir=\"auto\">478 folios, 23x16,8 cm.</p>",
      "2674": "<p dir=\"auto\">Partial (but acephalous, so likely originally full) copy of <span class=\"italics\">Rasāʾil ikhwān al-Ṣafāʾ</span>, starting from 1.9 up to epistle on magic (based on last lines reproduced on database).</p><p dir=\"auto\">Copied in ʿAkkā. The date 1289/1872 is given only on the furqan database.</p><p dir=\"auto\">259 folios, 13-17 lines per page, 20,3x12,5.</p>"
    },
    "": {},
    "Maktabat Muḥammad b. ʿAbd al-Raḥmān al-ʿUbaykān": {
      "92": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-Ṣafāʾ</span>, (?), copied by Manṣūr b. Anwar ʿAlī, dated 1245/1829</p><p dir=\"auto\"><a href=\"https://digitallibrary.al-furqan.com/our_is_item/manid/2186892/groupid/0\" target=\"_blank\">https://digitallibrary.al-furqan.com/our_is_item/manid/2186892/groupid/0</a></p>"
    }
  },
  "Salamiyya": {
    "?": {
      "nonumber": "<p dir=\"auto\">A copy of <span class=\"italics\">Risālat jāmiʿat al-jāmiʿa</span> mentioned by Arif Tamur as one the MSS he used for his edition. He provides no further details about any of the MSS he used.</p>"
    },
    "Private amir library": {
      "nonumber": "<p dir=\"auto\">A copy of <span class=\"italics\">Risālat jāmiʿat al-jāmiʿa</span> mentioned by Ṣalibā as one the MSS he used for his edition of al-Risāla al-Jāmiʿa. Manuscript dated to 1241/1825.</p>"
    },
    "Private collection": {
      "nonumber": "<p dir=\"auto\">A copy of <span class=\"italics\">Risālat jāmiʿat al-jāmiʿa</span> dated to 1349/1930. Discussed with a few pages reproduced in Kacimi “Reflexiones sobre la relación de la Risalat Gami'at al-gami'a” (2015).</p>"
    }
  },
  "Sanaa": {
    "Dār al-Makhṭūṭāt wa-l-Maktabat al-Gharbiyya bi-l-Jāmiʿ al-Kabīr": {
      "2202": "<p dir=\"auto\">Rasāʾil ikhwān al-Ṣafāʾ, fourth qism (14 rasa’il). Copyist Yaḥyā b. Muḥammad, 8 Rabīʿ II 1292 / 1875. 245 folios, 15 lines, 22cmx18cm</p><p dir=\"auto\"><a href=\"https://digitallibrary.al-furqan.com/our_is_item/manid/1659418/groupid/0\" target=\"_blank\">https://digitallibrary.al-furqan.com/our_is_item/manid/1659418/groupid/0</a></p>"
    }
  },
  "Shiraz": {
    "National Library": {
      "110": "<p dir=\"auto\">Mujmal al-ḥikma (Persian), missing first and final pages. Mentioned in Danishpazhuh edition.</p>"
    },
    "ʿAlāma Ṭabāṭabāʾī": {
      "1261": "<p dir=\"auto\">Mujmal al-ḥikma. Nasta’liq, “research copy”, 11th century.</p>",
      "1262": "<p dir=\"auto\">Mujmal al-ḥikma. Nasta’liq, “research copy”, 11th century.</p>"
    }
  },
  "St. Petersburg": {
    "Institute of Oriental Studies": {
      "ArabicManuscriptsB1029": "<p dir=\"auto\">Majmūʿa containing Astrolabe risala)</p>"
    },
    "National Library of Russia": {
      "FirkovichYevrArabI3145": "<p dir=\"auto\">Fragment of Risāla on Magic (52b) in Judeo-Arabic. Discussed in Ehud Krinis, “Al-Risāla al-jāmi‘a and its Judeo-Arabic Manuscript” who dates the fragment to 7th-8th/13th-14th C Cairo. <a href=\"https://www.academia.edu/6104169/Al_Ris%C4%81la_al_j%C4%81mi_a_and_its_Judeo_Arabic_Manuscript\" target=\"_blank\">https://www.academia.edu/6104169/Al_Ris%C4%81la_al_j%C4%81mi_a_and_its_Judeo_Arabic_Manuscript</a></p>",
      "FirkovichYevrArabII1193551060448YevrArab1213": "<p dir=\"auto\">51 pages of <span class=\"italics\">al-Risāla al-Jāmiʿa</span> in Judeo-Arabic. Discussed in Ehud Krinis, “Al-Risāla al-jāmi‘a and its Judeo-Arabic Manuscript” who dates the fragments to pre-16th C Cairo. <a href=\"https://www.academia.edu/6104169/Al_Ris%C4%81la_al_j%C4%81mi_a_and_its_Judeo_Arabic_Manuscript\" target=\"_blank\">https://www.academia.edu/6104169/Al_Ris%C4%81la_al_j%C4%81mi_a_and_its_Judeo_Arabic_Manuscript</a></p>"
    }
  },
  "Tabriz": {
    "Central University Library": {
      "561": "<p dir=\"auto\"><span class=\"italics\">al-Risāla al-Jāmiʿa</span>, dated 1307/1889-90.</p>"
    },
    "Khādim Ḥusaynī": {
      "30": "<p dir=\"auto\">Partial copy of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span>: according to OpenITI match start in 3.3 (? man as microcosm), according to cataloguer start in 4 on “māhiyat al-ʿishq”, ends in Risala on Magic. Mention of “min kalām khulaṣāʾ al-ṣūfiyya.” Dated Jumādā I 670/December 1271-January 1272.</p><p dir=\"auto\">275 folios, 25 lines per page, 20x28cm.</p>"
    },
    "Edebiyat University Library": {
      "8": "<p dir=\"auto\"><span class=\"italics\">al-Risāla al-Jāmiʿa</span>, dated Rabīʿ I 1037/1627.</p>"
    },
    "National Library": {
      "3409": "<p dir=\"auto\">1057Q/1678 in Bandar Sūriyya, Persian translation of one epistle. 13 folios, size 18,5x11cm.</p><p dir=\"auto\">آغاز: تيمنا باسمه سبحانه، حمد و ثنا مالك الملكي را سزاست كه قرص آفتاب نمونه اي از قبه بارگاه كبرياي اوست؛</p><p dir=\"auto\">انجام: و انتها هم بتدبير و مشيت الهي و امر و حكم سماوي است فتدبر يا اخي في هذا الامر و تفكر في هذه اللتي بلغك االله ايانا و اخواننا اليه بمنه وجوده و كمال كرمه آمين يا رب العالمين لقد سود في بندر السوريه سنه ۱۰۵۷</p>"
    }
  },
  "Tashkent": {
    "Biruni Institute": {
      "560": "<p dir=\"auto\">Epistle 3.13 until end (?). 293 folios, paper size 25 x 17.</p><p dir=\"auto\">Dated Dhū al-Qaʿda 637/June 1240 (sic in database!), copyist Muḥammad b. Masʿūd b. Aḥmad al-Bukhārī</p><p dir=\"auto\">Authorship al-Bustī & al-Zanjānī (noted as such on database - to be ascertained —</p><p dir=\"auto\">ابو سليمان محمد بن نصى البستى المعروف المقدسى و ابو الحسن على بن هارون الزنجانى )</p>",
      "132364and5": "<p dir=\"auto\">Two extracts of <span class=\"italics\">Mujmal al- ḥikma</span> in <span class=\"italics\">majmūʿa</span>. Dated 1269/1852-53. Unclear why these two extracts were separated in the database, they are consecutive in the MS.</p><p dir=\"auto\">Copyist is: اوراض على مخذوم بن صفا مخذوم گورلانلی</p>"
    }
  },
  "Tbilisi": {
    "Georgian National Center of Manuscripts": {
      "OrientalCollection54": "<p dir=\"auto\">Persian translation, dated to 1031/1621-2, apparently noted as related to Muḥammad b. Ḥasan Ṭūsī.</p><p dir=\"auto\">An image of a MS included here but no call number given (+ saved to folder): <a href=\"http://astronomicalmanuscripts.ge/persian%20manuscripts.html\" target=\"_blank\">http://astronomicalmanuscripts.ge/persian%20manuscripts.html</a></p>"
    }
  },
  "Tehran": {
    "Anjumān-e āthār ve-mafākhir-i farhangī": {
      "100": "<p dir=\"auto\">Mujmal al-ḥikma (Persian). Fihristegan has long description of contents:</p><p dir=\"auto\">آغاز :ساعتبرآيندوحملوجوزاواسدوميزانوقوسودلو نراند؛ انجام: و از قوت بفعل آرد و ديگر را عقل مستفاد گويند.\nاين نسخه نفيس خلاصه ترجمه رسائل اخوان الصفاست كه از نيمه رساله دوم از قسم اول رياضيات در مدخل هندسه آغاز\nميشود تا صفحه ۶، از قسم اول رياضيات در مدخل نجوم، از قسم اول رياضيات در موسيقي، رساله ۵. از قسم اول رياضيات در هيئت زمين، رساله ۶. از قسم اول رياضيات در نسبت عدد هندسي، رساله ۷. از قسم اول رياضيات در صنعتهاي عملي، رساله ۸. از قسم اول رياضيات در طبيعتهاي عملي، رساله ۹. از قسم اول رياضيات در خلقت بني آدم، رساله۱۰. از قسم اول رياضيات\nدر ايساغوجي در منطق، رساله ۱۱. از قسم اول رياضيات در قاطيغورياس در منطق، رساله ۱۲. از قسم اول رياضيات از باريمينياس در منطق، رساله ۱۳. از قسم اول رياضيات از انولوطيقا در منطق، رساله ۱۴. از قسم اول رياضيات از انولوطيقا در منطق، رساله ۱. در قسم دوم در هيولي و صورت، رساله ۲. از قسم دوم در سماء و عالم، رساله ۳. از قسم دوم در كون و فساد، رساله ۴. از قسم دوم در آثار علوي، رساله ۵. از قسم دوم از عقليات )كذا في النسخه در متن چاپي: در تكوين معادن(، رساله ۸. از طبيعيات در تركيب حد، رساله ۱۰. از قسم دوم از طبيعيات در نفس، رساله ۱۳. از قسم دوم طبيعيات در جمع كردن، علمها، رساله ۱۴. از قسم دوم طبيعيات در حكمت مرگ، رساله ۱۵. از قسم دوم طبيعيات در بيان الم و لذت، رساله ۱۶. از قسم دوم طبيعيات در اختلاف لغات، رساله ۱. از قسم سوم عقليات در مبادي عقل بر رأي فيثاغورس، رساله ۲. از قسم سوم عقليات در مبادي عقل بر راي حكماء، رساله ۳. از قسم سوم عقليات در آنكه عالم حيواني بزرگ است، رساله ۴. از قسم سوم عقليات در عقل و معقول، رساله ۵. از قسم سوم عقليات در عقل و معقول، رساله ۵. از قسم سوم عقليات در ادوار كواكب، رساله ۶. از قسم سوم عقليات در درجه عشق، رساله ۷. از قسم سوم عقليات در قيامت و بعث و نشور، رساله ۸. از قسم سوم عقليات در حركتها، رساله ۹. از قسم سوم عقليات در علت و معلول، اين رساله به پايان نرفته و ناتمام است، از صفحه ۳۷۳ مبحث حدود رساله اخوان الصفا آمده و اين رساله از حد هيولي شروع ميشود و تا حد عقل ميآيد؛ خط: نسخ كهن، بیكا، تا: محتم ًلاقرن۷؛ افتادگي: آغاز و انجام؛ كاغذ: سمرقندي، جلد: گالينگور، ۴۱۸ص، ۱۳ سطر )۱۱/۵*۱۸(، اندازه:</p><p dir=\"auto\">۱۶*۲۲سم ]ف: -۱۳۷[</p>"
    },
    "Dānishgāh-i Adabiyyat Library": {
      "2990D": "<p dir=\"auto\">Extract of 19 folios in majmūʿa. Dated to 700/1300-1.</p>",
      "7816J": "<p dir=\"auto\">27 Muḥarram 1063 / 1652; extract in <span class=\"italics\">majmūʿa</span>, nasta’liq; Rasāʾil Ikhwān al-Ṣafāʾ wa-Taʾrīkh Yāfiʿī</p>",
      "120D": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>. Copied by Muḥammad Rabīʿ b. ʿĀrif Fīrūzābādī in 22 Muḥarram 1046 / June 26 1636. Marginal commentary by a certain Qazwīnī.</p><p dir=\"auto\">244 folios, 16 lines per page.</p>",
      "3367ikmat": "<p dir=\"auto\">Extract in <span class=\"italics\">majmūʿa</span>. Copied 21 Jum II 1276 / 6 January 1860 in Tehran.</p>"
    },
    "Doctor Yūsuf Nīrī (private library?)": {
      "Unknownnumber": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>. Mentioned in Danishpazhuh edition.</p>"
    },
    "Dā'irat al-maʿārif-i buzurg-i islāmī": {
      "8010": "<p dir=\"auto\">7 epistles from<strong> </strong><span class=\"italics\">Mujmal al-ḥikma</span> in <span class=\"italics\">majmūʿa</span>. 28 folios (308p-335r). Contents:</p><p dir=\"auto\">بخشهايي از آن است: ۱. رساله سيم در مدخلي مختصر از نجوم، ۲. خلاصه رساله دوم از قسم دوم در سماء عالم، ۳. خلاصه رساله\nسيم از قسم دوم در كون و فساد عالم، ۴. خلاصه رساله چهارم از قسم دوم در آثار علوي ۵. خلاصه رساله پنجم از قسم سيم در ادوار كواكب ۶. رساله اول در مدخلي از عدد ۷. خلاصه رساله دوم از قسم اول در مدخلي از هندسه</p><p dir=\"auto\">Copied by Kāẓim b. Āghā Kūchik Khāmūsh Iṣfahānī in 1279/1862-3.</p>",
      "823aks": "<p dir=\"auto\">(microfilm?), 7th century; some owernship notes: Sa’d ibn Abi al-Mafakher al-Hussein ibn As'ad Afzal ibn Shahriyar al-Mashhour Muharram 640 + note written in Safar 141 (1141?)</p>",
      "1662aks": "<p dir=\"auto\">Microfilm? but no origin noted. Full copy of <span class=\"italics\">Rasāʾil</span>, starts with fihrist, 51 epistles. Nastaʿlīq script. Copied Rabīʿ I 1075 / Sep-Oct 1664.</p>",
      "1700": "<p dir=\"auto\"><span class=\"italics\">al-Risāla al-Jāmiʿa</span><span class=\"italics\"> </span>156 folios but seemingly complete (29 lines per page). Attributed to Majrīṭī? Dated to 3 Rajab 684/1285. Copied by Muḥammad b. Muḥammad al-muṭabbib al-Dimashqī.</p>",
      "1847aks": "<p dir=\"auto\"><strong> </strong>(microfilm? No origin noted in Fehrestigan) <span class=\"italics\">Mujmal al-ḥikma</span> (Persian). 10th-11th C.</p>",
      "113": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>, 14 Rajab 1059/24 July 1649. 41 treatises. 138 folios, 15 lines per page.</p>"
    },
    "Fakhr al-Dīn Naṣīrī (private library?)": {
      "324": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>. Copied in 1048/1638-9. Mentioned in Danishpazhuh edition.</p>"
    },
    "Golestan": {
      "1892": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span> (Persian), 189/2. Dated to Ramaḍān 1056/December 1642, based on an from 702. Mentioned in text edition by Danishpazhuh.</p>"
    },
    "K. Markazī Dānishgāh-i Tehrān": {
      "43643F": "<p dir=\"auto\">Extract in <span class=\"italics\">majmūʿa</span> folio 211-219, “al-ṣināʿa al-ʿilmiyya min rasāʾil ikhwān al-ṣafāʾ”, Arabic, nasta’liq — probably microfilm from this original: بغداد لی وهبی ش ۲۰۲۳</p>",
      "120": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span> (in colophon called “Muntakhab al-ḥikma”). Folio 3b has in different script a note that names the text as Mujmal al-ḥikma next to the place where the body text identifies this title as well. The note also identifies it as a translation from the Arabic <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ.</span></p><p dir=\"auto\">Dated to 22 Dhū al-Ḥijja 1046 / 17 May 1637. Copyist Muḥammad Rabīʿ b. ʿĀrif Fīrūzābādī.</p><p dir=\"auto\">244 folios (unfoliated). 16 lines per page. Fairly composed nastaʿlīq script. Rubrication for section titles. Some marginalia (some in pencil) and extensive notes in flyleaves. One of them contains a stamp as well.</p>",
      "3021": "<p dir=\"auto\">Mujmal al-ḥikma, but apparently variant contents (no animals epistle). Copied 22 Rajab 1111/13 January 1700, by Muḥammad Kāẓim b. Muḥammad Ḥusayn Ḥusaynī Maḥallātī (محمد كاظم بن محمد حسين حسيني محلاتي ).</p>",
      "111316": "<p dir=\"auto\">Extracts from <span class=\"italics\">Mujmal al-ḥikma</span> in <span class=\"italics\">majmūʿa.</span> 21 folios (139r-160r). Contents: 4.1-4.4., 4.8, 2.5, 3.3, 1.1. Nastaʿlīq script.</p>",
      "1155": "<p dir=\"auto\">Full copy of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span></p><p dir=\"auto\">Copyist Muḥammad b. Muḥammad b. Bahāʾ al-Dīn Anṣārī Hawī (محمد بن محمد بن بهاءالدين انصاري هوي), 18 Shaʿbān 968/14 May 1561 in Cairo.\n\nFourth and fifth treatise reversed. No fihrist. Many differences in order compared to printed version.</p><p dir=\"auto\">Ownership:</p><p dir=\"auto\">Farhād Mīrzā 12 Shaʿbān 1265 / 3 July 1849</p><p dir=\"auto\">ʿAbdallāh b. ʿAbd al-Qādir Sawjbalāghī Makrī (عبداالله بن عبدالقادر ساوجبلاغي مكري ) bought it 1329/1911</p><p dir=\"auto\">First lines:</p><p dir=\"auto\">بسمله. به الحول و القوة. الحمدالله الذي لاتحسن الاشياء الا ان يكون بدوها حمده و كل ناطق و ساكت فهو عبده الذي تاهت\nالالباب في عظمته و كلت عقول اهل معرفته عند مشاهدته من عز جبروته و صلي االله علي المنتخب من خلقه من خيرته محمد النبي و عترته. اعلم انه لما كان من مذهبي طالبي العلم )النظر في جميع علوم الموجودات التي في العالم من الجواهر و الاعراض و البسائط و المركبات</p><p dir=\"auto\">Final line:</p><p dir=\"auto\">فانتبه يا اخي من نومة الغفلة و\nرقدة الجهالة</p><p dir=\"auto\">424 folios, 29 lines (18,5x12cm), page 25x17cm.</p><p dir=\"auto\">Likely this MS is mistakenly given as Majlis-i Shūrā Library 1555 by Ali-de-Unzaga.</p>",
      "22715": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>. Copied in 1270/1853-4.</p>",
      "3444": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma.</span> Full copy likely, 201 folios.</p><p dir=\"auto\">In this MS the text is attributed to Muḥammad b. Ḥasan Ṭūsī and Sirāj al-Dīn al-Urmawī and mentions Tīmūr as patron. Copyist Muḥammad ʿAlī in Rajab 1031/May-June 1622.</p><p dir=\"auto\">Full Persian description, including transcription of colophon and some important passages, is worthwhile to copy:</p><p dir=\"auto\">ترجمهگونهاي است از رسائل اخوان صفا )ادبيات ۴۱</p><p dir=\"auto\">از سراج الدين ارموي، در پايان آمده: »تمام شد ترجمه اخوان الصفا و خلان الوفا بترجمه علامة علماء الاسلام سلطان القضاة و الحكام و كمل علوم الاولين و الآخرين سراج الملة و الدين الارموي في تاريخ يوم الاربعاء شهر رجب المرجب سنة ۱۰۳۱ من يداقل اشيا محمد علي«. در ص ۴۳ آمده: »و ما كتابي ساختهايم در اين نسبت خاصه و حركت زبانهها و فقرات و ايقاعات در آن جا ياد كرديم«. پيش از اين در ص ۳۲ آمده: »و ناقل ميگويد كه كسي ياد نكرده است كه موسيقي از بهر چه نهادهاند و ما بگوييم تا بداند كه او از آنچه به آواز نهادهاند اثري تمام دارد و نفس برين غلبه ميكند اين علم و عمل بنهادند تا نفس ازو اثر پذيرد به تن دهد و تن را از حال خويشتن بگرداند« )خلاصه رساله چهارم از قسم اول از رياضيات ص ۲۳ و ۲۶ چاپي(. نامي از تيمور در ديباچه در متن نيست ولي در هامش ) ص ۴( بهعنوان نسخه بدل سپس افزودند. در ديباچه )ص ۵( آمده: »محرر اين مقاله و مؤلف اين رساله مولانا ... علامة الافاق محمد بن الحسن الطوسي تغمده االله برحمته گويد كه به تحرير اين كتاب كه موسوم است به مجمل الحكمه و حكما هر يك مجمل ساختهاند و بنده ضعيف از هر يك كتاب يك رسالهاي منتخب به فارسي كرده تا جمع را دليل باشد«. اين ارموي گويا همان قاضي سراج الدين محمود بن ابي بكر ارموي )۵۹۴-۶۸۲ق( مؤلف مطالع الانوار به عربي و لطائف الحكمه به فارسي در دو حكمت علمي و عملي براي عز الدين كيكاوس سلجوقي رومي فرمانرواي قونيه در ۶۵۵ )آستان قدس ۷۱/۱ ش ۲۳۰ مورخ ۷۷۱؛ دانشمندان آذربايجان ۱۷۵( است اگر چه در يادداشتهاي قزويني در نسخه ادبيات )ص ۴۱۵ فهرست( آمده كه اين كتاب پيش از ۶۰۸ بايد ساخته شده باشد. در نسخه مجلس هم آن بارساله ديگري است كه در ۶۶۷ نوشته شده است ) ۵۱/۲ و ۵۷ ش ۱۰۴ و ۱۱۲( )ف۳۴۶(. آقاي باستاني مترجم را شرف الدين ارموي پنداشته و شايد ميخواهد بگويد كه همان صفي الدين ارموي )۶۱۳-۶۹۳ق( نگارنده شرفيه و ادوار است.</p>",
      "37082": "<p dir=\"auto\">Extract of four folios from <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span> in majmūʿa<span class=\"italics\">.</span> Dated to Rabīʿ I 1009 / September 1600, copied in Jabal Karā (Hijaz, between Mecca and Ṭāʾif). Nastaʿlīq script. Four folios, 26 lines per page (18x8cm), page 21x13cm.</p>",
      "5595": "<p dir=\"auto\"><span class=\"italics\">Mar ghazār yā tarjama risala-yi muḥakama-ye insān ve-ḥayawān-i ikhwān al-ṣafāʾ</span>; translation of the case of animals vs. men by Mīrzā Aḥmad Waqār (d. 1289) (on him, see <a href=\"https://fa.wikipedia.org/wiki/وقار_شیرازی\" target=\"_blank\">https://fa.wikipedia.org/wiki/وقار_شیرازی</a>). The MS was donated to Nāṣir al-Dīn Shāh (r. 1848-96); 1277.</p><p dir=\"auto\"><a href=\"http://www.aghabozorg.ir/showbookdetail.aspx?bookid=55244\" target=\"_blank\">http://www.aghabozorg.ir/showbookdetail.aspx?bookid=55244</a></p>",
      "56381": "<p dir=\"auto\">Mujmal al-ḥikma in majmūʿa 1260/1844 = <a href=\"http://www.aghabozorg.ir/showbookdetail.aspx?bookid=60704\" target=\"_blank\">http://www.aghabozorg.ir/showbookdetail.aspx?bookid=60704</a></p>",
      "6687": "<p dir=\"auto\"><span class=\"italics\">ʿAwn ikhwān al-ṣafāʾ ʿalā fahm kitāb al-shifāʾ</span> Bahāʾ al-Dīn Muḥammad b. Tāj al-Dīn Ḥasan b. Muḥammad Iṣfahānī (d. 1137), copied in 1100 => perhaps this is not Ikhwan related, may just use stock phrase?</p><p dir=\"auto\"><a href=\"http://www.aghabozorg.ir/showbookdetail.aspx?bookid=61746\" target=\"_blank\">http://www.aghabozorg.ir/showbookdetail.aspx?bookid=61746</a></p>",
      "7485": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ,</span> partial copy Qism 2: numbering of epistles both within aqsām and within total corpus of 51. “Min kalām al-ṣūfiyya.” Beginning of the 12th C, although it seems the colophon of the epistle on animals is dated to Rabīʿ I 1129 / February/March 1717?</p><p dir=\"auto\">There is a note dated to Jumādā II 1143 / December 1730, January 1731.</p><p dir=\"auto\">192 folios, 21 lines (15x7cm), 20,5x13cm.</p>",
      "76243": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span> excerpts in same <span class=\"italics\">majmūʿa</span> as 7624/8. 12 folios (20p-31r).</p><p dir=\"auto\">Copied by Muḥammad Walī b. Ḥusayn in Shawwāl 1244/April-May 1829.</p>",
      "76248": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span> excerpts in same <span class=\"italics\">majmūʿa</span> as 7624/3. 39 folios (52p-94r). Epistles, 6, 8, 9, Isagoge, Categorias, and other logic topics + a bit from the natural sciences.</p><p dir=\"auto\">Copied by Muḥammad Walī b. Ḥusayn & Ḥājīlrī Astarābādī (the latter is not mentioned in description of codicological unit 3 in Fehrestegan) in 1245/1829-30.</p>",
      "8340": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>. Copied 15 Rabīʿ I 1073/March 1662 by ʿAbdallāh b. Muḥammad Taqī in Mashhad (likely son of copyist of Majlis-i Shūrā Library 5224). Ownership note by Zayn al-ʿĀbidīn b. Shahsawār.</p><p dir=\"auto\">Colophon followed by two couplets.</p><p dir=\"auto\">184 folios. Missing first folio(s), starts in what appears to be epistle on arithmetic. 18 lines per page. Written in a regular nastaʿlīq script. Rubrication for section titles. Diagrams executed carefully. With catchwords.</p>",
      "63602": "<p dir=\"auto\">Extract of Persian translation in <span class=\"italics\">majmūʿa</span> containing esoteric materials; the Ikhwan-related material appears to have ḥashiya by Mūhammadhādī Ḥusaynī, an Iṣfahānī astrologue, and (?) Ḥasan ʿAlī b. Badr al-Dīn Muḥammad Ḥusaynī (these appear to be later). It is written by the important scholar Bahāʾ al-Dīn Sharīf Āmilī (d. 1621 in Isfahan) and donated to prince Shāh ʿAbbās year 992/1584. then about 13 years old (r. 1588-1629). This appears to coincide with al-Āmilī’s pilgrimage to Mecca + visits to Jerusalem, Damascus, Cairo. He is back in Tabriz by February 1585 => if dates are correct, he must have donated this work very early after his return.</p><p dir=\"auto\"><a href=\"http://www.aghabozorg.ir/showbookdetail.aspx?bookid=61570\" target=\"_blank\">http://www.aghabozorg.ir/showbookdetail.aspx?bookid=61570</a></p>",
      "7581": "<p dir=\"auto\">Extract in majmūʿa, science of the stars related, it seems = <a href=\"http://www.aghabozorg.ir/showbookdetail.aspx?bookid=64837\" target=\"_blank\">http://www.aghabozorg.ir/showbookdetail.aspx?bookid=64837</a></p>"
    },
    "Lughat Nāme Dehkhodā": {
      "166": "<p dir=\"auto\"><span class=\"italics\">al-Risāla al-Jāmiʿa</span>, evident from opening and ending words cited in Fehrestegan (but filed as RIS in Fehrestegan). Said to have been copied in Konya Shaʿbān 678 (of which the 6 and 8 are written on another line in newer handwriting), but this is considered a “fake date” by cataloguers who situate it rather in the 10th or 11th C. Perhaps date copied from source MS?</p><p dir=\"auto\">Naskh copy, 456 folios, 26 lines per page, 31x18cm.</p>",
      "2142or21?": "<p dir=\"auto\">Mujmal al-ḥikma (Persian) in majmūʿa, copied by Luṭf ʿAlī b. ʿAbdallāh b. Luṭf ʿAlī Sāwjī. End of 12th/18th C. Mentions Tīmūr.</p>"
    },
    "Mahdawi": {
      "2711": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>. Likely in a <span class=\"italics\">majmūʿa.</span> Copied between 1267-73AH.</p>",
      "417": "<p dir=\"auto\">Partial copy, middle of the fihrist up to risala 9. Naskh script. 10th or 11th C.</p>",
      "851": "<p dir=\"auto\">Partial copy, most if not all of first qism (mathematics up to second analytics). 11th/17th C. Naskh script.</p>",
      "7437": "<p dir=\"auto\">Dated 640/1242, likely produced in Shahrābād (Khurasan) because an addition to Epistle 1.2 is attributed to a certain Ibn Saʿd min Ahl Shahrābād luqqiba “al-mashhūr biʿaṣah” (see Nader El Bizri edition Arabic p. 148, English translation p. 161.) El-Bizri notes that this person to whom the passage is attributed may be a different person than the one who copied the text.</p>"
    },
    "Majlis-i Shūrā Library": {
      "101909": "<p dir=\"auto\">Extract in <span class=\"italics\">majmūʿa</span><span class=\"italics\"> (“maqālāt min”</span>). Ownership: “ʿAṭāʾ Allāh.” Dated 1019/1610-11. 169 pages. 20x9,5cm.</p>",
      "1045412": "<p dir=\"auto\">Persian translation, designated as <span class=\"italics\">Ikhwān al-ṣafāʾ, </span>no explicit mention of <span class=\"italics\">Mujmal al-ḥikma</span> on title page or in colophon, there it is rather designated as <span class=\"italics\">al-Khulāṣāt al-mawsūn bi-Ikhwān al-ṣafāʾ.</span></p><p dir=\"auto\"><span class=\"italics\">C</span>olophon Jumādā II 907/December 1501 (no copyist or location).</p><p dir=\"auto\">Very clean copy in misṭara, red rubrication and clear separation of epistles. 245folios, 17 lines per page, 20,5x10cm.</p><p dir=\"auto\">Folio 1a seal “.. Muḥīṭ” + note by Ḥasan b. Muḥammad al-mulaqqa bi-Muḥīṭ al-Kirmānī.<strong> </strong>A tarjama of potentially this man is available here, where it is stated that he died in 1288 AH: <a href=\"https://www.taraajem.com/persons/26007/الميرزا-حسن-بن-علي-أكبر-المحيط-الكرماني-الطبيب\" target=\"_blank\">https://www.taraajem.com/persons/26007/الميرزا-حسن-بن-علي-أكبر-المحيط-الكرماني-الطبيب</a></p><p dir=\"auto\">مقدمه اين ترجمه ذكر شده: »و بعد از اين بدانيد كه كتابها بسيار است و بيشتر به لغت تازي است و در آن كتابها هيچ حظي نيست مانند سرود اختران و كتاب نام بار خداي و مرزبان نامه و انچه بدين ماند و ما هيچ كتابي نيافتيم از انچه در حكمت به كار آيد كه از رياضي و منطقي و طبيعي جمله در وي باشد مگر دانش نامه و آن لفظي سخت مشكل است و بيشتر اشارت و بعضي رمز است و كتاب مجمل الحكمة مجموع است وليكن همچنين مرموز استودرآنحشو بسيارست وما يكدوجايديدمكهاين كتاب را پارسي نقل كردهاند و همچنان مرموز گذاشته و حشو بجاي مانده پس چنين اتفاق افتاد كه اين ضعيف را فرمودند كه اين كتاب را به پارسيدرين قلكند هرچه حشوا ستازوي دور كند«،</p>",
      "112": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>. Cfr. Danishpazhuh ed. p. 17 for discussion of text. Incomplete copy (up to seventh risala of <span class=\"italics\">nafsāniyyāt</span>) in <span class=\"italics\">majmūʿa</span>: folios 1-116 of 139. Followed by a few folios from “Jahān Dānesh” by Sharaf al-Dīn Muḥammad Masʿūdī Marwazī (folios 117-121) and traditions about ʿAlī (122-139) + a ḥāshiya text on folios 51-81 “Rabīʿ al-mulūk”.</p><p dir=\"auto\">“Jahān Dānesh” extract is dated to 6 Rabīʿ I 667/1268-9 in Hari, near Rudbar.</p>",
      "166": "<p dir=\"auto\">Also listed as 166 S. Numbers noted on flyleaf: 186 and especially 12904.</p><p dir=\"auto\"><span class=\"italics\">Tarjama wa-khulāṣa-yi dānishnāmeh dar Rasāʾil Ikhwān al-Ṣafā</span> – an alternative title for the text commonly known as <span class=\"italics\">Mujmal al-ḥikma</span>. Acephalous but starting in first epistle.</p><p dir=\"auto\">250 pages (MS is not foliated but paginated). 17 lines per page. Nastaʿlīq. Rubrication for section titles and overlining for important phrases. Some marginal signposting. Several diagrams.</p><p dir=\"auto\">FANHA notes that it is a 11th/17th century copy of <span class=\"italics\">Mujmal al-ḥikma</span> and that it mentions Timur in the preface:</p><p dir=\"auto\">اين نسخه به نام امير تيمور گوركان است و در آن از نقاوة</p><p dir=\"auto\">الحكمة خواجه حسن اصفهاني و كتاب عبداالله بن جبرئيل بن</p><p dir=\"auto\">بخت يشوع طبيب ياده شده است، رساله دهم قسم سوم آن در حدود مفرد است</p><p dir=\"auto\">شماره مدرک کتابخانه مجلس: IR‏10-10593‬‬</p>",
      "27841s": "<p dir=\"auto\">A low quality scan circulates online. It indicates a different shelmark, perhaps “395”. The side mark with identification is not clearly readable.</p><p dir=\"auto\">Extract in <span class=\"italics\">majmūʿa</span><span class=\"italics\"> </span>(Persian) containing according to description two epistles from the text (arithmetic?), 11th C, only low quality scan available amongst 45 other epistles. Rectangular vertical notebook style. Scan + shelfmark available here</p>",
      "1278": "<p dir=\"auto\">Full copy of <span class=\"italics\">Rasāʾil</span> with Fihrist. 691 folios. Dated to 1208 or 1280. Copyist Mīrzā Ḥusayn b. Aḥmad Kurjī, on the orders of Niẓām al-Mulk? 691 pages, 36 lines per page, page 33x18cm.</p>",
      "13581": "<p dir=\"auto\">Single <span class=\"italics\">risāla</span> in <span class=\"italics\">majmūʿa</span>, attributed to Majrīṭī. 61 pages (1-61), 15 lines per page. Nasta’liq script. Sentences cited do not match with Hindawi text however, potentially magic-related. Needs further study.</p><p dir=\"auto\">آغاز: بعد بسمله. و اعلم يا اخي ان حقيقه هذا الاسم هو الخاصة الموجوده في نفوس المستحقين له بالحقيقة لاعلي طريق المجاز و اعلم يا اخي انه لاسبيل الي صفاء النفس الا بعد بلوغها الي حدالطمانية في؛</p><p dir=\"auto\">انجام: و رايت حقيقة هذا السحر الذي يسحر العقول بانت لك الاشياء بحقايقها ... و لاحول و لاقوه الا باالله العلي العظيم و حسبنا االله و نعم المعين تمت.</p>",
      "1555": "<p dir=\"auto\">Rasāʾil ikhwān al-ṣafāʾ full copy dated to 968/1561. Mentioned by Ali-de-Unzaga. The copying date suggests that this is the same MS as K. Markazī Dānishgāh-i Tehrān 1155.</p>",
      "1829": "<p dir=\"auto\"><span class=\"italics\">al-Risāla al-Jāmiʿa</span><span class=\"italics\">,</span> attributed to al-Majrīṭī. (Attribution may be the cataloguer’s doing). Late 11th or early 12th C AH, 425 pages, nasta’liq. Alternative title given: xulāṣat-u rasā'il-i ixwān-iṣ ṣafā</p>",
      "1831": "<p dir=\"auto\">Partial copy <span class=\"italics\">Rasāʾil</span> (first five epistles from fourth qism). Copyist Mubārak Pesar ʿAbdallāh ghulām Najīb al-Dīn Mazīdī in 621/1224-5. Contains the “min kalām al-ṣūfiyya” line following the titles of some epistles + claim that they were part of a total of 51 epistles. 205 folios (139-344), 20 lines per page, 12,5x22,5 cm.</p><p dir=\"auto\">Starts with basmallah, then “<span class=\"italics\">al-qism al-rābiʿ min kitāb ikhwān al-ṣafā</span>ʾ”. New rasāʾil signposted with thick (red?) ink. First folio provides table of contents in later handwriting, an even later reader (the foliator?) has given the relevant folio numbers where the first five epistles start? Foliation is in Persian numerals but for unclear reasons starts at 139 (MS was part of a multiple text MS before?).</p><p dir=\"auto\">Contains five rasāʾil: 1. <span class=\"italics\">al-arāʾ waʾl-diyānāt al-nabawiyya waʾl-madhāhib al-falsafiyya</span> (risāla 4.1); 2. <span class=\"italics\">fī māhiyyat al-ṭarīq ilā Allāh wa kayfiyyat al-wuṣūl ilayhi</span> (= risāla 4:2?); 3. <span class=\"italics\">fī bayān iʿtiqād ikhwān al-ṣafā</span> (= risāla 4.3); 4: <span class=\"italics\">fī bayān k.</span> Before the colophon it is signposted that the sixth risala will follow in a next volume.</p><p dir=\"auto\">Has notes dated to 13th century Hijri, in nasta’liq script. Text itself naskh.</p><p dir=\"auto\">Ownership notes: ʿAbd al-Ḥusayn Farhād gifted it to Dr. Ghanī in Ādhar 1321/1903; seal of Iḥtishām al-Mulk. On colophon page: an effaced note in which the name of “Dāwūd” can still be discerned.</p><p dir=\"auto\">(Call number noted as 3700 in Arabic Manuscripts Institute, Baʿtha Īrān al-thāniyya 171<strong>)</strong></p>",
      "2097": "<p dir=\"auto\">Mujmal al-ḥikma, copied Dhū al-Qaʿda 1062/ October 1652 by ʿAlī Khān b. ʿAlī Bayk. Authorship attributed to “Aḥmad b. Ismaʿīl known as Ibn Abī Nārichī”. The cataloguer suggests that this name may be that of the translator. Alternatively, it may be a variant of the Isma’ili imam identified in some Isma’ili circles as author of the Ikhwanian corpus.</p><p dir=\"auto\">The flyleaf contains a birth notice for Mirzā Muḥammad Riḍā dated to Rabīʿ II 1215.</p><p dir=\"auto\">Colophon p. 346:</p><p dir=\"auto\">تمت كتاب اخوان الصفا من</p><p dir=\"auto\">تصانيف احمد بن اسماعيل المعروف بابي نارجى</p><p dir=\"auto\">بعون بالله الملك بتاريخ عص..</p><p dir=\"auto\">شهور ١٠٦٢ …</p><p dir=\"auto\">The colophon then includes a stylised triangle with the copyist’s name in red ink and a longer version in disconnected letters: “Ṣāḥib-hu Muḥammad ʿAlī bin ʿAlīkhān Ardahbīlī” potentially situating the production of this manuscript in Ardabil.</p>",
      "2098": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>, copied 10 Shawwāl 1112 / 20 March 1701.</p>",
      "2361": "<p dir=\"auto\">Majmūʿa containing 6 extracts from various texts, the first of which is a Persian translation of the Case of the Animals vs. Men from the Epistle on Animals. No mention is made of Mujmal al-Ḥikma. This extract is dated on colophon on pp. 105-6 to first ten days of Rabīʿ I 1302/December 1884.</p><p dir=\"auto\">Scan circulates online.</p>",
      "3251": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma,</span> dated to Shawwāl 1244 / September 1824. Copyist: Abū Turāb Ḥusayī Mūsawī.</p>",
      "4708": "<p dir=\"auto\">Full copy of <span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span> : 51 epistles, including fihrist.</p><p dir=\"auto\">Dated to 5 Ramaḍān 686 in Madīnat al-Salām Baghdād, copyist Khalīl b. Yūsuf b. Salār b. ʿAlī (attested in .</p><p dir=\"auto\">Waqf: Fāṭima Ḥājiyya Khānum, wife of Ḥājī Mujtahid Ḥājī Muḥammad ʿAlī, Rajab 1252/October-November 1836.</p><p dir=\"auto\">Written in misṭara. 29 lines per page (27x18cm), 385 folios (412 in catalogue), page size 36,5x25cm.</p><p dir=\"auto\">First folio: many notes in <span class=\"italics\">nasta’līq</span>.</p><p dir=\"auto\">Scan available at Arabic Manuscripts Institute: Baʿtha Īrān al-thāniyya 172.</p><p dir=\"auto\">For a brief discussion, see Qurboniev & Van Den Bossche, ‘”A Scholarly Copyist”, pp. 448-9.</p>",
      "48681920": "<p dir=\"auto\">Extracts from <span class=\"italics\">Mujmal al-ḥikma</span> in majmūʿa. 13th/19th century. Listed in Danishpazhuh edition.</p>",
      "5224": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma.</span> Nasta’liq. Copied by Muḥammad Taqī, 7 Rajab 1072/1 March 1662, in Mashhad.</p>",
      "5255": "<p dir=\"auto\">Partial copy (first = 2.11, last = 4.5) dated 11 Rajab 607/29 December 1210, two different copyists</p><p dir=\"auto\">186 folios, 20 lines per page, 14x9,3cm on page 19x13,2cm</p>",
      "65233": "<p dir=\"auto\">Persian translation of two epistles (on planetary cycles and on minerals) in <span class=\"italics\">majmūʿa</span>. Nasta’liq, 12 folios (60p-71p), 16 lines per page, size 19x12,5cm.</p>",
      "68951": "<p dir=\"auto\">Extracts of <span class=\"italics\">Mujmal al-ḥikma</span> in <span class=\"italics\">majmūʿa</span> (13 folios: 7-17 and 34-5)<span class=\"italics\">.</span> 12th/18th century.</p><p dir=\"auto\">انجام: از بال پرم رشته غفلت بردار ** شايد كه كنم بر اوج مهرت پرواز</p>",
      "9040": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma.</span> Nasta’liq, 11th century. Ownership notes by Muḥammad Ṭāhir b. Shāhmīr Awḥadī, Ḥusayn b. Shāhmīr … (Pārgī) Ṭāhir b. Shāhmīr ʿĀbid Awḥadī, to his son Muḥamad. Part of the library of Jaʿfar Sulṭān al-Qarāyī (+ some titles noted in Fihristegan)</p><p dir=\"auto\">Digital copy provided to Gowaart in Kerbala.</p>",
      "1129213": "<p dir=\"auto\">Extract of <span class=\"italics\">Mujmal al-ḥikma</span> (10 folios, 216-225) in <span class=\"italics\">majmūʿa</span>. MS dated to 1082 and 1083/1672.</p>",
      "125743": "<p dir=\"auto\">Selections from <span class=\"italics\">Mujmal al-ḥikma</span> in <span class=\"italics\">majmūʿa</span>. 11folios (54r-64p)<span class=\"italics\">,</span> epistles 10-12 of Natural sciences.</p>",
      "1523225": "<p dir=\"auto\"><span class=\"italics\">Muntakhab rasāʾil Ikhwān al-ṣafāʾ</span> by Muẓaffar Ḥusayn b. Muḥammad Amīn Kāshānī<span class=\"italics\">;</span> Isfahan 1035Q/1656.</p><p dir=\"auto\">=> Microfilm of it? : Tehran Dānishgāh-i Tehrān Library 2799 F - <span class=\"italics\">Mukhtaṣar rasāʾil ikhwān al-Ṣafāʾ</span><span class=\"italics\"> </span>by Muẓaffar Ḥusayn b. Muḥammad Amīn Kāshānī</p>"
    },
    "Majmūʿa-yi Ḥusayn Miftāḥ": {
      "477": "<p dir=\"auto\">“risāla fī ḥaqīqat ikhwān al-ṣafāʾ”, attributed to Majrīṭī, bound with material by a.o. Jābir b. Ḥayyān and pseudo-Ghazālī, 13th/19th century = <a href=\"http://www.aghabozorg.ir/showbookdetail.aspx?bookid=24077\" target=\"_blank\">http://www.aghabozorg.ir/showbookdetail.aspx?bookid=24077</a></p>",
      "1354": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>. Mentioned in Danishpazhuh ed.</p>",
      "463": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>. Nasta’liq, 11th/17th C</p>"
    },
    "Malek": {
      "457": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span> (Persian), 10th/16th C. Eight chapters only (?), translation made by order of Bahā al-Dīn Sayf al-Dawla Shujāʾ al-Mulk Muḥammad b. Bektāsh (leader of the Bektashi order?) Needs closer study, may provide evidence on text’s transmission to Anatolia. See also Mashad Ilāhiyāt 429.</p>",
      "8221": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma,</span> dating to before 719. (Danishpazhuh notes this as number 8<strong>8</strong>2)</p>",
      "10561": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma,</span> dated to end of Shaʿbān 667/April 1297. Same date as Majlis-i Shura 112. No further info.</p>",
      "1197": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma,</span> 11th century</p>",
      "1280": "<p dir=\"auto\"><span class=\"italics\">al-Risāla al-Jāmiʿa</span><span class=\"italics\">,</span> 9th/15th C, 169 folios, appears to be full copy.</p><p dir=\"auto\">Digital copy available at: Arabic Manuscripts Institute al-falsafa waʾl-manṭiq 403</p>",
      "1477": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span> (?), 11th C. 456 folios, 26 lines per page, 31x18cm.</p>",
      "1485": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span>, 420 folios, 22 lines per page. Copied in 1073 in Nasta’liq script, ownernship notes dated to 1175 (Ṣāliḥ b. Ḥusayn b. ʿAbd al-Ḥusayn) and 1186 (Ṣanīʿ al-Dawla Muḥammad Muḥammad Ḥassan Khān wa-mawlānā Muḥammad b. ʿAbd al-Jalīl Rajabī al-Shāfiʿī al-Yamānī (waladan) Baghdādī (aṣlan).</p><p dir=\"auto\">Includes fihrist, may be full copy?</p><p dir=\"auto\">420 folios, 22 lines per page, 27x20,3cm.</p><p dir=\"auto\">Partial scan formerly available at Malek Museum website.</p>",
      "2295": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma,</span> 11th century.</p><p dir=\"auto\">Partial scan formerly available at Malek Museum website.</p>",
      "34542": "<p dir=\"auto\">Extract from Mujmal al-ḥikma in majmūʿa. 1085/1674-5.</p>",
      "402717": "<p dir=\"auto\">Extracts from Mujmal al-Ḥikma in <span class=\"italics\">majmūʿa</span><span class=\"italics\"> </span>(Persian). Copied 12th/18th C.</p>",
      "41937": "<p dir=\"auto\">Extract from <span class=\"italics\">Mujmal al-Ḥikma</span> in <span class=\"italics\">majmūʿa</span><span class=\"italics\"> </span>(Persian), copied between 1275 and 1276/1859. Supposedly copied by Mīrzā ʿAbdullāh Riyāḍī, but needs further assessment.</p><p dir=\"auto\">Partial scan formerly available at Malek Museum website.</p>",
      "42537": "<p dir=\"auto\">Extract from <span class=\"italics\">Mujmal al-ḥikma</span> in <span class=\"italics\">majmūʿa</span>. Copyist Muḥammad Kāẓim Iṣfahānī in 1059/1649.</p>",
      "445312": "<p dir=\"auto\">Persian translation up to risālat al-nafs of Qism 2; copied in Tehran 1224Q/1845. Nasta’liq script, 103 folio (110p-212r), size 21,7x14,6cm.</p>",
      "5439": "<p dir=\"auto\"><span class=\"italics\">al-Risāla al-Jāmiʿa</span><span class=\"italics\">,</span> dated 21 Jumādā I 596/1200. 190 folios, appears to be full. Authorship not attributed. Some ownership notes by Muḥammad b. Yaʿqūb known as Mīrzā Jān Lāhijī. A seal by ʿAbdallāh b. Muḥammad Alī b. ʿAbd al-Jabbār al-Thaman.</p><p dir=\"auto\">First page appears to be repaired (<span class=\"italics\">nastaʿlīq</span>).</p><p dir=\"auto\">Full digital copy available from Arabic Manuscripts Institute baʿtha Īrān al-ūlā 79</p>"
    },
    "Marawi Madrasa Library": {
      "406": "<p dir=\"auto\">Full copy? (No info on contents) 11th/17th C.</p>"
    },
    "Melli / National Library": {
      "550": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ</span> Fihrist + qism 1; referred to as 51 epistles. 13th/19th C. 88 folios, 29 lines per page (20x11cm), 30x19,5cm.</p>",
      "783784": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ.</span> Full copy in two vols in usual separation qism 1&2 in vol. 1, qism 3&4 in vol. 2. Possibly 12th/18th C. Titles of epistles in red, separated by a few blank lines.</p><p dir=\"auto\">Full colour scans available on website of Melli Library.</p><p dir=\"auto\">Vol. 1: 317 folios, 27 lines (18x8cm), 26x14cm. Preceded by a leaf of poetry.</p><p dir=\"auto\">Vol. 2: 229 folios, 27 lines (18xcm), 26x14cm.</p>",
      "1226": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ.</span> Starts with Fihrist. Copied 1278/1861-2 in Isfahan for ʿAbbāsqulīkhān Nūrī. 252 folios, 31 lines per page (26x13,5cm), pages 35x21cm.</p>",
      "2122": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>, copied in Shaʿbān 1072/1662. Noted with call number 392 (2122 F) in Danishpazhuh edition. Mentions Tīmūr as patron. Fairly extensive description in Fehrestegan appears to be about the text more generally and not about this manuscript per se.</p>",
      "66415": "<p dir=\"auto\">Persian translation of the Epistle on Animals, entitled تداعی و ترافع بنی آدم و حیوانات نزد ملا بنی جان at the start. Independent of <span class=\"italics\">Mujmal al-ḥikma</span>.</p><p dir=\"auto\">Flyleaf contains author designations to both the group identified by al-Tawḥīdī and to al-Majrīṭī.</p><p dir=\"auto\">Margins contain extensive notes, signposting contents and explaining aspects.</p><p dir=\"auto\">155 pages + flyleaves. No colophon.</p>",
      "8645": "<p dir=\"auto\">An incomplete copy of the <span class=\"italics\">al-Risāla al-Jāmiʿa</span> (flyleaf incorrectly identifies the text as <span class=\"italics\">Rasāʾil ikhwān al-Ṣafāʾ</span>), from the end of epistle 4 up to the final epistle on magic. Volume two starts around p. 190 (unpaginated leaf).</p><p dir=\"auto\">Naskh, 188 folios (365 pages, manuscript is paginated, though inconsistently - page references below are to the pages in the PDF scan), 19 lines per page. Rubrication for section headers.</p><p dir=\"auto\">Colophon dated to Dhū l-Qaʿdā 1063/1653.</p><p dir=\"auto\">A cleanly produced copy. Some marginal annotation: mostly content markers but there are also some longer notes, e.g. 46a (this appears to be addition of materials), p. 202.</p><p dir=\"auto\">First endpaper (at the back of the MS) contains the note (potentially in the same hand as the person who left most of the marginal notes) maybe in Persian (based on the reading of the last two words):</p><p dir=\"auto\">نسخة شريفه موسو ؟ رسالة اخوان الصفا وخلان الوفا | از كتب</p><p dir=\"auto\">Second endpaper contains two tables with numbers.</p>",
      "15839": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>, 12th/18th C. Full copy, 230 folios, 16 lines per page.</p>",
      "18255": "<p dir=\"auto\">Mujmal al-ḥikma, dated to 1079/1668-9, formerly in the Pahlawi library.</p>"
    },
    "": {},
    "Mujtabā Maynawī": {
      "151": "<p dir=\"auto\"><span class=\"italics\">Rasāʾil ikhwān al-ṣafāʾ. </span>Partial copy (1.2-4.9?). Nastaʿlīq script. 9th/15th or 10th/16th C, copied from a MS dated to 7 Ṣafar 667.</p>"
    },
    "Mu'assasat-i Matali'a-yi Islami": {
      "132": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>. Dated to 25 Rajab 1071/26 March 1661. Nasta’liq, 159 folios, 16 lines (16,5x9), 25x16cm.</p><p dir=\"auto\">آغاز: هو المستعان بسم ... سپاس و ستايش مرخدايرا كه واجب الوجود است و هر چه جزويست ممكن الوجود است؛</p><p dir=\"auto\">انجام: و همچنين در شريعت ترك لذت بتقليد ميكنند و در حكمت بعلم و االله اعلم بالصواب تمت الرسالة المعروفة ... تم تم تم</p>"
    },
    "Nūrbakhsh Library": {
      "2091": "<p dir=\"auto\">Persian translation in <span class=\"italics\">majmūʿa</span>. 1071Q/1692. 99 pages (2-100 in the <span class=\"italics\">majmūʿa</span>), 23 lines per page, size 29x19cm.</p>"
    },
    "Sepahsalar Madrasa": {
      "2789": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>. 27 Rabīʿ II 1049/1639, copyist: Faraj Allāh b. Muḥammad Aḥwīzāwī. Naskh script. 157 folios, 17 lines, size 15x10,5cm.</p>",
      "27901": "<p dir=\"auto\">Multiple hands, copied throughout 1047<strong> </strong>Entered into Sepahsalar 1297Q/1918. Various poems on flyleaves. 471 folios, 27 lines (22x12cm), size 28,5x17cm.</p><p dir=\"auto\">Copyists: Mullah Burhan bin Mullah Mohammad Khan Rashti; Taj al-Din Hassan Hosseini; Hakim Hussein bin Hakim Noureddin bin Hakim Ali Nourbakhshi Maliki Gilani Dailami.</p>",
      "57912": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span>, 11th/17th C, in a majmūʿa with further epistles on the soul. Mentions Amīr Tīmūr.</p>",
      "65551": "<p dir=\"auto\">Persian translation. Copyist: Hāshim b. Ḥusayn Amīd. Indian paper, 216 folios, 21 lines (14x7,5cm), size 22x12cm.</p>"
    },
    "Sulṭanatī": {
      "1892": "<p dir=\"auto\">Partial MS of Mujmal al-ḥikma (Persian), 10 treatises. Before 1055-56. Copied from an original dating to 702.</p>"
    },
    "Tehran University Ilahiyāt": {
      "108J": "<p dir=\"auto\"><span class=\"italics\">Mujmal al-ḥikma</span> from the start up to 4.8. 11th or 12th C. Ownership by a certain Sayyid Ḥusayn.</p>",
      "109J": "<p dir=\"auto\">Partial copy of <span class=\"italics\">Mujmal al-ḥikma.</span> 11th or 12th C. Seal of Muḥammad Shāh Pādishāh Ghāzī. Note of gift to library in 1316. Gifted to the library in Jumādā II 1316 by Sayyid ʿAbd al-Riẓā courtesy of Mūrād Khān.</p>"
    }
  },
  "Tehran?": {
    "Unknown repository": {
      "13677": "<p dir=\"auto\">Two rasa’il in a majmūʿa, 11th century = <a href=\"http://www.aghabozorg.ir/showbookdetail.aspx?bookid=112177\" target=\"_blank\">http://www.aghabozorg.ir/showbookdetail.aspx?bookid=112177</a></p>",
      "15276": "<p dir=\"auto\">Majmūʿa containing extracts. Linked to Ḍiyāʾ al-Dīn D-rī , year 1111 = <a href=\"http://www.aghabozorg.ir/showbookdetail.aspx?bookid=41069\" target=\"_blank\">http://www.aghabozorg.ir/showbookdetail.aspx?bookid=41069</a></p>",
      "ArabicManuscriptsInstitutealFalsafawalmaniqalmurattabalabjd492": "<p dir=\"auto\">Only noted as having an Iranian origin in MALECSO database. Appears to be a partial copy of <span class=\"italics\">Rasāʾil</span>.</p><p dir=\"auto\"><strong>أولها :</strong></p><p dir=\"auto\"><strong>الحمد</strong><strong> </strong><strong>لله</strong><strong> </strong><strong>وسلام</strong><strong> </strong><strong>على</strong><strong> </strong><strong>عباده</strong><strong> </strong><strong>الذين</strong><strong> </strong><strong>اصطفى</strong><strong> </strong><strong>كتبنا</strong><strong> </strong><strong>رسائل</strong><strong> </strong><strong>اخوان</strong><strong> </strong><strong>الصفا</strong><strong> </strong><strong>وخلان</strong><strong> </strong><strong>الوفا</strong><strong> </strong><strong>فى</strong><strong> </strong><strong>تهذيب</strong><strong> </strong><strong>النفس</strong><strong> </strong><strong>وصلاح</strong><strong> </strong><strong>الاخلاق</strong><strong> </strong><strong>والاصدقاء</strong><strong> </strong><strong>الكرام</strong><strong> </strong><strong>وماهية</strong><strong> </strong><strong>اعراضهم</strong><strong> </strong><strong>فيها</strong></p><p dir=\"auto\"><strong>آخرها :</strong></p><p dir=\"auto\"><strong>واعلم</strong><strong> </strong><strong>يا</strong><strong> </strong><strong>أخي</strong><strong> </strong><strong>بأن</strong><strong> </strong><strong>الحيوانات</strong><strong> </strong><strong>الكبيرة</strong><strong> </strong><strong>الشمس</strong><strong> </strong><strong>فى</strong><strong> </strong><strong>الفلك</strong></p>"
    }
  },
  "Tonk": {
    "Rajasthan Arabic and Persian Research Institute": {
      "1844": "<p dir=\"auto\">According to handlist “Risala Ikhwan us-Safa” by Ahmad b. Muhammad</p>"
    }
  },
  "Toronto": {
    "Birnbaum Collection": {
      "58A2": "<p dir=\"auto\">Incomplete copy, contains parts of all aqsām (apparently); ca. early 18th C; “Ottoman\"</p><p dir=\"auto\">Source: catalogue of Birnbaum collection.</p>"
    }
  },
  "Tübingen": {
    "Universitätsbibliothek": {
      "MaVI86": "<p dir=\"auto\">Abhandlung über den Orden der Iḫwān aṣ-Ṣafāʾ (Abschrift vom Jahr 1215=1800) — little table of contents on side note <a href=\"http://idb.ub.uni-tuebingen.de/opendigi/MaVI86#p=270\" target=\"_blank\">http://idb.ub.uni-tuebingen.de/opendigi/MaVI86#p=270</a></p><p dir=\"auto\">=> in fact <span class=\"italics\">al-Risāla al-Jāmiʿa</span>, dated to 28 Dhū al-Qaʿda 611/7 May 1215, with various material added to end (131a-134b, including a secret script explanation).</p><p dir=\"auto\">Title appears to have been added later on 1a:</p><p dir=\"auto\">كتاب اخوان الصفوىه الصوفيه - وعلى قبر اخر مكتوب</p><p dir=\"auto\">قال اعمل بعلمى ولا تنظر الى عملى ينفعك علمى ولا يضرّك تقصيرى * نصيحتى لكم بعدى ان لا ىفعلةا فعلي * وازهدوا وتنسكو الرد والجنه قبلى</p><p dir=\"auto\">وهو كتاب فهرست الرسايل جميعها وطرازها المرقوم وهو لطايف الحلم</p><p dir=\"auto\">+ two further notes in differing hands: bottom note is poem by al-Qāḍī al-Tanūkhī (contemporary of al-Mutanabbī): <a href=\"https://www.aldiwan.net/poem87490.html\" target=\"_blank\">https://www.aldiwan.net/poem87490.html</a></p><p dir=\"auto\">Start is quite different from published edition</p><p dir=\"auto\">بسم الله الرحمن الرحيم اعلم ان البارى تعالى لما ابدع الموجودات وخارع المخلوقات</p><p dir=\"auto\">رتبها ونظمهاكما راتب الاعداد المفردات عن الواحد الذى قبل الاثنين وجعل كل جنس</p><p dir=\"auto\">منها دالًا على عدد مخصوص مطابقا بعضها لبعض واعلم ان مقدمات الالفاظ</p><p dir=\"auto\">والمعانى من المسميات والالفاظ هى الاسماء واعم الالفاظ والاسماء قولنا الشى فالشى اما ان يكون</p><p dir=\"auto\">واحدًا وكثيرًا الكثر من واحد فالواحد يقال على وجهين اما بالحقيقة واما بالمجاز قالوا حد با</p><p dir=\"auto\">لحقيقة …</p><p dir=\"auto\">Faṣls marked in red or bold script. Colophon 130b:</p><p dir=\"auto\">تمت الرسالة الجامعة ذات الفوائد النافعة تاج</p><p dir=\"auto\">رسائل اخوان الصفاء وخلان الوفا والحمد لله رب العالمين وصلواته على رسوله</p><p dir=\"auto\">سيدنا محمد واله وسلامه وقد وقع الفراغ منه سوم الاثنين الثامن عشرين من</p><p dir=\"auto\">شهر ذى القعدة من شهور سنه احدى عشر وستماىه وغفر الله لكاتبه وجميع المسلمين</p><p dir=\"auto\">فقد قولبه وصححه بالاصل</p>",
      "MaVI90": "<p dir=\"auto\">Extract in majmūʿa, 30th codicological unit, short section on “awliyāʾ Allāh”. Otherwise many texts by or related to Suhrawardī (who is also credited on the first page), Ibn Sīnā, al-Rāzī, al-Fīrūzabādī al-Shirāzī. Script is 9th century AH.</p>"
    }
  },
  "Turin": {
    "University Library": {
      "Kahle179No220IIoino353II": "<p dir=\"auto\">Abridged Turkish translation of qism 3 by Aḥmad çelebi b. al-Ḥājj Ḥasan Diramawī (nisba refers to Drama near Thessaloniki). Part of a <span class=\"italics\">majmūʿa</span> with Turkish diwan of Ziya Pasha (d. 1880) and a Turkish translation of <span class=\"italics\">Galérie mortale</span> written by Louis-Philippe Comte de Ségur. So this is likely a late 19th century production.</p>"
    }
  },
  "Unknown": {
    "Christies": {
      "2001LiveAuction6428Lot56": "<p dir=\"auto\">Late Safavid copy of qism 3.</p>"
    },
    "Piasa": {
      "RaresmanuscritsorientauxchrtiensetislamiquesLotH": "<p dir=\"auto\">Partial copy: epistle 2.1-2.8 (24th juzʾ). 186 folios, 17 folios per page, 17,5x13,4cm. Red rubrication and sentence dividers (three red dots).</p><p dir=\"auto\">Assessed to be 13th century Syria by cataloguer, but no colophon.\nData from Schoenberg database and from sale leaflet. Two pages reproduced in the leaflet.</p>"
    },
    "Sotheby's": {
      "ArtsoftheIslamicWorld2008Lot28": "<p dir=\"auto\">Two chapters from an abridgement of <span class=\"italics\">Ikhwān al-ṣafāʾ.</span> Supposedly dated to 711/1311 but this cannot be ascertained as Sotheby’s has not shared images of the colophon.</p>",
      "ArtsoftheIslamicWorld2010Lot39": "<p dir=\"auto\">Extract in a <span class=\"italics\">majmūʿa</span>.</p><p dir=\"auto\">Data from Schoenberg database.</p>",
      "ArtsoftheIslamicWorld2017Lot27": "<p dir=\"auto\"><span class=\"italics\">Rasa’il Ikhwan al-Saf</span>a, signed by Muḥammad b. ʿUmar b. Muḥammad al-Khāzin al-Tustarī, half of book III and book IV, Western Persia or Anatolia, dated 683 AH/1284 AD.</p><p dir=\"auto\">Lot 27</p><p dir=\"auto\">The manuscript was copied for the mevlevi Sufi Khwajah Jahan (Hace-i Cihan, Hoca Cihan) active a few generations after Rūmī in Seljuq Rum. It was later owned by Elvan Çelebi (d. after 760/1359), grandson of Baba Ilyas-i Horasani and an important hagiographer himself.</p><p dir=\"auto\">Later ownership marks on 2a:</p><p dir=\"auto\">ʿAbdallāh b. Muḥammad b. ʿAbd al-Laṭīf al-Shāfiʿī bought it 16 Muḥarram 1169</p><p dir=\"auto\">Square-ish seal: ?</p><p dir=\"auto\">Aḥmad b. ʿAbd al-Raḥmān b. Muḥammad b. ʿAbd al-Laṭīf bi-l-maqāsima al-sharʿiyya al-wāqiʿa fī ḍaman (?) yawm al-itnayn 21 Shawwāl 1193</p><p dir=\"auto\">2a also has a longish commentary in the margins in Arabic concerning authorship, settling on the Tawhidi thesis.</p><p dir=\"auto\">Image D - other rasm: in purple ink, in the khizana of Nuʿmān al-S[a/u]rūrī</p><p dir=\"auto\">The copyist may have a link to this person: <a href=\"https://arts.st-andrews.ac.uk/anatolia/data/documents/auth/local:hhb:072?hlu=&hl=tustari\" target=\"_blank\">https://arts.st-andrews.ac.uk/anatolia/data/documents/auth/local:hhb:072?hlu=&hl=tustari</a></p><p dir=\"auto\">=> re-sold at Gazette Drouot in 2022: <a href=\"https://www.gazette-drouot.com/lots/20104835-rasa-il-ikhwan-al-safa-signe---\" target=\"_blank\">https://www.gazette-drouot.com/lots/20104835-rasa-il-ikhwan-al-safa-signe---</a></p><p dir=\"auto\">Archived at: <a href=\"https://web.archive.org/web/20230103125226/https://www.gazette-drouot.com/lots/20104835-rasa-il-ikhwan-al-safa-signe---\" target=\"_blank\">https://web.archive.org/web/20230103125226/https://www.gazette-drouot.com/lots/20104835-rasa-il-ikhwan-al-safa-signe---</a></p>",
      "ArtsoftheIslamicWorld2016Lot35": "<p dir=\"auto\">14th century (?), qism 1; no further data available, but is lavishly decorated!</p><p dir=\"auto\">The manuscript was apparently carbon tested, situating its production date between 1298 and 1407.</p><p dir=\"auto\">Ilkhanid style illumination.</p><p dir=\"auto\">The shamsas and other decorations are for colophons and title pages to each epistle.</p>",
      "ArtsoftheIslamicWorld2018Lot38": "<p dir=\"auto\">17th/18th century, copied by Yadullah-bakhsh (?) ibn Mulla 'Abd al-Qadir, North India/Mughal <a href=\"https://www.sothebys.com/en/auctions/ecatalogue/2018/arts-of-the-islamic-world-l18220/lot.38.html\" target=\"_blank\">l</a></p><p dir=\"auto\">Ownership by <span class=\"italics\">vaziray,</span> + two different seal impressions Ḥasan Zakī al-Dīn dated 1281/1864-5 and his son Yaḥyā dated 1312/1894-5</p>",
      "ArtsoftheIslamicWorld2023Lot22": "<p dir=\"auto\">Complete copy, luxurious production dated 1041-2/1631-33, copyist Muḥammad Bāqir b. Ḥajjī Muḥammad al-Ḥāfiẓ (who also copied a luxurious copy of <span class=\"italics\">Ṣuwar al-kawākib al-thābita</span>) for Safavid general and governer of Mashhad Abū al-Fatḥ Manuchihr Khān (d. 1636). Based on MS dated to 955 AH/1548-49 AD by Abu al-Nasr Muhammad ibn Mansur ibn Sadr al-Din al-Husaini (himself a known copyist for Shah Tahmasp). 37.2 by 22.8cm. Unusually includes a schematic illustration of the river Nile in the epistle on geography which appears to be generally longer than usual.</p><p dir=\"auto\">Shamsa that introduces the text includes identifiction of five scholars responsible for the text = Tawhidi group. Flyleaf on opposite page refers directly to Tawhidi.</p><p dir=\"auto\">Later in the possession of Faridun Jah, the last Nawab of Bengal, Bihar and Orissa. The text reads: 'Muntazim al-Mulk, Muhsin al-Dawla, Faridun Jah Sayyid Mansur ‘Ali Khan Nusrat Jang Bahadur 12[?]6.</p><p dir=\"auto\"><a href=\"https://www.sothebys.com/en/buy/auction/2023/arts-of-the-islamic/a-rare-complete-copy-of-rasail-ikhwan-al-safa\" target=\"_blank\">https://www.sothebys.com/en/buy/auction/2023/arts-of-the-islamic/a-rare-complete-copy-of-rasail-ikhwan-al-safa</a> + <a href=\"https://web.archive.org/web/20231020081110/https://www.sothebys.com/en/buy/auction/2023/arts-of-the-islamic/a-rare-complete-copy-of-rasail-ikhwan-al-safa\" target=\"_blank\">https://web.archive.org/web/20231020081110/https://www.sothebys.com/en/buy/auction/2023/arts-of-the-islamic/a-rare-complete-copy-of-rasail-ikhwan-al-safa</a></p>",
      "ArtsoftheIslamicWorld2025Lot544": "<p dir=\"auto\">A copy of <span class=\"italics\">al-Risāla al-Jāmiʿa</span>. Cataloguer of Sotheby’s situates it in the 8th/14th century. This seems to be based on layout as there seem to be no manuscript notes, nor a colophon.</p><p dir=\"auto\">Sotheby’s description: 173 leaves, plus 2 fly leaves, 21 lines to the page written in <span class=\"italics\">naskh</span> in black ink, headings, chapters and keywords picked out in red, f.74a with a diagram in red, f.80a and f.81 with letter tables in red, in brown leather binding</p><p dir=\"auto\">26.1 by 17.5cm.</p><p dir=\"auto\">Formerly owned by a Middle Eastern (undefined) ambassador to the United Kingdom.</p>"
    },
    "Iran?": {
      "36390": "<p dir=\"auto\">A manuscript digitised and made available on Quranicthought.com, which can however not be identified securely.</p><p dir=\"auto\">It is a majmūʿa of texts in Persian, none of which are dated, but the first of which appears to be a fairly complete copy of Mujmal al-ḥika. The majmūʿa contains multiple hands, but many of the codicological units do seem to be in the same hand (part of unit 1 = Mujmal al-Ḥikma and most of the more substantial units later on). The following assessment is very cursory.</p><p dir=\"auto\">1a-152a: Mujmal al-ḥikma. Probably missing one folio at start - text starts in introduction</p><p dir=\"auto\">Folio 2a — rubrication for “khulāṣa” of first risala on Arithmetic from 51 epistles of RIS (no mention of Mujmal). Above that, reference is made to Amir Korkan</p><p dir=\"auto\">Diagrams well executed, in red and black ink. Generally quite extensive rubrication.</p><p dir=\"auto\">15 lines per page. No marginalia.</p><p dir=\"auto\">Manuscript executed in two different hands on different paper — perhaps reparations. Until 37b one type of paper and one hand, then 38a darker paper and likely a different hand (at first it seems to be imitating the first hand, but gradually becomes more distinct)</p><p dir=\"auto\">152a middle of the page corresponds to end of published version of Mujmal al-ḥikma. No colophon.</p><p dir=\"auto\"><strong>The other codicological units:</strong></p><p dir=\"auto\">152a-161a : basmala in middle of page introduces a new text (not explicitly named) devoted to a Shii duʿāʾ for ʿAlī, potentially of a ḥurūfī inclination — the duʿāʾ is broken down in its individual letters and then calculations are made with its abjādī properties over the next pages. This ends on 161a</p><p dir=\"auto\">162a-170b: third codicological unit, a text devoted to science of the stars, concluding on a diagram on final page</p><p dir=\"auto\">171a-171b: “tārīkh-e zilzila-yi Kāshān” - an account of the 1192/1778 earthquake (the date is mentioned on the first page), executed in a completely different hand than most of the rest of the manuscript, so this unit cannot be used to get to a reliable terminus post quem.</p><p dir=\"auto\">172a-216b: abridgement of the book of Daniel attributed to Jaʿfar al-Ṣādiq. This is the only unit in the manuscript with extensive marginal annotation.</p><p dir=\"auto\">217a-220a: a text that seems to start in medias res, repeated reference to ḥikma</p><p dir=\"auto\">220b-238b: translation of a “ḥadīth sharīf” from Quṭb al-Dīn Rāwandī’s Qiṣaṣ al-anbiyāʾ - long title in red ink, there is a link to the book of Daniel and various major Shii scholars are named.</p>"
    }
  },
  "Uppsala": {
    "Uppsala University Library": {
      "300ONov526Zn389": "<p dir=\"auto\">Mujmal al-ḥikma partial copy, 11th/17th C. 114 folios, 17-18 lines per page (14x7,5cm), size 20x12cm. Catalogue lists where independent rasa’il start + marginal notes, including one referencing <span class=\"italics\">Shams al-maʿārif</span></p><p dir=\"auto\">Another potential MS in Uppsala: <strong>Persian MSS, fihrist pp. 283-5 -</strong> Mujmal al-ḥikma,<strong> </strong>rasa’il 1-32. [mentioned in Danishpazhuh edition, but not included in Muhaddis]</p>"
    }
  },
  "Vatican": {
    "Vatican Library": {
      "Vatar1608": "<p dir=\"auto\">A <span class=\"italics\">majmūʿa</span> of 107 folios, starting on folios 2-8 with an extract from <span class=\"italics\">RIS</span> announced as the “sixth” epistle from the first qism, matching pp. 126-144 of the Bombay edition according to Della Vida.</p><p dir=\"auto\">Bound with <span class=\"italics\">Kharīdat al-ʿAjāʾib wa farīdat al-gharāʾib</span> by ʿUmar b. al-Muẓaffar b. al-Wardī, dated 11 Dhū l-Qaʿda 1030/28 November 1621.</p>",
      "Borgar265": "<p dir=\"auto\">A short <span class=\"italics\">majmūʿa</span> containing an extract from <span class=\"italics\">RIS</span> alongside other materials (below, based on Giorgio Levi Della Vida’s catalogue description).</p><p dir=\"auto\">The date of 1762 CE (= 1175-6 AH) given in the colophon. There the copyist also identifies himself as Yūnis, “one of the monks of the al-Makhlaṣ monastery [in Lebanon]” but he then specifies that he did the glossing in Ikhmīm, in Upper Egypt. The colophon reads as follows in Arabic (some of the readings are uncertain):</p><p dir=\"auto\">علقه بيده … ام الرهبان اسينا يونس احد رهبان دير المخلص وذلك في الصعيد باخميم سنة مسيحية ١٧٦٢</p><p dir=\"auto\">The manuscript contains extensive marginal annotation.</p><p dir=\"auto\">Folios 1b-9b: A brief extract from epistle 1.7 on the classification of the sciences.</p><p dir=\"auto\">Folios 9v-15a: a <span class=\"italics\">fāʾida</span> on virtue</p><p dir=\"auto\">Folios 15v-19v: an extract from <span class=\"italics\">Ḥall al-rumūz wa-mafātiḥ al-kunūz</span> by ʿAbd al-Salām Ibn Ghānim al-Maqdisī</p><p dir=\"auto\">Folios 20-24: <span class=\"italics\">Muʿrifa fī shurūṭ al-īmān wa–tawba</span></p><p dir=\"auto\">Folio 24v: Chronology of Prophets up to Muḥammad</p><p dir=\"auto\">Folios 27v-46v <span class=\"italics\">Mukhtaṣar Maqāṣid Ḥikmat al-ʿArab al-Falāsifa al-Musammā Ghām Gētī Numā</span> by Ḥusayn b. Muʿīn al-Dīn al-Maybudī Sām Mīrzā Qāḍī Mīr</p>",
      "Vatar494": "<p dir=\"auto\">Very eclectic majmūʿa, full contents listed by Della Vida</p><p dir=\"auto\">Arabic manuscripts institute al-falak 241 - pages 152-183 “madkhal ʿalā ʿilm al-nujūm min rasāʾil ikhwān al-ṣafāʾ”</p>"
    }
  },
  "Vienna": {
    "Österreichische Nationalbibliothek": {
      "CodAF441": "<p dir=\"auto\">Mujmal al-ḥikma, copied 1202/1787-8 by Ṭālib. 241 folios, 16 lines per page. Red rubrication. Some marginal notes in Greek.</p>",
      "CodMixt341": "<p dir=\"auto\">Full copy. 51 epistles. Table of contents, fol. 2v-5r. 288 folios, 37 lines per page. Turkey 16th century (?).</p><p dir=\"auto\">Ownership note of على رشدى ابن الحاج حسن, fol. 2r</p>",
      "CodNF371": "<p dir=\"auto\">Extract(s) in majmūʿa (Persian), “Majmūʿa-yi Rasāʾil-i Fārsī”: “Includes excerpts in Persian by Fīrūzābādī, Ghazālī, Kāshifī, Suhrawardī, Abū Jaʻfar al-Iṣfahānī, Ibn Sīnā, Mustaghfirī, Ibn Ḥusām, Ṭabarī, Yāfiʻī, Muḥammad Nasafī, Bayhaqī, Marwazī, Makkī, Tanūkhī, Saʻdī, Ṭūsī, Muḥammad Kāzarūnī, Najm al-Dīn Rāzī, Ikhwān al-Ṣafāʼ, and others. Table in Turkish of mosques in Istanbul, fol. 109r-110r”</p><p dir=\"auto\">Dated to 949/1542 in Mecca. Copyist Ḥāfiẓ ʿAlī b. Muḥammad Ibrāhīm Fandarsakī (فندرسكى) min bilād Khurāsān.</p>"
    },
    "Vienna Academy": {
      "Vienna1491": "<p dir=\"auto\">Unclear what this MS is and where it is located. ISMI files it as a “revision of Astronomical and Astrological Treatises of Ikhwān al-Ṣafāʾ by Maslamah al-Majrīṭī” but their source is unclear.</p>"
    }
  }
}